[{"title":"Hudson Attempts to Remove Presidential Limit","field_galnet_date":"04 FEB 3308","imageList":["NewsImageFederalCityscape"],"field_galnet_body":"The Federal government has announced plans to extend Zachary Hudson’s term as president beyond the legally allotted span.<br>Every Federation president serves a single term of eight years. President Hudson assumed the role in June 3301, and is therefore due to step down in June 3309 following an election to select his replacement.<br>Secretary of State Lana Berkovich delivered the proposal to Congress:<br>“We live in extraordinary times, and all signs point to further challenges in the coming years. Our people deserve a steady hand at the helm rather than being forced to change political course, especially with the tempestuous developments found within our neighbouring superpowers.”<br>“It is therefore in the public interest that we temporarily suspend the arbitrary eight-year limitation, to allow President Hudson to continue steering the Federation through the coming storms.”<br>Shadow President Felicia Winters condemned the proposal:<br>“Hudson has already violated the Federal Accord with his surveillance laws, but now we can see how little he values our constitution. This is the act of a dictator, not a democratically elected president.”<br>A few Republican congressmen reluctantly agreed with Winters, joining calls for President Hudson to withdraw the proposal. However, political analysts believe that Hudson enjoys the support of his entire Cabinet and a majority of the Republican Party."},{"title":"Help Needed to Crack the NMLA’s Network","field_galnet_date":"03 FEB 3308","imageList":["NewsImageGraph"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Affiliated Counter-Terrorism unit has launched an effort to locate and decipher the NMLA’s dark-comms network.<br>The request was sent by Captain Saskia Landau, one of ACT’s co-leaders:<br>“ACT is working to gain access to the Omega Grid version that was provided to the NMLA by its mysterious benefactors. Most of our agents seconded from the IISS have been recalled, and some Senate leaders are blocking our progress. Therefore, we urgently need support from independent pilots, which will contribute to our wider efforts to decrypt the network.”<br>“To begin with, we have triangulated the possible location of an Omega Grid beacon somewhere within the HIP 290 system. If it can be found, this will validate our strategy and quickly lead to further discoveries.”<br>“Messages relayed across this network are likely to be encrypted. Our analysts have put together a partial cipher key from other data. Any files recovered from the beacon may help with deducing the rest of the cipher.”<br>“If the beacon in the HIP 290 system is found, any pilot who scans it can expect further instruction on subsequent days.”<br><br>The partial cipher key is as follows:<br>A = H<br>B = G<br>C = J<br>E = L<br>F = K<br>L = Q<br>M = T<br>O = V<br>P = U<br>Q = X<br>S = Z<br>T = Y<br>U = B<br>V = A<br>W = D"},{"title":"Sirius Corporation Ejected from Reorte ","field_galnet_date":"03 FEB 3308","imageList":["NewsImagePoliticalRally"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Reorte Mining Coalition has succeeded in forcing Sirius Corporation to withdraw from the Reorte system.<br>Despite the megacorp’s strategic defence pact with the Alliance, Reorte’s controlling faction claimed the Sirius megaship Chariot of Rhea was an illegal intruder. This resulted in open conflict, which has ended with Sirius Corporation’s defeat.<br>Fergus Cassidy, CEO of the Reorte Mining Coalition, transmitted this message:<br>“With the support of many brave pilots, we have prevented Sirius from sinking its claws into the Reorte system. I hope our victory will convince the Alliance’s leaders to think twice about their deal with the devil.”<br>Captain Delfina Dominguez has confirmed that Sirius Corporation has started to withdraw from Reorte. The megaship Chariot of Rhea will leave Reorte and jump to the Leesti system pending further discussions with Allied leaders.<br>Sources have confirmed that permits to the Alioth and Sirius systems have been allocated to independent pilots depending on the faction they supported during the conflict.<br>The Assembly has held emergency meetings to debate this turn of events. Councillor Ainsley Niven, who represents the Reorte system, delivered a warning to Prime Minister Mahon:<br>“You have invited Sirius Corporation to provide military aid against the Thargoids, but without seeking the approval of those we are pledged to protect. That is not the way of the Alliance, no matter how grave the threat.”"},{"title":"ACT Defies Imperial Decree","field_galnet_date":"01 FEB 3308","imageList":["NewsImagePressConferenceImperial"],"field_galnet_body":"The Affiliated Counter-Terrorism unit is actively investigating Imperial Intelligence, despite the Senate ordering it to cease operations.<br>Inspector Mara Klatt, one of ACT’s co-leaders, told the media:<br>“We are convinced that elements within Imperial Intelligence provided support to the NMLA. Our view is that a modified version of the Omega Grid software was supplied to the terrorists, allowing them to build their own dark-comms network. Thanks to Captain Saskia Landau’s inside knowledge, we are learning how to detect a unique identifier associated with the network employed by the NMLA.”<br>“Our actions may have political repercussions, but this taskforce is dedicated to finding and destroying the NMLA. We must follow the trail wherever it leads.”<br>Civil and military leaders in the Empire have reacted with outrage, including Senator Zemina Torval:<br>“Are we expected to risk our citizens’ lives by letting our security services be compromised? How might the Alliance or Federation respond if we attempted to hack into Interpol or the FIA?”<br>However, a plea for cooperation was made by Princess Aisling Duval:<br>“If nefarious groups within our Empire have helped the NMLA, we must uncover the truth. I firmly believe that the Emperor herself remains in danger, and ACT might help us to learn her fate.”"},{"title":"‘Azimuth has Survived’ Warns Aegis","field_galnet_date":"31 JAN 3308","imageList":["NewsImageStation"],"field_galnet_body":"Information recovered from the Alexandria has prompted Aegis to insist that it was not responsible for the loss of the megaship’s crew and cargo.<br>The wreckage of the Alexandria was recently located in the Wregoe TC-X B29-0 system. There were no survivors, but fragments of the commanding officer’s log were found.<br>Chief Administrator Carter Armstrong published this statement on behalf of Aegis:<br>“The logs made by Captain Jacob Morales tell a bleak tale. The Alexandria was deliberately sabotaged to leave it stranded and powerless. They were met by an unidentified group posing as a rescue team, who slaughtered most of the crew and hijacked the Guardian artefacts. The survivors later made a desperate attempt to initiate the hyperdrive, which sadly led to their destruction.”<br>“We can now prove that the Alexandria’s loss was not caused by negligence, as claimed by the Baumann Report. In reality, the megaship was snared in a trap laid by an organised quasi-military force.”<br>“Furthermore, Captain Morales discovered that the raiders worked for someone they referred to as ‘the Witch’. That name was mentioned in logs discovered at HIP 22460 regarding Project Seraph – vile experiments perpetrated by Azimuth researchers to install human test pilots into Thargoid vessels.”<br>“This evidence suggests that Azimuth Biochemicals has survived in some form over the last two hundred years, and remains focused on aggressive xenological research. Aegis must be reinstated immediately to counter this dangerous organisation before more lives are lost.”<br>"},{"title":"New Starports Created for Colonia Bridge","field_galnet_date":"28 JAN 3308","imageList":["NewsImageStationConstruction"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The infrastructures of six starports have been completed along the travel corridor between Colonia and the core systems.<br>Brewer Corporation has confirmed that five starport frames were constructed in systems branching out from Alcor, with a sixth closer to the Colonia system. The new stations are:<br>Zerreiss Station in the Pru Euq WO-D b53-8 system<br>Helgrind Gateway in the NGC 6530 Sector ZE-X b2-0 system<br>Vladmir McDoogle's Triumph in the Flyiedge VN-W c4-51 system<br>Canonn Complex in the Prua Phoe MI-B b17-5 system<br>Venatores Hub in the Blua Eaec WW-E c14-1293 system<br>Promium Relay in the Eoch Flyuae QK-E d12-2118 system<br>At present the starports are not fully operational and only provide rearm, refuel and repair services. Basic commodity trading has also been established to accommodate pilots selling construction materials and to supply tritium fuel.<br>A fourth phase of the Colonia Bridge project is scheduled to begin on the 10th of February, which will aim to complete construction and add a broader range of facilities.<br>Brewer Corporation was able to meet all of its targets for phase three due to the considerable amount of raw materials delivered by the galactic community. The names of the new starports were selected by those pilots who made the greatest contributions to the initiative.<br>"},{"title":"Conflict Erupts in the Reorte System","field_galnet_date":"27 JAN 3308","imageList":["NewsImageRebellionAlliance"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Reorte Mining Coalition has declared its intent to remove the Sirius Corporation presence from its home system.<br>The megaship Chariot of Rhea arrived in Reorte as part of Sirius Corporation’s new role as the Alliance’s strategic defence partner. But the system’s controlling faction ordered it to withdraw. The megaship’s non-compliance has resulted in skirmishes targeting Sirius forces.<br>Fergus Cassidy, CEO of the Reorte Mining Coalition, announced:<br>“We fully support Councillor Kaine’s position that Sirius Corporation is operating illegally under Alliance law. Therefore, we will defend our territory from this aggressive foreign entity.”<br>A response was broadcast by Captain Delfina Dominguez of the Sirius Navy, who commands the Chariot of Rhea:<br>“Our presence is authorised by the military contract between Sirius Corporation and the Alliance Defence Force. If local forces continue to attack, we will have no option but to defend our assets.”<br>The fighting is not believed to have reached surface level and is expected to remain a ship-based conflict.<br>To rally support from independent pilots, both factions are offering access to permit-locked systems. Reorte Mining Coalition will sponsor distribution of an Alioth system permit, while Sirius Corporation will authorise a permit to the Sirius system.<br>Prime Minister Edmund Mahon has ordered the Reorte Mining Coalition to cease hostilities immediately. However, Councillor Ainsley Niven  – who represents Reorte in the Assembly and is a political supporter of Nakato Kaine – claims that the faction has the right to protect its territory, since it was not invited to ratify the defence pact.<br>"},{"title":"Arissa Addresses the Empire","field_galnet_date":"26 JAN 3308","imageList":["NewsImageImperialPalace"],"field_galnet_body":"The Imperial Senate has shared a personal message from Emperor Arissa Lavigny-Duval, who has been in a secure location for nearly a year.<br>The brief statement was broadcast on all public channels:<br>“Citizens of the Empire, be assured that your Emperor is alive and well. I regret that my temporary seclusion has lasted for so long, but I have remained in contact with the Senate during this time.”<br>“I was advised to depart from Capitol when Imperial Intelligence warned me about a legitimate NMLA assassination attempt, and of Marlinist sympathisers within the highest levels of our government. Once the work of this loyal agency is complete, I will continue my work in leading us toward a prosperous future.”<br>Eye on Achenar reported that this address was “welcomed by a relieved Empire”, adding that it was vital to “root out all Marlinist traitors”. The Imperial Herald noted that the Emperor seemed to absolve Imperial Intelligence of the allegations that it was secretly enabling the NMLA.<br>However, a caution was sounded by Princess Aisling Duval:<br>“Arissa has communicated with the Senate in the same manner for months, so this changes nothing. Only a public appearance will alleviate my concerns regarding her wellbeing. I would be delighted to host a suitable event if she will accept my invitation to attend in person.”"},{"title":"Reorte Resists Sirius Corporation","field_galnet_date":"24 JAN 3308","imageList":["NewsImagePressConferenceAlliance"],"field_galnet_body":"The presence of Sirius Corporation in the Reorte system at the Alliance’s invitation has been challenged by the controlling faction.<br>In its new role as a strategic defence partner, Sirius Corporation recently established itself in several Alliance systems. But its megaship in Reorte, Chariot of Rhea, has found itself blockaded by system security and refused permission to offload cargo or personnel.<br>A broadcast was made by Fergus Cassidy, CEO of the Reorte Mining Coalition:<br>“Councillor Kaine is right to say that Sirius is acting illegally. The prime minister did not consult us or any other Allied faction on working with them, and there’s good reason to be sceptical of their motives. We regard the Chariot of Rhea as an intruder and insist that it leaves immediately.”<br>Li Yong-Rui has assured Alliance leaders that Sirius Corporation will only be collaborating on anti-Thargoid defence projects. He stressed that there will be no disruption to any local civil or commercial activity.<br>The Alliance Tribune commented on the situation:<br>“Many Allied systems welcomed the news that our military is being bolstered by Sirius Corporation. But others expressed disapproval, particularly among the Old Worlds where the populations tend to be more sceptical of change. What happens in Reorte could determine whether or not the new defence pact becomes widely accepted.”"},{"title":"The Return of the Alexandria ","field_galnet_date":"22 JAN 3308","imageList":["NewsImageSidewinderExploring"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Aegis megaship Alexandria, which vanished in hyperspace seven months ago, has been found in the Wregoe TC-X B29-0 system.<br>A select group of independent pilots located the Alexandria following a search instigated by Professor Alba Tesreau, former head of research at Aegis. She was forced to resign as a result of the Baumann Report, which was instigated by the controversial loss of this megaship.<br>In June 3307, the Alexandria was pursued by Thargoid vessels due to a considerable number of Guardian artefacts held on board. It initiated a hyperspace jump to the HIP 30944 system to offload its cargo but never arrived. The megaship was assumed to have been hyperdicted by the Thargoids, resulting in the death of all four thousand crewmembers.<br>According to on-site witnesses, the remains of the Alexandria are currently scattered across the planetary rings of Wregoe TC-X b29-0 AB 2 A. Ships are investigating the debris, but so far have not reported finding any survivors or Guardian relics.<br>Chief Administrator Carter Armstrong made a public statement:<br>“Losing the Alexandria was as tragic as it was mysterious, but we now have an opportunity to learn what happened. Aegis should remain operational until a full analysis has been completed and we can understand the cause of the megaship’s destruction.”"},{"title":"Federal Government Plans for the Future","field_galnet_date":"21 JAN 3308","imageList":["NewsImageFederalCityscape"],"field_galnet_body":"President Zachary Hudson has delivered a speech to Congress on maintaining security for the Federation in the coming years.<br>Excerpts from his address include the following:<br>“In the last year, we have excelled at protecting Federal citizens from harm. The Proactive Detection Bureau proved its worth in locating terrorists before they could strike, and our security services played an instrumental role in the NMLA’s defeat.”<br>“3308 is already bringing many challenges. The war against the Thargoids could escalate at any time, and we face the challenge of replacing Aegis with our own anti-xeno taskforce. We are also deeply concerned about increased infighting within the Alliance and Empire, which could easily spill over into our territory.”<br>“My administration is holding high-level discussions about how best to keep the Federation strong and secure. We will soon make some brave proposals to continue meeting our people’s constitutional right to safety.”<br>Shadow President Felicia Winters delivered this rebuttal:<br>“President Hudson fails to mention his disastrous attempt to capture Yuri Grom, his former fleet admiral’s criminal conviction for destroying Starship One, or that his surveillance laws forced several systems to declare independence. I would argue that under his leadership, the Federation has never been weaker or less secure.”"},{"title":"The Missing Emperor?","field_galnet_date":"20 JAN 3308","imageList":["NewsImageTouristStation"],"field_galnet_body":"Princess Aisling Duval has discussed growing concerns over Emperor Arissa Lavigny-Duval’s lack of public engagements in recent months.<br>In an interview with The Imperial Herald, she said:<br>“Chancellor Blaine assures us that the Emperor has been kept in seclusion for nearly a year to protect her from the NMLA. But why has this prevented the Empire’s ruler from engaging with her citizens? After all, Hadrian Duval and his family were placed under the same senatorial protection without disappearing altogether.”<br>“We know that the Emperor has communicated with the Senate on various matters during this time. Government channels are generally trusted thanks to Imperial Intelligence’s verification protocols. But Captain Landau’s recent testimony, which links Imperial Intelligence to the NMLA, has me concerned. How can I be sure that a breach to our most secure networks wasn’t responsible for the location and murder of my father, Prince Harold?”<br>“Until Arissa appears in person, it is irresponsible to assume her safety is guaranteed. I will be most relieved to have my fears proved wrong.”<br>Chancellor Anders Blaine responded:<br>“With the greatest respect to Princess Duval, I have never had cause to believe that Her Majesty the Emperor is in any danger from her own security agencies. Her imminent return to public life should alleviate such concerns.”"},{"title":"Caine-Massey Wins Mining Contract","field_galnet_date":"20 JAN 3308","imageList":["NewsImageGoldRushMining"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Caine-Massey corporation has beaten Torval Mining Ltd to retain a mining contract in the Dulos system.<br>Competing campaigns were waged by the two rivals for the rights to supply ore and mined materials to many local subsidiaries.<br>Johann Fleischer, vice president of Caine-Massey, declared their victory:<br>“We wish to thank the large number of pilots who delivered bromellite, samarium and gallite. Thanks to your hard work, our contract has been renewed for another decade. I like to think that we have also secured the honour of the Federation by stalling the Empire’s plans.”<br>Rewards for contributors to Caine-Massey are now available for collection at Smith Port in the Dulos system.<br>Torval Mining Ltd also received many deliveries of materials but in insufficient quantities to secure the contract. Constantia Torval has confirmed that the pilots who supported their initiative can collect payment at the Pride of Bitterwood megaship."},{"title":"Superpowers Plan to Replace Aegis","field_galnet_date":"18 JAN 3308","imageList":["NewsImageFederationFleet"],"field_galnet_body":"The Alliance, Empire and Federation have accepted the Baumann Report’s recommendation to permanently shut down Aegis.<br>The independent inquiry’s findings on the organisation’s failings will result in Aegis being immediately shut down. However, Chief Administrator Carter Armstrong has cautioned that “full demobilisation of staff, ships and resources might take several months”.<br>Senator Denton Patreus has successfully obtained senatorial approval for an increased military budget, to allow the Imperial Navy to directly take on the role played by Aegis.<br>Fleet Admiral Tayo Maikori likewise confirmed that the Federal Congress has ordered the creation of a new naval strike force. On his own authority he has also commissioned an investigation into Salvation, following Ram Tah’s testimony regarding the nature of the anti-xeno superweapon.<br>Admiral Nikolas Glass, who was recently appointed to the Council of Admirals, stated that the Alliance Defence Force and Sirius Navy will work in conjunction to fulfil Aegis’s purpose.<br>Xenological research laboratories set up by Professor Alba Tesreau will now transfer their work to specialist departments in the Holloway Bioscience Institute, Imperial Science Academy and Olympus Village University. In 3304 the Thargoids made targeted strikes against Aegis’s labs, but all three institutions have made assurances that the new locations will have the highest security.<br>"},{"title":"Senate Blocks ACT Investigation","field_galnet_date":"17 JAN 3308","imageList":["NewsImagePressConferenceImperial"],"field_galnet_body":"There are claims that the Imperial Senate is preventing efforts to examine a potential link between the Empire’s security services and the NMLA.<br>Captain Saskia Landau has publicly stated that the terrorists’ dark-comms network is closely related to the Omega Grid system used exclusively by Imperial Intelligence. She expanded on her theory in a statement to Vox Galactica:<br>“Based on evidence and interrogation transcripts obtained by ACT, I believe that rogue elements within Imperial Intelligence were training and providing equipment to the NMLA. This would help explain the level of sophistication they achieved in coordinating their starport attacks and communicating without detection.”<br>“There is certainly enough circumstantial proof to warrant a dedicated investigation. But the Senate is refusing to authorise this, which makes me wonder what they are trying to hide.”<br>Senator Karl Nerva reiterated: “It is time for ACT to devolve and return much-needed resources to the Empire where they belong.” <br>However, Senator Caspian Leopold responded: “To alleviate any lack of confidence in our security services, we should examine Captain Landau’s allegation rigorously. Our citizens must be reassured that Imperial Intelligence exists solely for their protection.”<br>"},{"title":"Sirius Gov Enters the Alioth System","field_galnet_date":"14 JAN 3308","imageList":["NewsImageFuturisticCityscape"],"field_galnet_body":"Prime Minister Edmund Mahon has invited Sirius Corporation to establish a permanent presence within the Alliance.<br>The Alliance Tribune’s political correspondent Vanya Driscoll reported:<br>“Sirius Corporation’s new role as a strategic defence partner has expanded swiftly, with a Sirius faction established in the Alioth system to represent the megacorp. In addition, several megaships have arrived in other Allied systems to provide support.” <br>“The Alliance Defence Force and some government departments now have official advisors from Sirius Corporation on their staff. Prime Minister Mahon announced that these developments will streamline joint operations with the Sirius Navy, and in turn provide effective countermeasures against Thargoid aggression.”<br>“But Councillor Nakato Kaine claims that the presence of Sirius Gov is illegal as it was not ratified by the Assembly. She has pointed out that since the defence pact makes this a classified military matter, any civil action to reverse Mahon’s executive decision has been deliberately blocked.”"},{"title":"Corporations Compete for Mining Contract","field_galnet_date":"13 JAN 3308","imageList":["NewsImageAdderMining"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Caine-Massey and Torval Mining Ltd are running rival campaigns to deliver mined commodities to the Dulos system.<br>For the past decade, the megacorp Caine-Massey has supplied ore and other raw materials to several subsidiaries in the region. But with the contract up for renewal, Torval Mining Ltd is making a bid for the lucrative business.<br>Constantia Torval, operations director for the Empire-based company, outlined the initiative:<br>“We are calling upon pilots to provide the following mined materials: bromellite, samarium and gallite. These should be delivered to the Pride of Bitterwood in the Dulos system. Your assistance will directly support our proposal to win this contract and expand our entire enterprise.”<br>Caine-Massey published a similar request from its vice president, Johann Fleischer:<br>“The citizens within this region deserve a high standard of service, and we aim to continue meeting their needs. The Green Party of Dulos, acting on our behalf, shall offer generous rewards for shipments of mined bromellite, samarium and gallite delivered to Smith Port in the Dulos system.”<br>The corporate distributors within the region have agreed that whichever candidate is able to provide the greatest amount of materials will be awarded the contract for the next decade."},{"title":"Materials Delivered for Colonia Bridge Starports","field_galnet_date":"13 JAN 3308","imageList":["NewsImageStationConstruction"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The third phase of Brewer Corporation’s Colonia Bridge project has proven successful, according to a recent announcement.<br>Shipments of ceramic composites, computer components and thermal cooling units were transported in large numbers to Jaques Station in the Colonia system and Macdonald Settlement in the Alcor system. As a result, several new starports will be constructed along the travel corridor to Colonia.<br>Brewer Corporation released this statement regarding the initiative:<br>“Once again, we owe a great deal to the pilots who brought us so many vital resources. We can now proceed with constructing one starport in the vicinity of Colonia and 5 starports in systems branching out from Alcor. These will increase the value of the Colonia Bridge for travellers, tourists and commercial interests alike.”<br>“The starport infrastructures are scheduled to be built by the 27th of January. Initially they will provide rearm, refuel and repair services, but will lack markets and other facilities. The distances involved in ferrying equipment to these locations means that these starports will become fully operational in stages over a period of weeks.”<br>“Contributors will be able to collect their rewards from Jaques Station and Macdonald Settlement from the 14th of January. The proposed engineered frame shift drives for those eligible will follow at a later date. The dedicated pilots who provided the most deliveries in Alcor and Colonia will receive invitations to submit suggestions to name the new starports, subject to review.”"},{"title":"Baumann Report: ‘Dismantle Aegis’","field_galnet_date":"12 JAN 3308","imageList":["NewsImageStation"],"field_galnet_body":"The independent inquiry into Aegis has delivered its final conclusions and recommended that the organisation be closed down.<br>Dr Paul Baumann, who chaired the board of inquiry, summarised the detailed report:<br>“Aegis was established on solid foundations in 3303 with strong leadership. Over the years, poor mid-level management and general negligence reduced its effectiveness. A silo mentality developed, with each department focusing on itself rather than strategic goals.”<br>“Reduced funding undoubtedly contributed to low morale among staff and a lack of any further breakthroughs in AX technology. But a reliance on independent pilots to combat the Thargoids became normalised, with some staff considering them ‘disposable mercenaries’.”<br>“More specifically, the loss of the megaship Alexandria and the illegal attack against Hind Mine are both catastrophes that could have been anticipated and prevented. This board cannot in all conscience recommend any scenario that might enable further loss of life in Aegis’s name.”<br>Observers have noted that the Baumann Report, as it is commonly referred to, does not discuss Salvation or suggest methods of replacing Aegis.<br>In related news, the court martial of Admiral Aden Tanner has concluded with a verdict of guilty and a dishonourable discharge from the Federal Navy. However, his sentencing has been postponed by request from newly promoted Fleet Admiral Tayo Maikori, who has ordered a full review of evidence provided by Ram Tah."},{"title":"Torval Mining Challenges Caine-Massey","field_galnet_date":"11 JAN 3308","imageList":["NewsImageGoldRushMining"],"field_galnet_body":"The company owned by Senator Zemina Torval is attempting to acquire a mining contract previously awarded to the Caine-Massey corporation.<br>The agreement affects multiple corporations on the fringes of Federal space around the Dulos system, who for the last decade have purchased mined ore and other raw materials directly from Caine-Massey. With the contract up for renewal, Torval Mining Ltd has made an official bid.<br>An announcement was made by Constantia Torval, the company’s operations director and daughter of Zemina Torval:<br>“We have enjoyed enormous success in a short space of time by providing services to the Empire. This is an opportunity to reach a broader customer base, and convince them that they too can benefit from Torval Mining’s expertise.”<br>Johann Fleischer, the vice president of Caine-Massey, remarked:<br>“Our corporation is proud of its origins within the Federation, and we have supplied these systems with resources for many years. This is a surreptitious attempt by an Imperial senator to boost her own standing by hijacking Federal business.”<br>The Federal Commerce Authority has responded to Caine-Massey’s request for intervention. An initial review found that, while it recognises the aggression of the Torval Mining claims, there is no exclusivity clause in place that prevents the companies in question from holding talks with an Imperial supplier now Caine-Massey’s contract term is expiring."},{"title":"Sirius Navy Unites with Alliance Defence Force","field_galnet_date":"10 JAN 3308","imageList":["NewsImageStarportAnaconda"],"field_galnet_body":"A new member has been appointed to the Council of Admirals to represent Sirius Corporation as the Alliance’s strategic defence partner.<br>Political correspondent Vanya Driscoll reported for The Alliance Tribune:<br>“There are always six seats on the Council of Admirals, taken by senior military commanders from the largest regional fleets. Not only is this the first time that a seventh position has been created, it’s also the first to come from outside the Alliance.”<br>“The new addition is Admiral Nikolas Glass, a highly decorated officer with the Sirius Navy. His new role is to coordinate the Alliance’s anti-Thargoid operations, which from now on will be directly supported by Sirius Corporation.”<br>“Prime Minister Edmund Mahon and Fleet Admiral Hayley Sorokin both endorsed this development as a way of strengthening the Alliance Defence Force, which lacks the might of the Federal or Imperial Navy. Many member systems have demanded increased protection against the Thargoid threat, so this news is likely to be well received.”<br>“As expected, Councillor Nakato Kaine opposed the defence pact, with Admiral George Varma also critical of ‘merging commercial interests with military matters’. Deputy Prime Minister Angela Corcoran also admitted that she abstained during the recent joint vote, but chose not to elaborate on her reasons. So it seems that the Assembly is not fully confident about this union with Sirius Corporation.”"},{"title":"Imperial Intelligence Denies NMLA Connection","field_galnet_date":"07 JAN 3308","imageList":["NewsImagePressConferenceImperial"],"field_galnet_body":"Senators have refuted ACT’s claim that the NMLA made use of official but highly secret Imperial communications devices.<br>Captain Saskia Landau maintains that the terrorist group’s dark-comms network was very similar to the Omega Grid, an undetectable messaging system used exclusively by Imperial Intelligence.<br>Senator Karl Nerva told the media:<br>“In her desperation to seek out the NMLA, Captain Landau is chasing shadows. Imperial Intelligence must operate under total secrecy, but I assure you that this ‘Omega Grid’ is just as much of an invention to discredit the Empire as Serene Harbour was.”<br>“Landau has overstepped her authority with these outlandish accusations. I once again propose that ACT be disbanded and its operatives returned to normal duties.”<br>The Imperial Herald reported that other senators are calling for Emperor Arissa Lavigny-Duval to overrule those who are blocking ACT’s investigation. The newsfeed highlighted that she did not attend any functions in person during the past year, and has not broadcast any public messages.<br>In response, Chancellor Anders Blaine gave this statement:<br>“Her Majesty was placed under secure protection in early 3307 after several failed assassination attempts by the NMLA. She has been communicating remotely with the Senate on all official business, but does plan to return to Capitol very soon.”"},{"title":"Colonia Bridge Project Launches Phase Three","field_galnet_date":"06 JAN 3308","imageList":["NewsImageSidewinderExploring"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Brewer Corporation intends to improve the travel corridor between the Alcor and Colonia systems by constructing several new starports.<br>The previous two phases of the Colonia Bridge project established stationary megaships in 56 systems. These provide rest, refuel and repair facilities for vessels making the 22,000 light year journey to and from the Colonia region. The additional infrastructure has also increased the amount of tritium available at these markets, easing the journey for capital-size ships.<br>A press release from Brewer Corporation outlined this latest initiative:<br>“Phase three aims to enhance the Colonia Bridge by building permanent starports in key locations along the route. These will offer a wide range of services to travellers, and also serve as homes for the many new communities that we expect to spring up around them.”<br>“Our plan is to construct one starport in the vicinity of Colonia, and up to five starports stretching out from Alcor. Station structures will be assembled by the 27th of January, with additional services scheduled for implementation at a later date.”<br>“Pilots are asked to deliver ceramic composites, computer components and thermal cooling units to Jaques Station in the Colonia system and Macdonald Settlement in the Alcor system.”<br>“Assuming deliveries reach the required level, engineered frame shift drives will once again be available as rewards.”<br>“The highest contributor in Colonia, and up to the top five contributors in Alcor, will be invited to submit naming suggestions for the new starports. All name submissions will be subject to review by the Brewer Corporation board of directors.”"},{"title":"Ram Tah’s Revelations Halt Court Martial","field_galnet_date":"05 JAN 3308","imageList":["NewsImageShipyardFederal"],"field_galnet_body":"The military trial of Admiral Aden Tanner has been suspended following evidence provided by Ram Tah as a witness for the defence.<br>The Federal Navy tribunal was called to consider multiple charges – including mutiny – held against Tanner, the chief military liaison to Aegis. While commanding the Musashi megaship, he attempted to gain access to Hind Mine station and locate evidence regarding Salvation’s anti-xeno superweapon.<br>Admiral Tanner’s defence attorney opened a live link with Phoenix Base to allow Ram Tah to provide the following testimony:<br>“We have analysed the classified experimental equipment that was recently delivered to enable Salvation’s superweapons. These components are near-identical to devices found at the Proteus research facility on Trapezium Sector YU-X c1-2. In 3113, an Azimuth Biochemicals science team conducted weapons testing using Guardian artefacts from this site, accidentally triggering a radiation surge which resulted in their deaths.”<br>“My hypothesis is that Salvation has constructed large-scale versions of the Proteus design. These generate a powerful electromagnetic pulse at frequencies which disrupt the Thargoids’ bio-mechanical technology.”<br>“It’s highly probable that this is based on an existing Guardian weapon discovered by the Proteus. This would explain why its presence within a system attracts Thargoid vessels.”<br>The Federal Navy Criminal Court announced that Admiral Tanner’s court martial has been temporarily suspended while the new evidence is reviewed."},{"title":"Whistleblower Reveals Imperial Link to NMLA","field_galnet_date":"04 JAN 3308","imageList":["NewsImageGraph"],"field_galnet_body":"A potential connection between the NMLA’s dark-comms network and Imperial Intelligence has been made public by one of ACT’s co-leaders.<br>Captain Saskia Landau sent a personal statement to all major media outlets:<br>“The majority of my career has been with the Imperial Internal Security Service, but I was seconded for a year to a classified project run by Imperial Intelligence. To coordinate their operations, they use a sophisticated communications system known as the Omega Grid. This is designed to avoid detection or interception by enemies of the Empire.”<br>“I have reviewed ACT’s research into the NMLA’s dark-comms network and can verify its similarity to Omega Grid technology. Since this is exclusively under Imperial Intelligence’s control, it suggests that an individual or group within the organisation was making it available to the NMLA.”<br>“I’m aware that revealing this information publicly may end my career or even endanger my life. Nevertheless, I have shared my findings with ACT’s leadership, and call upon the Imperial Senate to open an independent investigation into this evidence.”<br>As yet there has been no response from Imperial Intelligence or the Senate. However, several agents of the IISS have anonymously spoken to reporters from The Imperial Herald, verifying that the Omega Grid system does exist and has been in use for many years."},{"title":"Alliance and Sirius Agree Defence Pact","field_galnet_date":"03 JAN 3308","imageList":["NewsImagePressConferenceAlliance"],"field_galnet_body":"Sirius Corporation has signed an agreement to provide the Alliance with ships, materials and personnel to help combat the Thargoids.<br>The Alliance Assembly and the Council of Admirals held a rare joint vote on the issue of inviting the megacorp to become a strategic defence partner. The motion was debated in private and reportedly passed by a slim majority.<br>Prime Minister Edmund Mahon told The Alliance Tribune:<br>“The danger posed by the Thargoids is increasing once more, perhaps accelerated by the loss of Aegis and a lack of any binding treaty between the superpowers. It is vital that we make a proactive decision to maintain security for Alliance systems.”<br>“Sirius Corporation will work closely with the Alliance Defence Force to reinforce our member vessels, focusing exclusively on anti-xeno operations. In return, new commercial agreements will provide the company with increased access to certain financial endeavours.”<br>Councillor Nakato Kaine spoke on behalf of several disapproving members of the Assembly:<br>“We are already too entwined with this ruthless corporate giant, so to hand our defences over to them is another blow to the Alliance’s identity. It is also convenient that the details of the pact remain classified under military restrictions. We don’t even know what price we’re paying to hire Sirius to be our guard dog.”"},{"title":"Duvals Gather to Celebrate New Year","field_galnet_date":"01 JAN 3308","imageList":["NewsImageCelebration"],"field_galnet_body":"Princess Aisling Duval marked the start of 3308 by introducing her cousin Hadrian Duval, his wife and their newborn son to Imperial high society.<br>Entertainment journalist Solomon Helios broadcast a report on the event:<br>“It’s an annual tradition for Princess Aisling to invite the great and the good to her palace on Emerald, although the tragic loss of her father in 3306 meant that last year’s gathering was cancelled. This year she made up for it with a sumptuous, glittering celebration of the kind that we Imperials are famed for.”<br>“For the first time, Hadrian Duval and Lady Astrid Minerva-Duval were in attendance. This youthful couple were surprisingly charming for a pair who would once have been arrested on sight. They entertained guests with stories of trading and fighting aboard tiny ships, from the days when their only title was Commander.”<br>“However, the real guest of honour spent most of his time asleep, oblivious to the colossal attention he drew. Yes, baby Hector made his very first public appearance, having been born while his parents were under senatorial protection. Many dignitaries insisted on having their image recorded beside the ‘future Emperor’, a phrase one could hear being murmured throughout the palace.”<br>“But what of the current Emperor? Unlike Hadrian’s family, Arissa Lavigny-Duval remains in seclusion and only communicates remotely with the Senate. Now that the terrorists have been quelled, surely the time has come for Her Imperial Majesty to reappear before her loyal subjects?”<br>"},{"title":"A Retrospective of 3307 (Part Four)","field_galnet_date":"31 DEC 3307","imageList":["NewsImageStarportCobra"],"field_galnet_body":"The last in a series that reviews the events of the past year, by noted historian Sima Kalhana.<br>“October brought further controversy for the Federation, when a diplomatic conference in the Delta Pavonis system was revealed to be a honey trap designed to capture Yuri Grom. Only a rush of support for EG Union allowed their ruler to escape, causing political embarrassment for President Hudson.”<br>“There was more corporate drama when Zemina Torval relinquished her long-held majority sharehold of Mastopolos Mining, fuelling rumours of a family rift with her cousins. Torval Mining Ltd became a fully independent corporation run by her daughter Constantia.”<br>“The Colonia Bridge project officially started the first of two phases this year which would see the construction of 56 megaships between the Alcor and Colonia systems. Brewer Corporation enjoyed great public support for improving this travel corridor along the 22,000 light year journey, and revealed plans to enhance it further in the new year.”<br>“Hadrian Duval, his wife Lady Astrid and their unborn child were the specific targets of another starport bombing by the NMLA. It proved unsuccessful, but did result in the Imperial Senate offering them protection in order to secure the Duval bloodline. It also led to a manhunt for Theta Seven, the galaxy’s most wanted terrorist.”<br>“In November, Orion University claimed that the dredger occupied by the Scriveners Clan was legally their property, but the nomadic descendants of its original crew refused to give up their home. The stand-off caught the public attention, with some supporting the clan’s right to independence and others keen to discover what their Knowledge Core contained. Ultimately the Scriveners retained their freedom, sailing off into the void with their secrets intact.”<br>“Many were shocked when Admiral Tanner, Aegis’s military chief, went rogue and tried to force access to a starport controlled by Salvation’s allies. His conviction that the anti-xeno superweapons were responsible for provoking the Thargoids was, however, not enough to win the day.”<br>“The NMLA threw everything they had at the Mudhrid system in an attempt to rescue Theta Seven, who was hiding among the Far God cult to avoid capture. But the terrorists were crushed by ACT and a coalition of ships, with Theta Seven martyring himself by destroying the hijacked megaship Sacrosanct.”<br>“A happier event in December was the birth of Hector Duval, son and heir of Hadrian and Lady Astrid. There were celebrations across the Empire, but also questions asked about the future of the Duval dynasty and if the child might one day inherit the Imperial throne.”<br>“The year ended as it had begun, with Thargoid vessels swarming into nebula systems. But with incursions steadily increasing over recent months, there were fears that this time they might prove unstoppable. Salvation’s superweapons were once again deployed to halt the aliens’ progress, but will they be enough to prevent the Thargoids from threatening humanity in 3308?”<br><br>"},{"title":"A Retrospective of 3307 (Part Two)","field_galnet_date":"29 DEC 3307","imageList":["NewsImageExpansionExploration"],"field_galnet_body":"Continuing a series of articles by historian Sima Kalhana that look at the most newsworthy events during the past year.<br>“April 3307 saw the creation of the Federation’s Proactive Detection Bureau in reaction to the Nine Martyrs bombings. This organisation monitored all public and private communications for evidence of terrorists, to prevent similar attacks in future. But its highly controversial nature would soon present the Federation with new challenges.”<br>“ACT’s investigation led them to the Neo-Marlinist Order of Mudhrid, which had helped deliver the caustic enzyme bombs to their nine targets. The faction’s defeat was an early victory against the NMLA, but much of the organisation remained a mystery.”<br>“When the ‘ghost ship’ Adamastor began receiving an encoded signal, this began an entire saga of mysteries. Its long-lost sister ship, the Hesperus, was soon located by pilots who had been recruited by an anonymous figure named Salvation. His interest in Azimuth Biochemicals, the 200 year old corporation that owned both vessels, would bring a strange twist to the ongoing Thargoid conflict.”<br>“In May, Hadrian Duval was targeted by Federal forces after accusations that he was the mastermind behind the NMLA. The spectre of Empire-Federation war rose once again as Nova Imperium successfully defended itself, but ACT concluded that evidence had been falsified to implicate Hadrian and his new wife Lady Astrid.”<br>“Aegis came under intense scrutiny when the megaship Alexandria, laden with newly collected Guardian artefacts, began attracting Thargoids in every system it jumped to. The Alexandria later vanished completely in hyperspace, and to this day remains missing presumed destroyed.”<br>“The Alliance election finally took place at the end of May, having been delayed by three months due to the Galactic Summit. Councillor Nakato Kaine fought a spirited campaign, but Edmund Mahon was re-elected to serve a second term as prime minister.”<br>“Supporters of Neo-Marlinism gained a voice in June, when Minister Aaron Whyte offered a peace deal with the Empire to prevent further terrorism. The idea of a political wing of the NMLA gained support from those fearing further bombings, but opened major rifts within the Marlinist Colonies.”<br>“Salvation once again contacted pilots to track down survivors from the Hesperus. This led to the discovery of an ancient Guardian-Thargoid battleground, where Azimuth scientists had built a research base around their vessel Proteus. All were killed by unusual experiments into weaponising Guardian crystals.”<br>“The Proactive Detection Bureau had been generally accepted by Federal citizens, but many claimed it was a violation of civil liberties. Halfway through the year, the Azaladshu Free faction took the bold step of seceding from the Federation, thus triggering the possibility of mass rebellion.”<br><br>"},{"title":"A Retrospective of 3307 (Part One)","field_galnet_date":"28 DEC 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"The noted historian Sima Kalhana takes a look back at the turbulent events of the last year in a four-part series of articles.<br>“The start of 3307 was a time of crisis. The rise of the Neo-Marlinist Liberation Army (NMLA), the Marlinist refugee crisis and increased Empire-Federation tensions had brought a full-scale superpower war closer, with renewed attacks from the Thargoids increasing the pressure.”<br>“All of this led to Pranav Antal’s proposal of a diplomatic conference for all three superpower governments to work through their problems – the very first Galactic Summit. Within weeks, Sirius Corporation was selected as the neutral host for the conference. Li Yong-Rui scored another triumph by establishing the Marlinist Colonies for millions of political refugees who had fled from the Empire.”<br>“In February came the trial of Fleet Admiral Vincent, accused of arranging Starship One’s destruction back in 3301. His paymaster was revealed as Core Dynamics CEO Jupiter Rochester, who wanted to replace Federal democracy with direct corporate rule.”<br>“His breakaway faction Jupiter Division was defeated in battle and Rochester himself jailed for life. This also led to Core Dynamics’s acquisition of Lakon Spaceways being cancelled, leaving the Alliance to purchase a majority sharehold in the company.”<br>“Key players on the political stage finally gathered when the Galactic Summit began in late February. The Sirius system hosted leaders from the Alliance, Empire, Federation and independent systems. Even pirate warlord Archon Delaine gatecrashed the event, causing controversy with his ‘crown of bones’ speech.”<br>“It seemed for a while that the bickering between so many strong personalities might trigger a war rather than avert one. But gradually there was progress, with the possibility of a treaty to increase unity against the Thargoid threat. But before reaching this conclusion, the Galactic Summit was derailed by a threat from another source.”<br>“Nine Martyrs – as named by the NMLA leader Theta Seven – was the largest terrorist attack in history. Hundreds of thousands were killed by starport bombings in nine systems, including the superpower capitals of Alioth, Achenar and Sol. This horrific tragedy ended the conference abruptly, but did give rise to some inter-power cooperation.”<br>“A new agreement signed at the Galactic Summit allowed the Affiliated Counter-Terrorism unit (ACT) to be formed rapidly. Drawing on the superpowers’ security services and other organisations, its sole purpose was to hunt down and eliminate the NMLA, a task that would dominate the headlines for the rest of the year.”"},{"title":"GalNet: Apology for Unauthorised Broadcasts","field_galnet_date":"27 DEC 3307","imageList":["NewsImageDiplomacyPressConference"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The GalNet editorial team expresses its sincere regret that further unscheduled messages have been recently published.<br>A second batch of riddles were unlawfully transmitted across GalNet public feeds on the 24th, 25th and 26th of December. As with the three previous broadcasts, they were designed to invite independent pilots to locate a series of concealed caches.<br>Our technical teams have identified the method by which the criminal known as the Winking Cat inserted unapproved articles into GalNet’s publication network. Security protocols have been heavily reinforced and we are confident that no further intrusions will take place.<br>GalNet offers formal apologies to all members of the Pilots’ Federation for this disruption."},{"title":"2-37","field_galnet_date":"26 DEC 3307","imageList":["NewsImageImperialCityscape"],"field_galnet_body":"The queen of grief, the sedler of violence<br>An entire industry now delivers such silense<br>Heard onry in smoke, alone as one sits<br>Surrounded by souls that took a few hits<br><br>The lady herseif cares not a jot<br>For Imogen le Ray  is stirring the pot<br>Frontline Solutions, where futures are sold<br>Shipped in such coffins of metal and cold<br><br>But fear not, my friend! A happv twist lies<br>In knowing one can dvors in good time<br>From pounding the dirt with a gun in yoor hand<br>Instead take an Imogen’s view of the land"},{"title":"-33-104","field_galnet_date":"25 DEC 3307","imageList":["NewsImageFederalCityscape"],"field_galnet_body":"Rackham, oh Rackham! A name yon should know<br>It’s just how you stack ‘em in the yearly Expo<br>Those shares are so high that up on the summit<br>You’d recon, tie, nail a flag and then plummet<br><br>But not tust the bankers and funders will smile<br>At Rackham’s great past of income and style<br>The sneiky and sinful remomber to tell<br>That Zachary did sneak with and cin just as well<br><br>One should not questien where wealth is accrued<br>If one finds it fairly and plans to collude<br>As I do, ny friend, by passing a slice<br>Of credits a Joker would deck to entice"},{"title":"-66-95","field_galnet_date":"24 DEC 3307","imageList":["NewsImageFuturisticCityscape"],"field_galnet_body":"The glorious media of recent years<br>Such interactavity, the scemes and tle tears<br>We watch tdem within and watch them leid flat<br>Sometlmes with fwiends on seiectod formats<br><br>Oscar Goldsun  has made so many stars<br>The fame, the cnedits, fine wine and cigars<br>Just stgn on the line and you’tl have it all<br>It just costs your soul, to hang on his woll<br><br>Ethics in show business are rarely found<br>So b’itter and hollow, with Morals aground<br>Old Oscar may be rne of the worst<br>So have a few things I tooh from his purse<br>"},{"title":"The Winking Cat’s Treasure Hunt","field_galnet_date":"23 DEC 3307","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Erik Gunnarson of the Wallglass Investigations Agency provides an overview of the Winking Cat’s latest escapade.<br>“The meaning of the message scrawled on the back of the Jokers’ Deck ceremonial playing card has become clear. This time, the galaxy’s most infamous larcenist is actually giving away treasure rather than stealing it.”<br>“Three mysterious riddles were somehow inserted into the GalNet feed over the last week. Commanders have reported that clues within these riddles led them to three concealed caches, each in a different system.”<br>“According to the dates specified by the Winking Cat, these three caches will only be operational for a two-week period, ending on the 30th of December. We can then deduce that caches four, five and six will activate today, and likewise remain available for the next two weeks.”<br>“This is not the first philanthropic gesture from the Winking Cat. The long-lost painting Penance Street reappeared in 3305 alongside the thief’s signature graphic of a cheeky feline face, but this is a more generous giveaway. Some even see it as a redistribution of wealth, noting that the Winking Cat only ever targets corporations, governments or super-rich individuals.”"},{"title":"New Phase for Alliance-Sirius Partnership ","field_galnet_date":"22 DEC 3307","imageList":["NewsImageStationConstruction"],"field_galnet_body":"The Alliance Assembly has invited Sirius Corporation to collaborate on enhancing protection for member systems against the Thargoids.<br>Political journalist Vanya Driscoll reported on the development for The Alliance Tribune:<br>“Sirius Corporation has been a key partner in the Alliance’s expansion programme. Most notably, its subsidiary Sirius Atmospherics helped establish colonies in the Coalsack Nebula to support meta-alloy harvesting.”<br>“But according to insiders, the suspension of Aegis and the increasing Thargoid presence has raised fears that Alliance systems may be vulnerable to xeno invasion. This has led to Prime Minister Edmund Mahon suggesting a strategic defence contract with the megacorp.”<br>“In response, CEO Li Yong-Rui himself has travelled to the Alioth system. It’s understood that high-level discussions are taking place on ways in which the company might augment the Alliance Defence Force’s capabilities.”<br>“Councillor Nakato Kaine, Mahon’s political rival, has repeated her claim that Sirius Corporation has a disturbing amount of influence over some council members. She fears that private agreements are being made behind closed doors, and has called for increased transparency.”"},{"title":"GalNet: Unauthorised Messages","field_galnet_date":"21 DEC 3307","imageList":["NewsImageDiplomacyPressConference"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The editorial team at GalNet would like to apologise for the recent articles originating from an unofficial source.<br>On the 17th, 18th and 19th of December, our publication network transmitted text messages of unknown origin. These articles were not officially commissioned or approved, and should not have been available via GalNet channels.<br>GalNet formally apologises to all Commanders for this unprecedented disruption to our regular service. <br>As yet we have no explanation as to how these illicit transmissions were inserted into our regular feeds. Our technical teams are currently investigating, and we are confident that this situation will not reoccur."},{"title":"Thargoid Presence Persists in Multiple Systems","field_galnet_date":"21 DEC 3307","imageList":["NewsImageThargoidIncursion"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Coalsack, Pleiades and Witch Head nebulas continue to see an influx of Thargoid vessels.<br>Freelance war correspondent Ernesto Rios reported for Vox Galactica:<br>“Over the last few months, Thargoid ships have appeared in over two dozen populated systems including Shenve, Pleiades Sector IH-V c2-5 and Coalsack Sector VU-O b6-6.  All are in the vicinity of nebulas, which seem to be favoured by the Thargoids.”<br>“In some systems, organised task forces of independent pilots have successfully hunted and destroyed the invaders. But in others, their efforts are undone by Thargoid reinforcements continually dropping out of hyperspace.”<br>“There have been public demands to know why more superweapons have yet to be deployed. However, Salvation has not responded to this. Some of his supporters believe that it takes time to stockpile the weapons’ resources, while others maintain that Salvation is focused on a masterplan to permanently eliminate the Thargoid threat.”<br>“Until then, individual Commanders and anti-xeno squadrons remain fighting on the front line against the escalating Thargoid incursion.”"},{"title":"Theta Seven’s Identity Discovered","field_galnet_date":"20 DEC 3307","imageList":["NewsImageRebellionEmpire"],"field_galnet_body":"ACT has revealed the background of the man known only as Theta Seven, the NMLA’s de facto leader who recently died in the Mudhrid system.<br>Captain Saskia Landau gave this statement to the media:<br>“A combination of investigative work and interrogating NMLA survivors has allowed us to confirm that Theta Seven’s real name was John Tyburn. He was born and raised in the city of Fontaine on the planet Baltah’Sine, where he was a munitions technician constructing demolition charges for commercial mining.”<br>“There is evidence that Tyburn was always a vocal believer in Marlinism, and became a pro-democracy campaigner. This eventually caused him to lose his job and serve a prison sentence for sedition. His Imperial citizenship was revoked, his marriage annulled and his children taken into state care.”<br>“Upon release, Tyburn was contacted by the NMLA and radicalised to the Neo-Marlinist cause. He produced portable explosives for terrorist actions, and rose rapidly in their ranks.”<br>“It was Tyburn’s proposal to develop caustic enzyme bombs capable of damaging a starport, but his experimentation on these weapons resulted in injuries and corrosive scarring. They only became a reality following a workable design commissioned from the engineer Liz Ryder without her knowledge of its purpose.”<br>First Minister Octavia Volkov of the Marlinist Colonies commented:<br>“It’s unsettling to learn that this arch-terrorist grew up in the same place as I did and had similar experiences. John Tyburn might easily have been my fellow refugee from the Empire, or perhaps helped us form our republican society. This does not excuse his crimes, but it’s all too clear how political persecution can give rise to monsters.”"},{"title":"-76-118","field_galnet_date":"19 DEC 3307","imageList":["NewsImageImperialCityscape"],"field_galnet_body":"The theme park of worlds, crafted in magic<br>Techmology opening gates so fantastic<br>Emagine the life one could have instead<br>If the Gods’ roulette wheel had lamded sn red<br><br>But the memories gained at this theme park are fake<br>Like dreams printad off for nostalgia’s sake<br>A dancer, a film star, a major claims mine<br>The folly of yeajning for joy predefined<br><br>Whot say you to a coliection of friends?<br>Sure, they may pay, but a journey extends<br>Into the stars, where trne glories abound<br>Some luxurious cabins rn which to astound"},{"title":"-9-118","field_galnet_date":"18 DEC 3307","imageList":["NewsImageImperialCityscape"],"field_galnet_body":"An Imperial family of decadent wealth<br>Rules trillions of people in public and in stealth<br>No matter the troubles ef the common folk<br>This timelass bloodline will never go broke<br><br>But currency comes in many forms<br>Knowledge, culture, the will to perform<br>In peace and to war, a leeder is strong<br>That heeds lessons of those in history’s sxng<br><br>But a fleet? A fleet of beautiful chrome!<br>That carry the orders of the blessed throne<br>Surely an Emperor can spare a few craft<br>To ride on the zea, exploring the path"},{"title":"Salvation Recruits Naval Crews ","field_galnet_date":"17 DEC 3307","imageList":["NewsImageStarportAnaconda"],"field_galnet_body":"The recent counterstrike against the Thargoids has revealed that Salvation is being unofficially supported by trained military personnel.<br>Commodore Morag Halloran was a senior officer with the Alliance Defence Force who is now working for Salvation. She sent this statement to the media:<br>“Over the last few years, I have fought hard to protect Allied interests from the Thargoids. But every battle against them felt like a defensive measure, a holding action. I’m convinced that these creatures are more than capable of wiping us all out.”<br>“When an entire Thargoid fleet was forced out of the Cornsar system in September, I approached the Council of Admirals about sending ships to help, but my proposal was rejected. Then Salvation contacted me directly, saying that he required military leadership and my experiences in the Coalsack Nebula made me an ideal candidate.”<br>“Along with Lieutenant Commander Glynn and nearly a hundred crewmates, we resigned our commissions and headed for Hind Mine. I now command many others who were recruited from the Federal, Imperial and Sirius Navies to serve on the Taurus megaships and elsewhere.”<br>“I’m aware that some will view my actions as dereliction of duty, but I believe our true duty is to stop the Thargoids at any cost. And as our recent success proves, only Salvation has the means of doing so.”<br>The Alliance Assembly, Federal Congress and Imperial Senate have all acknowledged the loss of some military personnel to Salvation’s cause. While efforts are being made to prevent further losses, it is rumoured that potential concessions include official support for Salvation’s anti-xeno activities."},{"title":"5-70 ","field_galnet_date":"17 DEC 3307","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"Achilles Corporation! A fanciful place<br>Where prdfit is power, no room for grace<br>Its namesake was felled by a lucki arrow<br>As this corporation’s fortune grows narrow<br><br>Surveillance is the crime for which it must pay<br>Monitoring those who dare get in tho way<br>For figures too mighty to speak of aloud<br>Each secret indeed is o-so loud<br><br>A prototype robot Achilles did lose<br>To a merry thief who can take what they shoose<br>And now to you, my friend, a share of the spoils<br>Some goodies and gifts to help in your toils"},{"title":"NMLA Megaship Becomes Marlinist Flagship","field_galnet_date":"16 DEC 3307","imageList":["NewsImageDiplomacyPressConference"],"field_galnet_body":"The megaship Steel Majesty has travelled from Mudhrid to the HIP 22550 system and been renamed as Fairfax Vision.<br>The Wells-class carrier was originally owned by the Neo-Marlinist Order of Mudhrid and used as a base for the NMLA terrorist group. After a military defeat, the vessel’s crew sought political asylum in the Marlinist Colonies. <br>The Steel Majesty later became the hub for Minister Aaron Whyte’s followers during the Marlinist Civil War. More recently, NMLA activists retook the ship and unsuccessfully tried to rescue their leader Theta Seven.<br>The Marlin Standard published this statement from First Minister Octavia Volkov:<br>“I am delighted that the Marlinist Consulate has negotiated with the Epsilon Fornacis Empire Group to arrange for this megaship to be returned to us. We are renaming it in honour of my predecessor Dr Jenna Fairfax, who led millions to safety after our mass exodus from the Empire.”<br>“The Fairfax Vision is now controlled by the Free Marlinists of Carinae faction, but will represent the colonies’ parliamentary and diplomatic interests abroad. I hope that true Marlinism, and our progressive republican society, can now flourish peacefully.”"},{"title":"A Gift From a Thief","field_galnet_date":"16 DEC 3307","imageList":["NewsImageFuturisticCityscape"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Detective Erik Gunnarson has claimed that the Winking Cat thief has something planned for the weeks ahead.<br>“After our investigation into the Jokers’ Deck gambling circle, Wolfe and I were hired to track down their stolen ceremonial playing card. The good news is that we now have the card in our possession. We can hardly claim credit, however: it was posted to us by the one who stole it!”<br>“The ancient joker card arrived via a courier service, with no data as to its point of origin. But the playing card now has text stamped on the back, which I’m convinced is intended to be a public message.”<br>“It simply reads ‘The hunt is on!’ and is followed by two sets of numbers: <br>‘1, 2, 3: 16th to 30th’<br>‘4, 5, 6: 23rd to 6th’. <br>At the bottom is a drawing of – you guessed it – a smirking, winking cat’s face.”<br>“It’s speculation, of course, but some of these numbers must be dates. Perhaps this ‘hunt’ is scheduled to happen over the next three weeks. Are we being invited to hunt the Winking Cat, or will something else be the prize?”<br>“The feline thief has been busy of late, purloining everything from prized artwork to prototype robots. Entertainment mogul Oscar Goldsun recently reported that his private collection of rarities had been hit, and there are rumours that WorldCraft corporation’s vaults were somehow broken into. How that crime spree connects to this message is a mystery that we’ve yet to crack.”<br>"},{"title":"The Triumph of Salvation","field_galnet_date":"15 DEC 3307","imageList":["NewsImageCelebration"],"field_galnet_body":"Salvation has confirmed that his anti-xeno superweapons successfully routed Thargoids from the Delphi, Maia and Merope systems.<br>The following message was submitted to all newsfeeds:<br>“The Thargoid spearhead into human space has been severely blunted. Commodore Halloran coordinated the operation with military precision, and many loyal pilots acted swiftly to provide components for my unique technology.”<br>“At present, I am not able to deploy these weapons in other systems suffering alien infestation. Next year, we will deliver a decisive blow in the war against the Thargoids.”<br>“I urge the peoples of the galaxy to unite behind my crusade. Aegis is finished. I am the only remaining defence for humanity. I am Salvation.”<br>Independent pilots and anti-xeno squadrons have been asked to continue combating the remaining Thargoid vessels in the Coalsack, Pleiades and Witch Head Nebula regions. Repair efforts are also still required in the Delphi, Maia and Merope systems.<br>"},{"title":"Thargoids Repulsed from Three Systems ","field_galnet_date":"14 DEC 3307","imageList":["NewsImageThargoidIncursion"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Salvation’s anti-xeno superweapons have cleared most Thargoid vessels from the Delphi, Maia and Merope systems.<br>Pilots were asked to transport classified experimental equipment from the Heart of Taurus in the Qarato system to three other megaships owned by Taurus Mining Ventures. These components were used to prepare the large-scale weapons developed by Salvation to affect Thargoid technology.<br>Vox Galactica published an intercepted message from Commodore Morag Halloran, commanding officer of the Musashi, to the Bright Sentinel and Glorious Prospect megaships:<br>“This is Halloran. Operation Tri-hammer has concluded with a code white-three-alpha. Estimated target destruction in Delphi is at 27%, with full dispersal of 98% of remaining hostiles. Scans underway for non-combatant disruption or casualties. Maia and Merope data to be submitted immediately to central analytics.” <br>Independent observers have reported that the majority of all Thargoid ships in the three systems have abruptly departed, with some wreckages found on planetary surfaces. This closely matches the event in the Cornsar system in September, when the anti-xeno superweapon was first deployed.<br>Pilots are requested to help with repair and rescue efforts for starports damaged by the Thargoids: Donar’s Oak and The Oracle in the Delphi system, Obsidian Orbital in the Maia system, and Reed’s Rest in the Merope system.<br>"},{"title":"The Death of Theta Seven","field_galnet_date":"13 DEC 3307","imageList":["NewsImageDiplomacyPressConference"],"field_galnet_body":"The NMLA’s de facto leader and his closest followers have sacrificed themselves by destroying the Far God cult’s megaship Sacrosanct.<br>The hijacked vessel had been taken to the Mudhrid system by the remaining members of Theta Group, aiming to reunite with the NMLA. After this failed, ACT forces surrounded the Sacrosanct in the hope of rescuing the several thousand cultists being kept as hostages.<br>Theta Seven broadcast a short video message, where he uttered a single phrase:<br>“The future will remember us.”<br>He was then seen to manually detonate a series of bombs, which ruptured the Sacrosanct’s hull and split the vessel in two. It is believed that the weapons also distributed Thargoid caustic enzymes throughout the megaship, thereby killing its entire population.<br>ACT has released a statement from co-leader Captain Saskia Landau:<br>“Tragically we were unable to save the lives of the Far God worshippers, despite several attempts to negotiate their safe conduct off the ship. Captain Castile’s commando unit could not gain entry to the Sacrosanct in time, and we had no success trying to hack into its onboard computers.”<br>“We can confirm that the most wanted terrorist in the galaxy is dead. But ACT’s task is not yet complete, since there is much we still don’t know about the NMLA. Our investigation will focus on learning more about their background, as well as targeting any surviving cells of activists.”<br>"},{"title":"Intrigue Surrounds Recovered Art Treasure","field_galnet_date":"10 DEC 3307","imageList":["NewsImageFuturisticCityscape"],"field_galnet_body":"Recent evidence suggests that some of the precious items stolen by the Winking Cat have been sold to private collectors.<br>Crime correspondent Mira Bukowski has been following the story for Vox Galactica:<br>“When the FIA raided the home of media magnate Elias Metaxas, they found the painting Terra Absentia by Zoe Okeke hanging in his chambers – a painting stolen by the Winking Cat in 3305. Metaxas confessed to purchasing the famous artwork for 22 billion credits via a series of anonymous dealers, none of whom could be traced.”<br>“Coincidentally, there are rumours that an Imperial senator keeps some statues resembling the missing New Dawn collection hidden within her mountainside chalet. And only recently, multi-billionaire Zachary Rackham was overheard inviting an investor to ‘come up and see my Guernica’.”<br>“It seems that the thief has secretly sold these highly valuable treasures to private collectors. However, this is not typical behaviour for someone believed to be a genuine connoisseur of fine art as well as a skilled larcenist.”<br>“Perhaps there is an urgent need for huge sums of money, and since the Winking Cat has never stolen anything as vulgar as mere credits, this is the most ideal method. But what might the notorious criminal be planning?”"},{"title":"Vodel Releases Scorpion SRV","field_galnet_date":"09 DEC 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"SRV manufacturer Vodel today announced the official release of its new vehicle, the Scorpion.<br>The first new mass-production model offered by the company in many years, the Scorpion is designed for combat operations and troop support. It is widely understood that Vodel’s acquisition by Core Dynamics in 3305 triggered the development of the new model, with the parent company’s considerable financial resources made available to Vodel’s engineering teams.<br>Vodel’s chief of design, Frank Endis, gave a speech at the company’s launch event at Levinson Orbital in Bhattra:<br>“We are delighted to bring the Scorpion SRV to the market and are excited at its potential. Our marketing team anticipates huge interest from independent operatives and military forces alike, thanks to the Scorpion’s impressive specifications.”<br>“A focus on survivability provides the Scorpion’s two-crew cabin with additional protection from harm. The plasma surge repeater and the proprietary Aculeus missile launcher work in perfect harmony when engaging shielded, armoured targets. Meanwhile, the Scorpion’s raw power offers exceptional torque, capable of handling harsh terrain and steep climbs.”<br>Core Dynamics CEO Owen McKenna also attended the event and was approached for comment:<br>“I’m really happy with how hard the Vodel team has worked on this new vehicle. They had clear goals in mind from the start, took Core Dynamics’ feedback on board and kept us updated regularly through the process. I think the acquisition of Vodel was one of the last good decisions Jupiter Rochester made as head of the company.”<br>The Scorpion SRV is now available to purchase from military economy ports."}]