[{"title":"Intrigue Surrounds Recovered Art Treasure","field_galnet_date":"10 DEC 3307","imageList":["NewsImageFuturisticCityscape"],"field_galnet_body":"Recent evidence suggests that some of the precious items stolen by the Winking Cat have been sold to private collectors.<br>Crime correspondent Mira Bukowski has been following the story for Vox Galactica:<br>“When the FIA raided the home of media magnate Elias Metaxas, they found the painting Terra Absentia by Zoe Okeke hanging in his chambers – a painting stolen by the Winking Cat in 3305. Metaxas confessed to purchasing the famous artwork for 22 billion credits via a series of anonymous dealers, none of whom could be traced.”<br>“Coincidentally, there are rumours that an Imperial senator keeps some statues resembling the missing New Dawn collection hidden within her mountainside chalet. And only recently, multi-billionaire Zachary Rackham was overheard inviting an investor to ‘come up and see my Guernica’.”<br>“It seems that the thief has secretly sold these highly valuable treasures to private collectors. However, this is not typical behaviour for someone believed to be a genuine connoisseur of fine art as well as a skilled larcenist.”<br>“Perhaps there is an urgent need for huge sums of money, and since the Winking Cat has never stolen anything as vulgar as mere credits, this is the most ideal method. But what might the notorious criminal be planning?”"},{"title":"Vodel Releases Scorpion SRV","field_galnet_date":"09 DEC 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"SRV manufacturer Vodel today announced the official release of its new vehicle, the Scorpion.<br>The first new mass-production model offered by the company in many years, the Scorpion is designed for combat operations and troop support. It is widely understood that Vodel’s acquisition by Core Dynamics in 3305 triggered the development of the new model, with the parent company’s considerable financial resources made available to Vodel’s engineering teams.<br>Vodel’s chief of design, Frank Endis, gave a speech at the company’s launch event at Levinson Orbital in Bhattra:<br>“We are delighted to bring the Scorpion SRV to the market and are excited at its potential. Our marketing team anticipates huge interest from independent operatives and military forces alike, thanks to the Scorpion’s impressive specifications.”<br>“A focus on survivability provides the Scorpion’s two-crew cabin with additional protection from harm. The plasma surge repeater and the proprietary Aculeus missile launcher work in perfect harmony when engaging shielded, armoured targets. Meanwhile, the Scorpion’s raw power offers exceptional torque, capable of handling harsh terrain and steep climbs.”<br>Core Dynamics CEO Owen McKenna also attended the event and was approached for comment:<br>“I’m really happy with how hard the Vodel team has worked on this new vehicle. They had clear goals in mind from the start, took Core Dynamics’ feedback on board and kept us updated regularly through the process. I think the acquisition of Vodel was one of the last good decisions Jupiter Rochester made as head of the company.”<br>The Scorpion SRV is now available to purchase from military economy ports."},{"title":"Support Salvation’s Counterstrike Against the Thargoids","field_galnet_date":"09 DEC 3307","imageList":["NewsImageThargoidIncursion"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Salvation requires vital materials to deploy anti-xeno superweapons in the Delphi, Maia and Merope systems.<br>A message was transmitted from the Musashi megaship by its new commanding officer, Commodore Morag Halloran:<br>“The Thargoids have invaded three key systems, as Salvation anticipated. Preparations have been made to halt their advance, but there is an urgent requirement to collect classified experimental equipment from the Heart of Taurus in the Qarato system.”<br>“Pilots must then deliver these shipments to three other megaships: the Musashi in the Delphi system, the Bright Sentinel in the Maia system, and the Glorious Prospect in the Merope system.”<br>“It is crucial that all deliveries are made by early on Tuesday the 14th of December. Without these components, Salvation’s superweapons will not be able to affect enough Thargoid vessels to turn the tide.”<br>Commodore Halloran was formerly a member of the Alliance Defence Force, and was in charge of protecting the first expedition to the Coalsack Nebula in 3306. She is one of hundreds of naval officers and crew from all three superpowers who have resigned their commissions to offer their services to Salvation, believing that only he can defeat the Thargoids. "},{"title":"Tributes Gathered to Honour Duval Heir","field_galnet_date":"09 DEC 3307","imageList":["NewsImageImperialPalace"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The birth of Hadrian Duval’s son has been celebrated in grand fashion in the Paresa system.<br>Praetor Leo Magnus, the new leader of Nova Paresa, publicly thanked pilots for delivering Chateau De Aegaeon, HR 7221 Wheat, Indi Bourbon and Yaso Kondi Leaf to support these highly exclusive proceedings. Payment is now available from Dyson City starport. <br>Political journalist Cassia Carvalho discussed the arrival of Hector Mordanticus Duval in The Imperial Herald:<br>“As Emperor Hengist’s illegitimate grandson and former enemy of the state, Hadrian Duval has always been the outsider. Indeed, his newborn son’s middle name seems deliberately chosen to remind the Emperor that she ordered Hadrian’s mentor, Imperator Mordanticus, to be shot in cold blood.”<br>“But over the last two years, Hadrian’s position has gradually shifted from isolationist rebel to legitimised ally. He appeals to citizens who are unhappy with a female monarch, even more so now that he has a male heir. And he remains closest to the Imperial bloodline, with most other Duval family members having been assassinated by the NMLA.”<br>“Therefore, unless Arissa Lavigny-Duval or Aisling Duval produce children, it’s entirely possible that Hadrian’s child might inherit the throne. Despite only being a few days old, Hector Duval’s impact upon the Empire could be measured in centuries.”"},{"title":"Standoff for ACT and Theta Seven","field_galnet_date":"07 DEC 3307","imageList":["NewsImageDiplomacyPressConference"],"field_galnet_body":"Terrorist ringleader Theta Seven is defying capture by holding thousands of Far God cultists hostage in the Mudhrid system.<br>Vox Galactica published an on-the-scene report from freelance journalist Redmond O’Hara:<br>“Although the NMLA has been defeated in Mudhrid, the Theta Group bomb-makers remain in control of the Sacrosanct megaship. With so many lives at stake, ACT has focused all its efforts to resolve this tense situation.”<br>“We’ve heard that Senior Agent Ramirez and Inspector Klatt have both tried to open negotiations directly with Theta Seven. It is hard to imagine what they might offer him in terms of clemency, but they’re obviously determined to prevent further deaths at the NMLA’s hands.”<br>“After speaking to one of ACT’s tactical advisors, I can reveal that Captain Castile’s commando unit tried and failed to board the Sacrosanct as it did the Steel Majesty. This is apparently because the vessel is specially modified to prevent external access, in order to provide the Far God cultists with a sanctified environment during their pilgrimage.”<br>“Speaking of the cultists, they may not have accepted their predicament quite as passively as expected. Internal power failures detected within the Sacrosanct’s hyperdrive systems may well be a result of sabotage, and would explain why it hasn’t left the Mudhrid system. Perhaps in their own way, the Thargoid-worshippers are seeking justice for those murdered by Theta Seven’s appropriation of their deity’s ‘holy’ caustic enzymes.”"},{"title":"Dredger Clan Resumes Nomadic Travels","field_galnet_date":"03 DEC 3307","imageList":["NewsImageExpansionExploration"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Scriveners Clan dredger has departed from the Oochost PC-C c29-0 system to an unknown destination.<br>Freelance reporter Casey Kilpatrick provided a report for Vox Galactica: <br>“After a coalition of supporters helped them to bypass Orion University’s override codes, the Scriveners Clan has finally resumed their nomadic lifestyle. To its credit, the university has finally taken stock of public opinion and agreed not to pursue its ownership claims over the ancient dredger.”<br>“Many in the scientific community have pointed out that the contents of the Knowledge Core, around which the Scriveners’ entire culture is based, will now remain a mystery. There are rumours that this tribe of academic researchers have acquired data about the Guardians during their decades of wandering, which was perhaps the real prize sought by Orion University.”<br>“Concerns have also been raised about the Scriveners’ chances of survival if they encounter hostile forces. Had the Scientia Aeterna megaship been allowed to accompany the dredger, it could have offered protection or at least called for assistance. Now that the Scriveners Clan have resumed a solitary existence, their fate is once again entirely in their hands.”"},{"title":"Empire Celebrates Newborn Duval","field_galnet_date":"02 DEC 3307","imageList":["NewsImageImperialPalace"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>A new chapter in the Duval family’s history has begun with the birth of Hadrian Augustus Duval’s son.<br>The announcement was made by The Imperial Herald:<br>“Lady Astrid Minerva-Duval, wife of Hadrian Duval, has delivered a baby boy at an undisclosed secure location while under senatorial protection.”<br>“The child has been named Hector Mordanticus Duval. This is in honour of Hadrian’s late father Hector Jansen, who was Emperor Hengist’s illegitimate son, as well as Imperator Kaeso Mordanticus, who played a major role in both Hadrian and Astrid’s lives.”<br>“Despite Hadrian not being an official member of the Imperial Family, many citizens are jubilant at the arrival of a new Duval. The Imperial Palace, Princess Aisling Duval and Chancellor Anders Blaine have all sent messages of congratulation.”<br>Praetor Leo Magnus, who was Hadrian Duval’s head of security, has resigned his temporary commission from ACT to assume leadership of Nova Paresa. The faction has organised an initiative to gather rare commodities for its former leader to celebrate the historic occasion.<br>Pilots are asked to deliver Chateau De Aegaeon, HR 7221 Wheat, Indi Bourbon and Yaso Kondi Leaf to Dyson City in the Paresa system. All shipments will be subject to security scanning before being redirected to a suitable location."},{"title":"Battle of Mudhrid Ends in NMLA Defeat","field_galnet_date":"02 DEC 3307","imageList":["NewsImageCelebration"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Neo-Marlinist Order of Mudhrid has been defeated by the Epsilon Fornacis Empire Group in the Mudhrid system.<br>With the aid of many independent pilots, the Imperial faction outmatched the NMLA-supporting forces who were attempting to rescue their leader Theta Seven.<br>Captain Saskia Landau provided an update from ACT:<br>“Using the fierce fighting as cover, Captain Milo Castile led a commando unit made up of specialists from Alliance, Federal and Imperial security forces to gain access to the Steel Majesty. After freeing and arming the crewmembers that were being held hostage, they overpowered the NMLA troops and retook the megaship.”<br>“We have successfully prevented Theta Seven and his followers from rejoining their fellow terrorists. But the Far God cult’s vessel, the Sacrosanct, is still in the system under his control. Until the man responsible for hundreds of thousands of deaths has been captured, our victory over the NMLA remains incomplete.”<br>The Epsilon Fornacis Empire Group stated that those who supported its campaign can now receive their rewards from Payne-Scott City starport. <br>The Imperial faction also agreed that independent pilots who fought for the Neo-Marlinist Order of Mudhrid will be permitted to collect payment from the Steel Majesty, which has been transferred to their ownership."},{"title":"Thargoid Invasion of Nebula Systems Intensifies","field_galnet_date":"30 NOV 3307","imageList":["NewsImageThargoidIncursion"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Systems in the California, Coalsack, Pleiades and Witch Head Nebulas are under sustained assault by the Thargoids.<br>Vox Galactica featured this report from freelance war correspondent Ernesto Rios:<br>“Multiple starports have been crippled by Thargoid attacks in recent weeks, with anti-xeno squadrons struggling to protect them. Many Commanders told me that this latest wave is proving unusually difficult to repel, with a steady stream of reinforcements replacing those alien vessels destroyed in battle.”<br>“In normal times Aegis would coordinate the defence effort, but its operations remain suspended due to the Baumann inquiry. Today, it is clear that many of the superpowers’ leaders have more faith in Salvation after his triumph in the Cornsar system, believing that he holds the key to defeating the Thargoids.”<br>“Both the Imperial Navy and the Alliance’s Council of Admirals have suggested committing naval forces to support Salvation. In the Federation, Congress has debated redirecting funds that were ring-fenced for Aegis to accelerate development of the anti-xeno superweapon.”<br>“As yet these are merely discussions, but do illustrate the wide-reaching impact of the Cornsar incident. In the meantime, in the absence of direct support from either Aegis or Salvation, pilots are sacrificing their lives as they fight courageously to push back the Thargoid fleets.”"},{"title":"Aegis Renegades Face Criminal Charges","field_galnet_date":"29 NOV 3307","imageList":["NewsImageDiplomacyPressConference"],"field_galnet_body":"Admiral Aden Tanner and the crew of the Musashi megaship will be placed on trial for attacking Salvation’s allies.<br>The admiral disobeyed orders by attempting to gain access to Hind Mine starport, the headquarters of Taurus Mining Ventures. After failing to achieve this, most of the Musashi’s crewmembers were detained and repatriated to their respective home systems to face civil or military charges.<br>The Federal Navy has published this official notice:<br>“Admiral Tanner is formally accused of mutiny and unlawful military action while in command of the Musashi. He will stand trial in a general court-martial. If found guilty, he will be dishonourably discharged and imprisoned for life.”<br>Dr Paul Baumann, chair of the independent board of inquiry into Aegis, commented:<br>“Recent events in the T Tauri system clearly fall within the scope of our investigation. For Aegis’s chief military liaison to launch an unauthorised attack, at the cost of many lives, will weigh heavily against the organisation.”<br>Admiral Tanner claims that the anti-xeno superweapon deployed by Salvation in the Cornsar system has triggered an increase in Thargoid attacks. Although there is no direct evidence of this, the Thargoids have performed coordinated strikes against several systems in the weeks since that event."},{"title":"Colonia Bridge Project Extended to 3308","field_galnet_date":"26 NOV 3307","imageList":["NewsImageStationConstruction"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The second phase of the Colonia Bridge project is complete, with Brewer Corporation confirming details for phase three.<br>An additional 26 megaships have taken up stationary positions in systems between Alcor and Colonia. Along with the existing 30 megaships, these will provide convenient rest, refuel and repair facilities to those travelling to and from the distant Colonia region.<br>A press release from Brewer Corporation addressed the next steps:<br>“The galactic community has made enormous contributions to establishing the Colonia Bridge. Encouraged by this, we have revised our plans and increased investment in the project.”<br>“The next phase is scheduled to commence on the 6th of January 3308, and will add starports to key locations along the route. These will provide further services and opportunities to pilots, as well as forming permanent micro-communities between the core systems and Colonia.”<br>“Phase three will also address the availability of tritium, to improve refuelling capacity for owners of our Drake-class fleet carriers. To incentivise the delivery of vital materials, we will be offering the same engineered frame shift drives that proved so popular during phase two.”"},{"title":"The Battle of Mudhrid","field_galnet_date":"25 NOV 3307","imageList":["NewsImageRebellionEmpire"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Neo-Marlinist Order of Mudhrid and the Epsilon Fornacis Empire Group have declared war in the Mudhrid system.<br>The Steel Majesty megaship is serving as the base of the Neo-Marlinist forces. These include many surviving NMLA terrorist cells that gathered to overtake the vessel from the Marlinist Colonies. <br>Also in the system is the Far God cult megaship Sacrosanct, where the NMLA’s de facto leader Theta Seven and the remnants of Theta Group have been in hiding for months. They recently took control of the vessel and are holding thousands of cultists hostage.<br>The Neo-Marlinist Order of Mudhrid have offered a uniquely augmented enzyme missile rack to its highest contributors if certain objectives are met. Margrave Corentin Delacroix broadcast a call to arms:<br>“All those who seek to topple the Duval dictators must fight alongside us here and now. Neo-Marlinism has no future unless its believers defend it.”<br>The Epsilon Fornacis Empire Group is orchestrating its campaign from Payne-Scott City starport. Senator Denton Patreus has requested that Imperial auxiliaries provide the faction with combat support.<br>ACT’s co-leader Captain Saskia Landau stated:<br>“The NMLA clearly places huge value on Theta Seven’s ability to produce caustic enzyme weapons, and has risked concentrating in large numbers to defend him. If he can transfer to the Steel Majesty and escape, the threat of further atrocities like the Nine Martyrs bombings will remain high.”"},{"title":"Dredger Clan Freed from Orion University","field_galnet_date":"25 NOV 3307","imageList":["NewsImageExpansionExploration"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Scriveners Clan dredger has been fully repaired, following twin initiatives in the HIP 43670 system.<br>A campaign by supporters of the Scriveners Clan delivered emergency power cells, power converters and power transfer buses to the Alliance of HIP 42371 at Oramus Terminal. A spokesperson for the group announced:<br>“As a result of our efforts, the dredger has received sufficient supplies to effect repairs. Most importantly, the new power systems mean it will shortly be able to bypass Orion University’s override codes and be free to travel the galaxy once more.”<br>A parallel campaign by Orion University’s partner Independent HIP 43670 Labour requested deliveries of anomalous bulk scan data, unusual encrypted files and unidentified scan archives to Shaara Gateway in HIP 43670. However, these were not sufficient to convince the nomadic tribe to agree to its offer of sharing future discoveries.<br>Vice Chancellor Leland Pettigrew expressed his regret, but confirmed that Orion University will honour the outcome and withdraw its claim over the dredger.<br>Contributors to both initiatives can now collect their rewards from Shaara Gateway or Oramus Terminal in the HIP 43670 system."},{"title":"Gatekeeper Megaships Established","field_galnet_date":"24 NOV 3307","imageList":["NewsImageArrivingShip"],"field_galnet_body":"Factions responsible for the distribution of conditional access permits have deployed so-called Gatekeeper megaships to neighbouring systems.<br>The agreement between 14 factions intends to allow permit distribution procedures to continue regardless of the political status of the associated systems. Though the reason for system access restrictions varies between the factions, preventing any disruption to interstellar trade was a key factor in the talks.<br>A spokesperson for Alioth Independents, one of the factions involved, offered the following: <br>“It is rare that so many participants from across the core systems are able to reach an agreement so easily. These megaships will ensure that the flow of traffic within our respective borders remains appropriately controlled, providing support for the permit offices in those systems.”<br>“Only a few short years ago, the system of Tiliala saw disruption in assigning permits to eligible visitors due to political disturbances. The Panjabell system experienced this problem again within recent months. These lessons have inspired us to prevent further repetitions in the future.”<br>“I would like to thank each faction representative for their contributions to maintaining consistency in our methods for the ease of pilots, recognising the valuable contributions they make to the galactic economy.”<br>Permit distribution to eligible recipients will still be carried out remotely."},{"title":"Far God Megaship Hijacked by Theta Seven","field_galnet_date":"24 NOV 3307","imageList":["NewsImageRebellionEmpire"],"field_galnet_body":"NMLA figurehead Theta Seven has taken control of the Sacrosanct megaship and redirected it to the Mudhrid system.<br>Several months ago, the leader of Theta Group and his closest aides evaded capture by posing as members of the Far God cult. One of their pilgrimage vessels, the Sacrosanct, has now bypassed its scheduled flight plan and jumped to Mudhrid.<br>ACT’s joint leader Captain Milo Castile broadcast an emergency statement:<br>“We can confirm that despite being few in number, the terrorists are in command of the Sacrosanct. Since Far God worshippers are pacifists and fatalistic in nature, it’s likely that they offered little resistance.”<br>“Theta Seven has stated that he will wipe out the vessel’s entire population if any attempt to seize the vessel is made. Our intel suggests he possesses caustic enzyme explosives of the type used in the starport bombings, making his threat credible.”<br>Also in the system is the Steel Majesty megaship, recently overtaken by the Neo-Marlinist Order of Mudhrid. ACT believes that the NMLA is regrouping its forces and aims to provide protection for Theta Seven.<br>Mudhrid’s ruling faction, the Epsilon Fornacis Empire Group, has ordered system security to shoot down any vessels attempting to pass between the two megaships. "},{"title":"Crime Wave Raises Security Concerns","field_galnet_date":"22 NOV 3307","imageList":["NewsImageImperialPalace"],"field_galnet_body":"An expert larcenist known as the Winking Cat has triggered widespread alarm with a spree of high-profile thefts.<br>Vox Galactica published this feature by crime correspondent Mira Bukowski :<br>“Last month, the galaxy’s most infamous thief reappeared in the headlines after a long absence. It appears the Winking Cat is making up for lost time by stealing multiple items in quick succession.”<br>“One notable target was a portrait of Emperor Olban Hensard Duval, the tenth ruler of the Empire. Painted in 2989, it was notable for being seven metres high - as was the graphic of a smirking feline face engraved on the wall where it once hung.”<br>“Another disappearance, albeit of a less artistic nature, was the only working prototype of Achilles Corporation’s XS1001 security robot. This was being guarded by several XS801 models which, according to insiders, were found lying on their sides and emitting an unusual ‘purring’ sound.”<br>“There are reports of several other rare or precious artefacts disappearing from secure locations. In all cases, there are no clues as to how security systems were circumvented.”<br>“The Wallglass Investigations Agency has theorised that the Winking Cat may not be an individual after all, but a group of criminal specialists working together. They also suspect that these latest thefts may be intended for some larger purpose.”"},{"title":"Colonia Bridge Project Faces Possible Changes","field_galnet_date":"19 NOV 3307","imageList":["NewsImageStationConstruction"],"field_galnet_body":"Brewer Corporation is enhancing the travel corridor to Colonia, but details about the project’s next phase remain uncertain.<br>Business-related newsfeed The Tau Ceti Journal published this feature:<br>“There’s no doubt that Brewer Corporation always thinks big. It has enjoyed huge commercial success as a manufacturer of starports and outposts, and its Drake-class fleet carrier has been enormously popular.”<br>“The Colonia Bridge is the megacorp’s most expensive undertaking yet, investing hundreds of billions of credits on the transportation infrastructure between the core systems and Colonia. More than one analyst predicted that the project might financially destabilise them.”<br>“The first two phases proceeded on schedule. Before the end of this month, there will be a chain of 56 stationary megaships along systems between Alcor and Colonia.”<br>“But there are rumours of a change of plans for phase three, which may be early next year. It is believed that Brewer Corporation is revising its plans based on the unexpectedly high levels of participation from the galactic community.”<br>“In support of this, one company insider did reveal that more engineered frame shift drives are being manufactured, to be offered as incentives to contributing pilots in the third phase.”"},{"title":"Neo-Marlinist Forces Gather in Mudhrid","field_galnet_date":"19 NOV 3307","imageList":["NewsImageRebellionEmpire"],"field_galnet_body":"The megaship Steel Majesty has arrived in the Mudhrid system after being taken over by NMLA terrorists.<br>Its original owning faction, the Neo-Marlinist Order of Mudhrid, has officially reclaimed the vessel. Margrave Corentin Delacroix, the faction’s new military ruler and the son of former Landgrave Arastin Delacroix, announced:<br>“The Steel Majesty has returned home to fulfil its destiny. Be warned: should any ships attempt to board or attack, all the former crewmembers still onboard will be executed.”<br>Senior Agent Tanya Ramirez gave a statement on behalf of ACT:<br>“Unfortunately, we cannot take action while hundreds of innocent people remain captive. But the NMLA’s effort to assemble troops, supporters and resources must not succeed. Having the Steel Majesty as a mobile base will allow them to regroup for a new campaign of terror – especially if they manage to reach Theta Seven before we do.”<br>A spokesperson for the Epsilon Fornacis Empire Group, which controls the Mudhrid system, claimed:<br>“The hostages should be considered lost as casualties of war. We are prepared to perform our duty for the Empire once again by destroying the Neo-Marlinist threat.”"},{"title":"Dredger Deadlock Inspires Competing Campaigns","field_galnet_date":"18 NOV 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The HIP 43670 system is hosting two competing delivery initiatives, each of which aims to benefit the Scriveners Clan.<br>Orion University has partnered with Independent HIP 43670 Labour, which is requesting deliveries of anomalous bulk scan data, unusual encrypted files and unidentified scan archives to Shaara Gateway in HIP 43670. <br>The university’s campaign was explained by Vice Chancellor Leland Pettigrew:<br>“Although Dredger J-403 is legally our property, what we value most is the Scriveners Clan’s dedication to deep-space research. To convince them of our noble intentions, we are donating scientific data and samples to their Knowledge Core. Our proposal is that they permit us to accompany them on their journey and share in any future discoveries.”<br>An alternative campaign is also taking place in the HIP 43670 system. Supporters of the Scriveners Clan are being asked to gather emergency power cells, power converters and power transfer buses and deliver them to the Alliance of HIP 42371 at Oramus Terminal. A spokesperson told the media:<br>“These supplies are needed to perform vital repairs to the dredger. Furthermore, if the power systems are sufficiently updated, they can bypass the ancient components affected by Orion University’s override codes and continue travelling independently.”<br>Although there remains no response from the Scriveners Clan, the dredger is now actively monitoring all local and interstellar transmissions. This is a new development for the isolated community, and suggests they are aware of these campaigns."},{"title":"Salvation’s Allies Triumph in T Tauri System ","field_galnet_date":"18 NOV 3307","imageList":["NewsImageTrade"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Taurus Mining Ventures has defeated a rogue Aegis Defense force and gained control of the megaship Musashi.<br>The conflict was initiated by Admiral Aden Tanner, chief military liaison with Aegis. He was attempting to gain access to Hind Mine asteroid base, in search of evidence that Salvation’s anti-xeno weapon was deliberately designed to provoke the Thargoids.<br>Patience Middleton, a spokesperson for Taurus Mining Ventures, made this announcement:<br>“This was an illegal and unnecessary conflict, brought about by Admiral Tanner’s misguided obsession. We will continue working with Salvation to eliminate the Thargoid threat.”<br>“Our defence was only possible thanks to our courageous supporters, for whom rewards are available at Hind Mine. We will also honour agreements that the Aegis Defense force made with independent pilots, who can collect their promised payments from the Musashi.”<br>Taurus Mining Ventures later confirmed that all members of the Musashi’s original crew will be allowed to leave the megaship unharmed. Admiral Tanner and other key personnel are in temporary custody. Aegis has arranged for them to be transferred to its internal security teams."},{"title":"NMLA Retakes the Steel Majesty","field_galnet_date":"17 NOV 3307","imageList":["NewsImageRebellionEmpire"],"field_galnet_body":"A former Neo-Marlinist megaship has been overrun by NMLA terrorists in the Hyades Sector RO-P b6-2 system.<br>The Steel Majesty was originally owned by the Neo-Marlinist Order of Mudhrid, one of the NMLA’s key allies. After their defeat, it ferried many of them to the Marlinist Colonies where they were granted asylum by Minister Aaron Whyte. His faction then made use of the megaship during the civil war in August.<br>Minister Jean-Christophe Lyon, the current leader of the Marlinism Reformation Party, gave a statement:<br>“Despite our efforts to arrest any remaining extremists within our faction, a surviving group has gained access to the megaship. Security feeds show they were joined by several teams of well-armed NMLA fighters.”<br>“The Marlinist Constabulary evacuated around half of the Steel Majesty’s crew before the NMLA took operational control. Sadly, there is no way to free those still trapped onboard.”<br>The situation was addressed by ACT’s co-leader Captain Milo Castile:<br>“According to our intel, a majority of the NMLA’s surviving cells have gathered together for this operation. We believe they were assisted by not only Aaron Whyte’s loyalists, but also members of the megaship’s original crew from the Mudhrid system.”<br>“It is possible that this Neo-Marlinist coalition was formed as a result of us closing in on Theta Seven. We have requested additional support from all security services.”<br>"},{"title":"Theta Seven Traced to Panjabell System","field_galnet_date":"16 NOV 3307","imageList":["NewsImageFederalCityscape"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>A decrypted message suggests that the NMLA leader Theta Seven avoided capture by infiltrating the Far God cult.<br>ACT publicly requested help to decode a message received by Theta Group, the bomb-making engineers of the NMLA. The cipher key was cracked and the decoded message submitted by Commander Therion Cygni. It revealed that Theta Seven and his closest aides fled to the Panjabell system on the 31st of July.<br>Captain Milo Castile, one of ACT’s co-leaders, provided an update:<br>“Our theory is that Theta Seven and his crew were travelling undercover as Far God worshippers, who were gathering in the Panjabell system in huge numbers at that time. Since all members of this religious order renounce their past identities, this would have helped the terrorists to avoid detection.”<br>“The Pleiades Concordat and other factions in Panjabell are cooperating with our investigation. But it seems likely that Theta Seven is currently hiding aboard one of the three Far God megaships that were launched from the system on the 6th of August.”<br>“ACT agents have attempted to contact the Perdition, Sacrosanct and Testament megaships to alert them of the danger. Unfortunately the cultists consider themselves to be on a sacred pilgrimage that cannot be impeded, and that their vessels are ‘sanctuaries from further persecution by hostile security services’.”"},{"title":"Dredger Clan Faces Possible Extinction","field_galnet_date":"15 NOV 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"Orion University has been informed that its ownership claim of the Scriveners Clan dredger is placing its population at great risk.<br>In the Oochost PC-C c29-0 system, the university’s megaship Scientia Aeterna has used override codes to prevent the dredger from departing. But the nomadic tribe’s refusal to abandon their home has placed them under great pressure, as observed by freelance reporter Casey Kilpatrick:<br>“Dredger-class bulk cruisers are the sharks of space – they must always keep moving, constantly gathering raw materials to synthesize into fuel, air and other resources. The Scriveners Clan remained stationary for months while salvaging the Hesperus, but in this system they are trapped without such vital intakes.”<br>“Independent observers are now reporting malfunctions in the vessel’s power and life support systems. If the Scriveners maintain their siege mentality, further mechanical failures are inevitable. Orion might inherit the dredger after all, but it will be a ship of the dead.”<br>Professor Elizabeth Perez, Orion University’s head of anthropology, responded:<br>“The last thing we wish is for any harm to befall these people. My colleagues are urgently discussing ways to convince the Scriveners Clan that we have their best interests at heart. After all, as fellow scientists and researchers, they are a living embodiment of our university’s core values.”"},{"title":"Manhunt for Theta Seven Escalates","field_galnet_date":"12 NOV 3307","imageList":["NewsImageFederalCityscape"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Affiliated Counter-Terrorism unit has acquired an encrypted message that may reveal Theta Seven’s location.<br>ACT successfully captured most of the bomb-making engineers known as Theta Group, and has now prioritised hunting down the NMLA’s de facto leader.<br>This latest breakthrough was explained by Captain Milo Castile:<br>“Theta Group managed to delete most of their data prior to capture, but we retrieved a short message that they received on the 31st of July. At this point most of Theta Group were being harboured by Neo-Marlinist sympathisers within the Marlinist Colonies, but Theta Seven and his closest aides had fled to an unknown destination.”<br>“Unfortunately the message has been encrypted using a pre-arranged cipher key, without which its contents are unreadable. It is unclear why this wasn’t transmitted via the NMLA’s dark-comms network, which remains undetectable despite our best efforts.”<br>“As it’s possible that this was sent by Theta Seven, we welcome any assistance from the galactic community in decoding it. This ruthless terrorist must be tracked down before he can take more innocent lives.”<br>ACT has requested that all newsfeeds publish the encrypted message, which is as follows:<br>61-76-126-67-99-74-71-113-81-41-96-103-51-117-55-103-91-69-104-117-84-114-141-134-90-108-90-79-115-95-102-102-98-76-91-57-83-104-92-99-96-78-79-83-132-115-80-106-91-150-114-105-148-144-93-163-83-138-123-94-108-115-81-128-147-162-131-140-150-129-29-98-99-59-74-125-55-123-107-112-98-108-82-91-124-71-75-111-109-95-129-89-155-135-98-131-149-97-151-105-152-152-144-128-155-64-81-123-89-90-87-96-59-116-127-52-94-103-51-89-51-47-98-88-61-112-112-111-129-147-124-153-134-109-87-114-121-80-90-113-111-153-131-84-104-131-84-151-113-129-130-117-105-123-73-99-126-106-118-144-97-83-123-104-75-78-90-49<br>There is a substantial reward on offer for the first person to submit a correctly deciphered version of this message to ACT."},{"title":"Aegis Renegades Attack Salvation’s Allies","field_galnet_date":"11 NOV 3307","imageList":["NewsImageStarportCobra"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>A rogue Aegis Defense force has initiated conflict with Taurus Mining Ventures in the T Tauri system.<br>The megaship Musashi is commanded by Aegis’s chief military liaison Admiral Aden Tanner, who made this announcement:<br>“The Hind Mine asteroid base contains proof that Salvation’s unlicensed anti-xeno weapon is intentionally designed to provoke the Thargoids, and therefore endangers us all. As Taurus Mining Ventures refuses to cooperate, we have no choice but to obtain the evidence by force.”<br>“This may be our only opportunity to discover Salvation’s true ambitions. I urge all independent pilots who have fought alongside Aegis to help us complete this vital mission.”<br>Patience Middleton, a spokesperson for Taurus Mining Ventures, responded:<br>“This is an illegal attack that jeopardises the important work we are undertaking on behalf of Salvation. It is in the galactic community’s interests to defend our corporate headquarters.”<br>Aegis officially stated that Admiral Tanner is acting on his own authority, and that the Musashi’s presence in the T Tauri system is in direct violation of orders. Despite this, there are reports that Tanner has tacit support from many members of Aegis, who disagree with the public inquiry that has suspended its operations."},{"title":"Colonia Bridge Gains Further Resources","field_galnet_date":"11 NOV 3307","imageList":["NewsImageExpansionExploration"],"field_galnet_body":"*Pilots Federation ALERT*<br>Successful campaigns in the Alcor and Colonia systems will result in new megaships being added to the Colonia Bridge.<br>Large quantities of ceramic composites, computer components and thermal cooling units were provided at either end of the route between the core systems and the distant Colonia region.<br>Brewer Corporation provided an update on the project: <br>“Once again, the galactic community has provided the vital materials required to construct dockable megaships. These additional ports should be operational by the 25th of November, making journeys to and from Colonia easier and safer.”<br>“Pilots can now collect their rewards from Macdonald Settlement in the Alcor system and Jaques Station in the Colonia system. We shall also be awarding an engineered frame shift drive with long range and fast boot to the majority of contributors.”<br>The top ten pilots who delivered materials to Alcor and Colonia will shortly be invited to submit suggestions to name the new megaships. Submissions will be subject to review by the Brewer Corporation board of directors. To ensure a variety of choice, only pilots who have not yet submitted names for the Colonia Bridge megaships will be eligible.<br>"},{"title":"Long-Lost Research Facility Discovered","field_galnet_date":"10 NOV 3307","imageList":["NewsImageSidewinderExploring"],"field_galnet_body":"*Pilots Federation ALERT*<br>A distress call has led independent pilots to locate an abandoned settlement in the Snake Sector GW-W c1-1 system.<br>The SOS was initially detected by one of the megaships that form the Colonia Bridge, inspiring many ships to search nearby systems. The source was eventually identified as Holloway Bioscience Research Facility 15 on the moon Snake Sector GW-W c1-1 AB 5 b.<br>Pilots unearthed a series of mission logs recorded in the year 3255 by a freelance military unit named Excalibur Troop. As yet, the contents of these logs have not been made available to newsfeeds.<br>Aanya Gupta, CEO of the Holloway Bioscience Institute, gave a statement to the press:<br>“Research Facility 15 was one of the first wave of planetary survey laboratories established by our founder, the esteemed scientist Lord Roland Holloway. Our records of these settlements are patchy, so we are grateful that this has been located.”<br>“Unfortunately, we can find no data regarding Excalibur Troop or the circumstances under which they were contracted. Our investigative teams are on-site to gather further information.”<br>The Holloway Bioscience Institute refused to comment on rumours that a previously unidentified life form had been encountered by the research facility’s original crew.<br>"},{"title":"No Progress with Dredger Deadlock ","field_galnet_date":"09 NOV 3307","imageList":["NewsImageDiplomacyPressConference"],"field_galnet_body":"The nomadic Scriveners Clan continues to resist Orion University’s attempts to take possession of their dredger.<br>Freelance reporter Casey Kilpatrick published an update from the Oochost PC-C c29-0 system:<br>“Orion University’s claim that the vessel is their property has been countered by Advocacy’s reminder of laws preventing cultural contamination. So the question now is: who actually owns the dredger? Is it the families that have lived there for generations, or the organisation which originally built it?”<br>“Various solutions have been proposed to resolve this stand-off. These include an offer from Canonn Interstellar Research Group to purchase the dredger from Orion University, gift it to the Scriveners Clan then publicly share the contents of their mysterious Knowledge Core.”<br>“However, two centuries of isolation have instilled this academia-focused society with a pathological need to protect its research. They are no more likely to cooperate than a deeply religious nation asked to hand over its most holy artefact.”<br>“Orion’s megaship Scientia Aeterna is still transmitting requests to communicate. I have even seen one of its secondary craft narrowly avoid being consumed by the dredger’s maw while searching for an access point. But the Scriveners are locked down tight, and this siege situation shows no sign of ending.”"},{"title":"ACT Captures Theta Group","field_galnet_date":"08 NOV 3307","imageList":["NewsImageBountyCollection"],"field_galnet_body":"The creators of the NMLA’s caustic enzyme bombs have been arrested, although the terrorist figurehead Theta Seven remains at large.<br>Theta Group is directly responsible for 17 starport bombings conducted by the NMLA across the core systems. These attacks resulted in a combined death toll of almost 800,000 people, with twice as many suffering serious injury.<br>Senior Agent Tanya Ramirez, one of the Affiliated Counter-Terrorism unit’s co-leaders, told the media:<br>“We have finally tracked down the NMLA’s bomb-making engineers, and a joint task force made the arrest with minimal casualties. Large quantities of Thargoid corrosives and explosive components were also seized.”<br>“This achievement was only possible due to intercepting Theta Group’s communications with Neo-Marlinist sympathisers. We are unsure why the NMLA’s dark-comms network was not used in that instance.”<br>“As our intel predicted, the group’s leader Theta Seven was not among those we captured. We have confirmed that he and a handful of followers disappeared after the bombings in July, anticipating their imminent capture. ACT will not rest until the galaxy’s most wanted terrorist has been brought to justice.”<br>The name ‘Theta Group’ was assigned to the bomb-makers during their incarceration at Serene Harbour, an Imperial Intelligence penal facility in the R CrA Sector AF-A d42 system. After escaping, their leader adopted his prisoner designation – Theta Seven – as a reaction to what he viewed as dehumanising treatment of Neo-Marlinists by the Empire.  "},{"title":"Aegis Leader Opposes Salvation","field_galnet_date":"05 NOV 3307","imageList":["NewsImageDiplomacyPressConference","FederationIconNewsImage"],"field_galnet_body":"Admiral Aden Tanner has called for Aegis to reject the public inquiry’s shutdown and take direct action against Salvation.<br>The Musashi, an Aegis Defense megaship under his command, has entered the T Tauri system to challenge Taurus Mining Ventures. The corporation has performed activities on Salvation’s behalf, including preparation for the anti-xeno weapon used to eliminate all Thargoids from the Cornsar system.<br>Admiral Tanner transmitted this message to media outlets:<br>“Salvation’s unlicensed weapons technology is deliberately designed to provoke the Thargoids, risking millions of lives. My sources tell me that Hind Mine asteroid base contains evidence of this. I therefore demand that Taurus Mining Ventures allows us access so we can determine the truth.”<br>Patience Middleton of Taurus Mining Ventures responded:<br>“We are a legitimate business under contract to a private citizen, whose activities are protected by confidentiality agreements. These threats have no legal standing and are not welcome.”<br>Admiral Tanner is a highly decorated Federal Navy officer and Aegis’s chief military liaison, having coordinated many combat efforts against the Thargoids. The Musashi’s relocation has been condemned by Aegis leadership, and Tanner has been ordered to depart the T Tauri system.<br>"},{"title":"Colonia Bridge Project Enters Phase Two","field_galnet_date":"04 NOV 3307","imageList":["NewsImageDiplomacyPressConference","FederationIconNewsImage"],"field_galnet_body":"*Pilots Federation ALERT*<br>Brewer Corporation requests deliveries in the Alcor and Colonia systems for the next phase of the Colonia Bridge project.<br>A successful initiative in October resulted in the placement of 30 dockable megaships at intervals of several hundred light years, providing services such as refuelling and repairs. The second phase seeks to establish this support for the full route between the core systems and the Colonia region.<br>A press release from Brewer Corporation stated:<br>“We are now ready to continue work on the Colonia Bridge, by constructing additional megaships to fill the middle of the planned route. As before, we require shipments of ceramic composites, computer components and thermal cooling units at Macdonald Settlement in the Alcor system or Jaques Station in the Colonia system.”<br>“Should deliveries reach sufficient levels, the top 75% of contributors will be awarded an engineered frame shift drive with increased range and faster boot sequence. Our hope is that this encourages deep space explorers and long-distance haulers to take part in the Colonia Bridge project.”<br>As an additional reward, the top ten contributors at Alcor and Colonia will be invited to submit naming suggestions for the new megaships. Submissions will be subject to review by the Brewer Corporation board of directors. To ensure a variety of choice, only pilots who have not yet submitted names for the Colonia Bridge megaships will be eligible."},{"title":"Demands for Federal Rebellion Decline","field_galnet_date":"03 NOV 3307","imageList":["NewsImageFederalCityscape","FederationIconNewsImage"],"field_galnet_body":"Many factions have seceded from the Federation in recent months, but recent polls suggest the likelihood of further withdrawals is waning.<br>The Federal Times published an update on the situation by political correspondent Sofia Trevino:<br>“Some negative reaction to the Proactive Detection Bureau was anticipated. But it’s unlikely that Congress foresaw nearly forty systems abandoning the Federal Accord, as their governing factions declared independence.”<br>“Fears that this would spiral into mass rebellion now seem misplaced, however. This is partly thanks to the PDB’s recent role in preventing Jupiter’s Wrath from committing terrorist acts. Although that group is hardly in the NMLA’s league, evidence that communications surveillance can save lives seems to have convinced some Federal citizens to reconsider their opposition.”<br>“President Hudson’s efforts against the breakaway factions were hailed by his supporters and decried by his opponents. But the Federal Diplomatic Corps remain displeased that Hudson suffered no repercussions for violating diplomatic immunity when attempting to capture Yuri Grom.”<br>“Shadow President Winters continues to call for the PDB to be shut down to prevent the Federation from becoming an authoritarian police state. But many accuse her rhetoric on civil liberties to have triggered the secessions in the first place.”<br>“Meanwhile, many Federal factions are carefully observing those who did become independent. Their future success or failure may well determine whether or not this rebellion continues.”"},{"title":"Hadrian Duval Accepts Senate Protection","field_galnet_date":"02 NOV 3307","imageList":["NewsImageImperialCityscape","EmpireIconNewsImage"],"field_galnet_body":"The Empire has officially proclaimed Hadrian Augustus Duval and his wife Lady Astrid Minerva-Duval to be wards of the Senate.<br>The offer of senatorial protection was made following an NMLA attempt to assassinate them and their unborn child by bombing Dyson City starport.<br>Prior to being transported from the Paresa system to a secure location, Hadrian Duval sent this message:<br>“Lady Astrid and I accepted this offer with enormous reluctance. Neither of us wish to abandon our home or loyal followers. Yet we feel it is a matter of duty to protect our family and ensure future generations of the Duval bloodline.”<br>“Nova Imperium will henceforth be known as Nova Paresa. It will continue to serve as a staunch ally of the Empire, as per the Treaty of Paresa. To all those who fought for our cause over the years, I assure you that history will never forget us. Memento Mordanticus!”<br>There has been public support for Praetor Leo Magnus to assume leadership of Nova Paresa. Hadrian Duval has endorsed his former head of security taking his place, but confirmed that the title of Imperator is now defunct.<br>In related news, ACT stated that its investigation into the Dyson City attack has yielded results. Although details remain embargoed for security reasons, a significant breakthrough is expected to be announced soon.<br>"},{"title":"Advocacy Defends Dredger Clan","field_galnet_date":"01 NOV 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"The Scriveners Clan’s legal ownership of their dredger has been supported by the civil rights organisation Advocacy.<br>The ancient Dredger-class bulk cruiser, currently located in the Oochost PC-C c29-0 system, is inhabited by a nomadic tribe descended from the vessel’s original crew. Orion University claims that the cruiser is its commercial property, but has failed to make contact with its occupants.<br>Rhiannon Grady, director of Advocacy, explained:<br>“For centuries, there has been widespread legislation to protect remote communities from cultural contamination. These laws apply to micro-societies, such as those found aboard generation ships, that evolved in isolation.”<br>“Therefore, Orion University should not presume to deprive over ten thousand people of the only home they have ever known. Unlike cases such as the Golconda, which requested emergency assistance, in this case we are legally and morally obliged to respect the status quo.”<br>Professor Elizabeth Perez, head of anthropology at Orion University, responded:<br>“I was involved with the Golconda aid efforts, and fully appreciate the delicacy of this situation. But the dredger’s age and condition makes it a hazardous environment for its people. Evacuation should be considered for their own safety, with appropriate measures to minimise cultural disruption.”<br>The university’s megaship, Scientia Aeterna, has halted attempts to gain access to the Scriveners Clan dredger. However, it has not withdrawn its remote override of the vessel’s hyperdrive.<br>"},{"title":"Initial Stage of Colonia Bridge Operational","field_galnet_date":"29 OCT 3307","imageList":["NewsImageExpansionExploration"],"field_galnet_body":"*Pilots Federation ALERT*<br>Thirty megaships have been placed between the core systems and the Colonia region to serve as stationary ports.<br>Twenty-five dockable megaships were sent out from the Alcor system toward Colonia, taking position in systems approximately 400 to 500 light years apart. Five further megaships have been established from the direction of the Colonia system.<br>Each vessel serves as a permanent way station for travellers and businesses, designed to improve the journey to and from Colonia. A variety of services are provided, including tritium refuelling for Drake-class fleet carriers.<br>The Colonia Bridge is the product of Brewer Corporation, which ran a highly successful deliveries campaign to collect resources. The megacorp has confirmed that phase two of this project will commence next week.<br>During the creation of the Colonia Bridge, the crew aboard the stationary megaship Memories of Oresrati in the Snake Sector OD-S b4-2 system reported an unusual incident. A distorted transmission that could have been an SOS was detected on long-range sensors. Although they were unable to triangulate its source, the signal strength suggested a point of origin within 50 light years.<br>"},{"title":"The View from Colonia","field_galnet_date":"29 OCT 3307","imageList":["NewsImageExpansionExploration"],"field_galnet_body":"Vox Galactica’s culture correspondent Lishan Abara looks at the Colonia region, the largest enclave of humanity outside the core systems:<br>“Colonia. A place that few ever see, which exists following a computer malfunction. The famed Jaques Station suffered a mis-jump on its scheduled journey to Beagle Point, relocating some 22,000 light years from Sol. The subsequent rescue effort led to the establishment of the first permanent base in what is now considered a new frontier for humanity.”<br>“Over the last five years, courageous explorers have struck out to inhabit several dozen local systems. This, in turn, invited a steady stream of colonists seeking a fresh start. Nearly 13 million souls now count this remote area as their home.”<br>“This is a place beyond the influence of the superpowers and mega-corporations, and most residents prefer it that way. The Colonia Council works hard to maintain order, helping local organisations function along cooperative lines. There have been a handful of regional conflicts, but generally you’re less likely to witness trouble out here.”<br>“Having become self-sufficient early on, Colonia’s healthy economy encourages both traders and tourists to make the long journey. The scientific community maintains a notable presence, a notable example is the Holloway Bioscience Institute, which studies the many vacuum-dwelling life forms found in the Colonia Nebula.”<br>“Independent and faction-aligned pilots are catered to, with shipyards and even a fleet carrier construction dock found in the area. Local engineers such as Baltanos, Eleanor Bresa, Rosa Dayette and Yi Shen also offer suit and personal equipment modifications to those who make a living working on low-atmosphere worlds.”<br>“With the Colonia Bridge project well underway, it will soon be easier than ever to cross the interstellar gulf and reach this distant haven. Businesses, settlers and visitors alike may find themselves increasingly drawn to the Colonia experience.”"},{"title":"Thargoid Fleets Invade Nebula Systems","field_galnet_date":"28 OCT 3307","imageList":["NewsImageThargoidIncursion"],"field_galnet_body":"*Pilots Federation ALERT*<br>Several inhabited systems in the Pleiades and Witch Head Nebulas have come under attack by large numbers of Thargoid ships.<br>An emergency has been declared by the authorities in multiple systems including Asterope, Shenve and Onoros. Thargoid vessels have again targeted starports, with casualties estimated in the many thousands.<br>Increased Thargoid activity has also been reported in the California and Coalsack Nebulas. Independent pilots and anti-xeno squadrons are moving to defend the invaded systems and evacuate survivors from damaged starports.<br>Aegis is not currently able to assist, as the operational shutdown enforced by the public inquiry has led to many ships and pilots being withdrawn from service. Admiral Aden Tanner, chief military liaison to Aegis, commented: <br>“Many of us in Aegis are frustrated that the Baumann Report has tied our hands. I am also convinced that these Thargoids are reacting aggressively to the weapon of mass destruction that Salvation deployed in the Cornsar system. Not only should we be fighting the alien threat, but Salvation must be prevented from escalating the war.”<br>The Taurus Mining Ventures megaship Bright Sentinel has moved to the Merope system at Salvation’s request. Reports indicate that tech brokers on board are offering a Guardian-hybrid plasma charger as well as material cost discounts to support the anti-xeno effort."},{"title":"Resources Boost for Torval Mining Ltd","field_galnet_date":"28 OCT 3307","imageList":["NewsImageArrivingShip"],"field_galnet_body":"*Pilots Federation ALERT*<br>Vital materials have been delivered to the EGM 559 system to sustain Senator Zemina Torval’s new corporation.<br>The megaship Pride of Bitterwood received multiple shipments of geological equipment, microbial furnaces and mineral extractors. These will be transferred to Torval Orbital in the LTT 198 system, supplying the starport acting as the primary base of operations for Torval's new venture.<br>Operations director Constantia Torval announced the campaign’s conclusion:<br>“All of us here at Torval Mining Ltd are pleased with the contributions. These supplies will ensure that we meet our first year’s targets and continue providing high-quality services to our customers in the Empire.”<br>Torval Mining Ltd was originally a subsidiary of Mastopolos Mining, but became autonomous following a rift between Zemina Torval and her cousins in the Mastopolos family. The two corporations are now commercial rivals in the Empire’s industrial mining market.<br>The megaships Champion of Commerce and The House Ascendant have recently jumped to the Laguz and 21 Eridani systems, respectively. These vessels represent part of the corporate fleet recently purchased by Torval Mining Ltd."},{"title":"Alliance and Marlinists Address Refugee Crisis","field_galnet_date":"26 OCT 3307","imageList":["NewsImagePressConferenceAlliance","AllianceIconNewsImage"],"field_galnet_body":"The Marlinist Colonies have offered to provide help for political refugees who sought sanctuary in Alliance space.<br>In 3306, the Empire’s security forces began arresting followers of Marlinism, suspecting them of being linked to the NMLA. Many pro-republican Imperial citizens fled to the Federation, but some set course for the Alliance instead.<br>The situation has been highlighted by Prime Consul Kayode Tau of the Marlinist Consulate:<br>“Having made a desperate journey for survival, over a million Marlinists are now dispersed across Alliance territory. Most are clustered in small groups, lacking basic supplies and facing extreme deprivation. Some Alliance systems have offered citizenship, but others are attempting to expel them as illegal immigrants.”<br>“The Empire wishes to repatriate these people, which means harsh interrogation for some and lifelong persecution for others. I hope to negotiate with the Alliance to arrange an alternative – transportation to the Marlinist Colonies. There they will be welcomed into the democratic society established by their brethren.”<br>Ambassador Elijah Beck, head of the Alliance Office of Diplomatic Relations, has agreed to meet with Prime Consul Tau to examine solutions. The Imperial Diplomatic Corps officially refused an invitation to join this discussion."},{"title":"Senators Offer to Protect Hadrian Duval","field_galnet_date":"25 OCT 3307","imageList":["NewsImageImperialCityscape"],"field_galnet_body":"The recent NMLA attack in the Paresa system has encouraged the Imperial Senate to reach out to Imperator Hadrian Duval.<br>An official pronouncement was made by Senator Caspian Leopold:<br>“A majority of us believe that preserving the Duval bloodline is paramount for the future of the Empire. Hadrian Duval is not officially a member of the Imperial Family but he is the grandson of Emperor Hengist, meaning his as-yet unborn child is also of royal lineage.”<br>“The NMLA has already murdered many Duvals, including Prince Harold. Indeed, Hadrian himself barely survived an assassination attempt last year. It’s clear that the Empire can provide greater security than he currently has, and it is our duty to do so.”<br>“Therefore, we propose making both Hadrian and Lady Astrid wards of the Senate. They will be placed under the highest level of protection, at least until this grave threat has abated.”<br>Imperator Hadrian Duval is currently holding discussions with a delegation from the Senate. Political observers believe that their proposal may be conditional on him severing ties with Nova Imperium, an isolationist organisation that was once outlawed in the Empire.<br>Independent newsfeeds have speculated that since the NMLA’s terror campaign began, Emperor Arissa Lavigny-Duval has been under similar senatorial protection and performing her duties from a secure location."},{"title":"Scriveners Clan Resists Orion University","field_galnet_date":"22 OCT 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"The spacefaring tribe that lives aboard an ancient dredger has refused to allow Orion University to take possession of the vessel.<br>Vox Galactica published an eye-witness account by freelance reporter Casey Kilpatrick from the Oochost PC-C c29-0 system:<br>“Once the Scriveners Clan was found, it wasn’t long before Orion University arrived. Their megaship, Scientia Aeterna, remotely disabled the dredger’s hyperdrive using a series of override codes. These had been unearthed from the university’s archives, along with evidence that the ship – commissioned in 3088 as Dredger J-403 – legally belongs to them.”<br>“Despite being unable to escape, the Scriveners have made a stand. All requests to communicate were roundly ignored. I’ve watched several craft try to dock with the dredger, only to be met with sealed airlocks and an electrified hull.”<br>“It’s clear that these people are unwilling to give up their home simply because of centuries-old legislation. But it’s also apparent that Orion University is interested in more than just reclaiming lost property…”<br>“The Scriveners possess something that they refer to as a Knowledge Core, which contains everything that this scholarly society has learned during its long voyage. What discoveries might this database contain? And how far will the university go to get their hands on it?”"},{"title":"Torval Mining Ltd Requests Resources","field_galnet_date":"21 OCT 3307","imageList":["NewsImageArrivingShip"],"field_galnet_body":"*Pilots Federation ALERT*<br>Senator Zemina Torval’s new corporation requires deliveries of commodities to its megaship in the EGM 559 system.<br>Constantia Torval, the senator’s daughter and operations director of the company, provided details of the initiative:<br>“Now that we are a fully independent business, additional resources are urgently needed to continue providing services to the Empire. My goal is to ensure that the Torval name remains synonymous with efficiency and dedication.”<br>“Shipments of geological equipment, microbial furnaces and mineral extractors can be delivered to the megaship Pride of Bitterwood in the EGM 559 system. From there, they will be transferred to our headquarters at Torval Orbital in LTT 198.”<br>The Pride of Bitterwood is part of a corporate fleet recently purchased by Torval Mining Ltd. Most are currently in the LTT 198 system being outfitted for mining and transport operations. Business analysts believe that these megaships were funded by Zemina Torval after selling the majority of her shares in Mastopolos Mining."},{"title":"Federal Agents Crush Jupiter Division Extremists","field_galnet_date":"20 OCT 3307","imageList":["NewsImageFederalCityscape","FederationIconNewsImage"],"field_galnet_body":"A pro-corporatist group planning a series of terror attacks has been shut down by the Federal Intelligence Agency.<br>An update on the operation was delivered by Deputy Director Bethany Blake, who runs the Proactive Detection Bureau:<br>“Special forces have now arrested the organisers of the underground organisation called Jupiter’s Wrath. This was a collection of citizens radicalised by Jupiter Rochester into believing that they could replace democratically elected leaders with corporate overlords.”<br>“This successful operation was only possible thanks to information provided by the PDB. Without this surveillance network, we would be entirely unaware of Jupiter’s Wrath and many leading politicians may have lost their lives.”<br>“Our analysts are now updating the PDB’s algorithms to highlight citizens who are at risk of radicalisation. We will prevent domestic terrorism by identifying those being corrupted by hostile ideologies.”<br>In response, Congressman Bai Zheng was quoted in The Federal Times:<br>“This is an unnerving development in the PDB’s evolution. It’s also what many of us in Congress feared. We are not targeting people who have committed a crime, but people whose personal opinions are unpalatable to the government.”"},{"title":"Jokers’ Deck Hunts the Winking Cat","field_galnet_date":"19 OCT 3307","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"Francesca Wolfe of the Wallglass Investigations Agency has sent a final report from her infiltration of the secretive gambling circle.<br>“The bad news is that Jokers’ Deck security caught up with me as I was trying to sneak onboard a ship to get off-planet. The good news is that they didn’t gun me down, or even threaten to press charges. Instead, they offered me a job!”<br>“Lexi October, the current host, was surprisingly gracious. Turns out she’s a fan of the Galactic Mysteries pieces that Gunnarson and I run, but more importantly, she believes we could give her what she really wants – the Winking Cat.”<br>“She explained that the Joker playing card that was stolen is hugely symbolic to the group, having belonged to its original founder. She also assured me that Jokers’ Deck is extremely private but not criminal. Its members sign legal waivers, and there is a strict honour code to ensure all bets are paid.”<br>“So, Lexi October wants to hire us to track down the infamous Winking Cat thief and retrieve the ceremonial playing card. This may also be a way for her to save face with her fellow super-rich gamblers, who are understandably unhappy about the exposure.”<br>Erik Gunnarson, Wolfe’s detective partner, added:<br>“It’s a huge relief that Wolfe is safe, but what has she got us into now? Will we really be able to catch the Winking Cat? I wouldn’t bet on it.”"},{"title":"Scriveners Clan Dredger Located","field_galnet_date":"18 OCT 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"*Pilots Federation ALERT*<br>The dredger inhabited by the nomadic Scriveners Clan has been found within the Oochost PC-C c29-0 system.<br>Independent pilots conducted a search for the vessel in response to a request from Orion University, which claims that the Dredger-class bulk cruiser is its commercial property.<br>Vice Chancellor Leland Pettigrew announced the operation’s success:<br>“Congratulations to the pilots who managed to locate Dredger J-403. The university will shortly dispatch a megaship to take ownership and arrange repatriation for its current occupants.”<br>The dredger is currently orbiting an ice world in the Oochost PC-C c29-0 system. It is believed to be collecting raw material from planetary rings to sustain its onboard systems, a design feature that allows it to remain self-sufficient indefinitely.<br>There has been no communication with the Scriveners Clan, the spacefaring tribe descended from an academic institute that was later absorbed into Orion University. It is known that they shun contact with all outsiders to protect their Knowledge Core, a repository of research conducted over the past two centuries."},{"title":"NMLA Aims to ‘Extinguish the Duval Line’","field_galnet_date":"15 OCT 3307","imageList":["NewsImageImperialPalace"],"field_galnet_body":"The Neo-Marlinist Liberation Army has taken responsibility for the attack on Dyson City starport in the Paresa system.<br>The primary targets were Imperator Hadrian Duval and his wife Lady Astrid Minerva-Duval, who is pregnant with his child. Although they survived, the bombing left many thousands dead and injured.<br>The following message was sent across NMLA propaganda channels:<br>“As long as a single Duval is left alive, the Republic of Achenar cannot be rebuilt. It is our duty to extinguish that entire line and free our people from Imperial oppression.”<br>Praetor Leo Magnus gave a statement on behalf of ACT:<br>“It is significant that this latest broadcast is not from Theta Seven, the NMLA’s mouthpiece and de facto leader. We believe that Theta Group – the team of weaponsmiths that built the caustic enzyme bombs – has split in two.”<br>“According to the communications we intercepted, Theta Seven and half of his followers went into hiding after the attacks against the Marlinist Colonies in July. The others continued their terror campaign and were responsible for this latest atrocity. ACT is currently pursuing leads and hopes to learn more soon.”<br>Nova Imperium has repeated a call for pilots to help rescue survivors from Dyson City in the Paresa system."},{"title":"Terrorist Attack at Hadrian Duval’s HQ ","field_galnet_date":"14 OCT 3307","imageList":["NewsImageStationDamaged"],"field_galnet_body":"*Pilots Federation ALERT*<br>Explosions have struck Dyson City starport in the Paresa system, home of Hadrian Duval’s organisation Nova Imperium.<br>The starport suffered severe structural damage plus the corrosive effects of caustic enzymes, characteristic of the customised weapons used by the NMLA. Initial reports state that over fifteen thousand people have been killed and a similar number injured.<br>The following statement was issued by Praetor Leo Magnus, the former head of security for Nova Imperium who was seconded to ACT:<br>“Shortly before this attack, my team intercepted a communication between suspected Neo-Marlinist supporters. This referred to an imminent attempt to kill Imperator Hadrian Duval, Lady Astrid Minerva-Duval and their unborn child.”<br>“I immediately ordered the Praetorian Guard to move the Imperator’s family off-station, which was achieved minutes before the bombs detonated. I am pleased to report that they survived this brutal attack, but unfortunately the remaining population could not have been evacuated in time.”<br>A state of emergency has been declared in the Paresa system, with an urgent request for independent pilots to assist with rescuing survivors from Dyson City starport.<br>The Empire confirmed that as per the Treaty of Paresa, it will provide military and medical support to Nova Imperium. ACT is performing investigations to learn more about the attack.<br>"},{"title":"Colonia Bridge Project Receives Deliveries","field_galnet_date":"14 OCT 3307","imageList":["NewsImageStationConstruction"],"field_galnet_body":"*Pilots Federation ALERT*<br>Twin initiatives in the Alcor and Colonia systems have procured materials to construct new dockable megaships.<br>Brewer Corporation made an announcement regarding its Colonia Bridge project:<br>“A positive response has led to generous shipments of ceramic composites, computer components and thermal cooling units being received. As a result, Brewer Corporation can now commence work on enhancing the transportation infrastructure between the core systems and the Colonia region.”<br>“Thanks to the dedication of the galactic community, 30 dockable megaships will be placed along the Colonia Bridge route by the 28th of October. These will serve as stationary ports, providing vital facilities for travellers. Planning is already underway for the second phase of this project, placing further megaships every four to five hundred light years working out from the Alcor and Colonia systems.”<br>“Payment for contributing pilots is now available at Macdonald Settlement in the Alcor system and Jaques Station in the Colonia system. Both starports also offer a temporary discount on purchasing and outfitting to owners of our Drake-class Carriers.”<br>Brewer Corporation will soon be reaching out to the top ten pilots from both the Alcor and Colonia initiatives, to provide naming suggestions for the dockable megaships being placed on the route to Colonia. Submissions will be subject to review by the Brewer Corporation board of directors.<br>"},{"title":"Orion University Searches for Dredger","field_galnet_date":"14 OCT 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"*Pilots Federation ALERT*<br>Rewards are being offered by Orion University to locate the Scriveners Clan dredger, which it claims as its legal property.<br>The self-sustaining Dredger-class bulk cruiser was launched two centuries ago by an academic institute that was later absorbed by the university. Since then the dredger has become the home for a nomadic tribe called the Scriveners Clan, which refuses contact with all outsiders.<br>Vice Chancellor Leland Pettigrew told the media:<br>“Orion University is willing to reward pilots who can pinpoint the dredger’s current location. We believe it is still within 500 light years of the Perseus Dark Region KC-V c2-2 system.”<br>“Pilots who are interested in helping should first dock at Ring Mine station in the 2MASS J03291977+3124572 system, to automatically sign up to the search operation. Our associates at the starport, Deep Space Mining, will provide further information including details of the reward.”<br>"},{"title":"Federal Terrorist Network Exposed","field_galnet_date":"13 OCT 3307","imageList":["NewsImageFederalCityscape","FederationIconNewsImage"],"field_galnet_body":"The Proactive Detection Bureau has been instrumental in identifying violent corporatist extremists within the Federation.<br>Deputy Director Bethany Blake of the Federal Intelligence Agency gave a statement to the media:<br>“In recent weeks, our surveillance algorithms flagged a series of coded communications for investigation. We found that a network of radicalised citizens were discussing plans to assassinate members of Congress and leading political figures.”<br>“This movement, which calls itself Jupiter’s Wrath, is inspired by Jupiter Rochester’s failed attempt to enable corporations to directly rule the Federation. Their goal was to enact revenge on those who they consider to be the ‘enemies of Jupiter Division’.”<br>“Using data intercepted by the Proactive Detection Bureau, FIA agents performed a series of coordinated strikes in several Federal systems. Over a thousand armed extremists were arrested before they could act. We are currently working to identify the remaining Jupiter’s Wrath members.”<br>Vice President Jerome Archer claimed that this was further validation of the Domestic Counter-Terrorism Act, which permitted the PDB to be established. However, Shadow President Felicia Winters commented:<br>“I commend the FIA for performing their duties. But I also question the timing of this operation, coming so soon after President Hudson’s appallingly reckless attempt to capture Yuri Grom. To me it seems calculated to show his administration in a positive light, while ignoring the violation of citizens’ privacy.”"}]