[{"title":"Thargoid War Update: January 3309","field_galnet_date":"20 JAN 3309","imageList":["NewsImage_thargoids2"],"field_galnet_body":"Vox Galactica reporter Jade Sanderlyn has published a summary of the current situation in the conflict against the Thargoids.<br>“Many of us who witnessed those terrifying events in HIP 22460 felt that it was both an ending and a beginning – that history had turned a page. Five months later, the Second Thargoid War has escalated to a point which may yet close the book altogether.”<br>“The arrival of the eight Maelstroms resulted in 44 populated systems being completely overwhelmed by the Thargoids. Dozens of neighbouring regions were also attacked by their fleets, leaving starports and settlements ablaze. Billions were killed and billions more fled from their homes as panicked refugees, creating the greatest humanitarian crisis of all time.”<br>“Despite the lack of coordination previously provided by Aegis and Salvation, anti-xeno efforts have been herculean. Allied, Federal and Imperial warships rapidly responded to form a vanguard against the invaders, and thousands of independent pilots have valiantly fought the Thargoid swarms across multiple battlefields.”<br>“Military experts believe that neutralising the Maelstroms will stem the endless waves of Thargoid vessels. Unfortunately, their caustic clouds and repulsing energy waves prevent our ships from exploring whatever resides within. They also generate the same disruptive field found in HIP 22460, which prevents any Guardian-based weapons from functioning within the system.”<br>“But there is hope. A small but steady flow of unclassified relics, those strange artefacts recovered from Thargoid surface sites after the Proteus Wave fired, have made their way to Professor Ishmael Palin and Ram Tah. A leading theory is that they share esoteric properties with several of the Thargoids’ recent technological advances, and may hold the key to developing countermeasures. Many other scientists are focusing on xenological research, striving to locate a weakness or develop an advantage.”<br>“Until such a breakthrough occurs, we are reliant upon our spacefaring warriors to contain the most destructive adversary the human race has ever faced. This is Jade Sanderlyn for Vox Galactica. Stay safe out there.”"},{"title":"Experimental Weapon Stabiliser Initiative Begins","field_galnet_date":"19 JAN 3309","imageList":["NewsImage_fleetcarriers4"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Azimuth Biotech has requested deliveries to LHS 1163 to manufacture a module that increases AX weapons capacity. <br>A press release from the corporation’s PR division stated:<br>“Azimuth’s dedication to defeating the Thargoids, which stretches back more than a century, has reached a new milestone with the development of our experimental weapon stabiliser.”<br>“This proprietary invention redistributes the physical stresses that AX weapons place upon a ship’s infrastructure. The class 3 and class 5 variants allow ships to be outfitted with one or two additional AX weapons respectively.”<br>“Supplies of meta-alloys, insulating membranes, HN shock mounts and beryllium are required to begin mass production of our successful prototypes. All shipments should be delivered to the Glorious Prospect megaship in the LHS 1163 system. Sufficient resources will allow the class 3 variant of the experimental weapon stabiliser to become available immediately, with the class 5 variant reaching the market a short time later.”<br>The opportunity to increase hardpoint capacity for anti-xeno combat ships has been broadly welcomed. But critics have noted that Azimuth Biotech stands to commercially benefit from this contribution  to the conflict, which many believe was triggered by its Proteus Wave operation in the HIP 22460 system.<br>A spokesperson for Operation Wych Hunt, an independent community established to oppose Azimuth Biotech, offered this statement:<br>\"The proposed modules will benefit humanity in the fight against the ongoing Thargoid threat and we support anybody who takes advantage of them. But this does not absolve Azimuth Biotech of the terrible acts that they committed under the leadership of Caleb Wycherley. The company still must be held accountable for the many atrocities it has committed, including the inhumane experiments of Project Seraph and the vile murder of thousands onboard the Alexandria.\""},{"title":"Princess Aisling Echoes Aegis Reformation Calls","field_galnet_date":"16 JAN 3309","imageList":["NewsImageImperialCityscape"],"field_galnet_body":"Princess Aisling Duval has publicly asked Emperor Arissa Lavigny-Duval to reconsider pledging Imperial resources to a cross-superpower anti-xeno initiative.<br>Her message was shared on all Imperial newsfeeds:<br>“The Empire’s capability to defend itself is not in question. But neither is there any doubt that we are facing a protracted war. The ferocity and scale of the Thargoid onslaught on human space is unprecedented. Of course the Empire will survive, as it has for over a millennium… but at what cost? How many systems must fall? How many citizens will grieve for lost loved ones?”<br>“Emperor Arissa, I implore you: work with the Alliance and Federation to reform Aegis. Our combined resources are needed to develop new technologies to overcome the alien armadas. Corporate interests must not dictate this path. Let Imperial ingenuity and courage light the way to victory over a common enemy.”<br>A handful of senators supported Princess Aisling’s plea initially, though others have criticised her for daring to challenge the Emperor’s decree. As yet there has been no response from the Imperial Palace.<br>Gudrun Vestergaard , royal correspondent for The Imperial Herald, commented:<br>“There is speculation that this may cause friction between Aisling and her cousin Hadrian Duval, whose long-held isolationist beliefs are now aligned with Imperial policy. Until now both have enjoyed a close relationship, with Aisling even being chosen as honour-mother to Hadrian’s baby son Hector. But their views on Imperial foreign policy could not be more different, and recent events have brought this into sharp focus.”"},{"title":"Azimuth Announces Experimental Weapons Stabiliser","field_galnet_date":"12 JAN 3309","imageList":["NewsImage_megaship2"],"field_galnet_body":"Azimuth Biotech has revealed prototypes of a module which improves hardpoint capacity for AX ships at the TZ Arietis Weapon Expo.<br>The event showcased a range of military products to entice governments, corporations and private groups into contracts with arms suppliers. But the current demand for anti-xeno weaponry meant that Azimuth Biotech’s announcement gained the greatest media attention.<br>CEO Torben Rademaker delivered a presentation on the expo’s main stage:<br>“Azimuth’s experimental weapons stabiliser is designed to redistribute the physical stresses that experimental modules place upon a ship’s structural integrity. Its unique technology will allow ships to utilise AX weapons above the current limit of four, expanding a pilots’ options when engaging Thargoid vessels.”<br>“The medium variant of our stabiliser allows one additional experimental weapon to be installed, while the large variant can facilitate two additional experimental weapons. Both stabilisers support the enhanced AX missile racks and multi-cannons that recently became available.”<br>“While I have your attention, I’d like to add that Azimuth utterly condemns the recent pardon of the war criminal Aden Tanner. It is shocking that Aegis’s unprovoked attack against our headquarters at Hind Mine could be glossed over so easily. We have informed the Federation that Azimuth has no intention of relinquishing our ownership of the Musashi, the megaship commanded by Tanner during his failed attempt to steal company assets.”<br>During the weapons expo, Azimuth Biotech made successful deals to commercially manufacture its experimental weapons stabilisers. An initiative is being planned to acquire the raw materials needed to establish mass production."},{"title":"Admiral Tanner Receives Presidential Pardon","field_galnet_date":"09 JAN 3309","imageList":["NewsImageFederalCityscape"],"field_galnet_body":"The court martial verdict of Admiral Aden Tanner has been officially overturned by an executive order from President Zachary Hudson.<br>In November 3307, Tanner attempted to take control of Hind Mine starport while in command of the Musashi megaship. He claimed that databanks at the headquarters of Taurus Mining Ventures – as Azimuth Biotech was then known – contained evidence that Salvation’s anti-xeno superweapons were designed to attract the Thargoids into populated systems before they were deployed. <br>A legal review last September, after the Proteus Wave was used to entice Thargoids to HIP 22460, substantiated Tanner’s claims. His sentence was commuted to time served, but his dishonourable discharge was upheld. This granting of clemency by President Hudson quashes the convictions of mutiny and unlawful military action.<br>The Office of the Federal President published the following:<br>“Aden Tanner has an impressive and honourable record of service to the Federation, including a key role as chief military liaison to Aegis. His brief violation of protocol has since been accepted as based on sound intelligence. President Hudson therefore believes that Tanner’s in-depth experience in combating Thargoid forces is too valuable to disregard, considering the current situation.”<br>A brief statement was also made by Fleet Admiral Tayo Maikori:<br>“I fully support this presidential pardon, which is in the best interests of all citizens. Admiral Tanner has been formally reinstated and is already being briefed on strategic plans regarding the Thargoids.”<br>“I’d like to stress that I believe the Federal Navy Criminal Court’s original verdict was just and fair, given all available information at the time. This executive action does not undermine the court’s crucial role in maintaining order among enlisted personnel.”"},{"title":"Subject D-2 Departs on Lone Mission","field_galnet_date":"05 JAN 3309","imageList":["NewsImageArrivingShip"],"field_galnet_body":"Mystery surrounds the unexpected disappearance of Seo Jin-ae, who has reportedly departed the facility she’d been staying at.<br>Professor Alba Tesreau provided a statement to the media:<br>“Seo Jin-ae’s mental and physical health have improved over the past three months, with the discomfort caused by her cortical implant significantly reduced. This afternoon, I learned that she failed to attend a routine therapy appointment, and was soon found to have left the facility altogether. Somehow Seo managed to depart without logging her ID at the primary entry point.”<br>“Initially I feared that she had been abducted by Azimuth operatives, sent by the company which subjected her to horrific neurosurgical procedures. But I soon received a time-delayed communiqué from Seo explaining her departure was voluntary. She offered heartfelt thanks to me and other former Aegis members for our help, but declared: ‘I have unfinished business with Salvation.’”<br>“I don’t know what this refers to, since Salvation died in HIP 22460. Seo is a headstrong and determined individual who clearly prefers operating alone. I believe she should not be travelling without protection, though. Her ability to interpret the Thargoids’ actions could make her a target for those who mean her harm. I urge anyone who encounters her to alert local authorities.”<br>Azimuth Biotech offered a response from Director Nassim Qadir , head of the corporation’s medical research division:<br>“This erratic activity from Ms Seo displays typical characteristics of delusion and paranoid obsession with Salvation, whose death has been confirmed by eyewitness reports. We must question what type of ‘medical help’ she has been subjected to, if it forced her to abscond in this fashion. She would receive far more effective therapeutic care at our facilities.”"},{"title":"A Retrospective of 3308 (Part Three)","field_galnet_date":"02 JAN 3309","imageList":["CommunityNewsFeed_17"],"field_galnet_body":"The concluding article in a series by historian Sima Kalhana, providing an overview of last year’s key events.<br>“The aftermath of the Battle of HIP 22460 was an unsettling time. With Salvation dead, Azimuth Biotech fell under new management and struggled to maintain prominence. The Empire withdrew from further collaborations with the other superpowers. And despite widespread fears of Thargoid reprisals, a xeno-peace movement sought diplomacy with the aliens to prevent further conflict.”<br>“September brought further mysteries with sightings of eight swirling anomalies in deep space, detectable by ship scanners within a certain range. Initially assumed to be stellar phenomena, these rogue signal sources were later discovered to be travelling faster than light.”<br>“Professor Alba Tesreau continued to call for Aegis to be reinstated, and held a symposium in October to outline her plans. This was gatecrashed by a woman named Seo Jin-ae, formerly Subject D-2 in Azimuth’s notorious Project Seraph experiments. Her neural link to a Thargoid vessel provided a degree of insight into the aliens’ behaviour. With Tesreau’s help, she later claimed the rogue signal sources were of Thargoid origin, summoned in response to events in HIP 22460.”<br>“The Far God cult was overjoyed by the Thargoids’ recent victory, but its radical True Chapters sect was accused of sharing classified media from HIP 22460 which included the ‘Thargoid roar’. The Federation outlawed the religion, forcing the True Chapters megaships to flee.”<br>“By November, it was confirmed that all eight rogue signal sources were approaching the core systems. Congressman Dalton Chase arranged for the xeno-peace movement to outfit the Kingfisher megaship, which was sent to meet and communicate with one of the so-called ‘stargoids’. It was swiftly destroyed, establishing a grim prelude for the bloodshed to follow.”<br>“Taranis, the first of the anomalies, arrived in Hyades Sector FB-N b7-6 on 29th November, manifesting as a colossal gas cloud. This Maelstrom immediately unleashed vast numbers of Thargoid vessels into neighbouring systems, ferociously attacking all orbital and planet-based habitats.”<br>“The remaining seven Maelstroms arrived during December, empowering the Thargoids to invade and conquer systems. Superpower militaries, anti-xeno squadrons and independent pilots rushed to their defence, but were clearly unprepared for an onslaught of such magnitude.”<br>“By the end of 3308, Thargoid forces were raging across the core systems, causing millions of casualties and displacing millions more from their homes. The cataclysmic events of the past year have cast a chilling shadow over the future, with only one certainty: that 3309 will be dominated by the Second Thargoid War.”"},{"title":"Azimuth Conducts AX Weapons Research","field_galnet_date":"03 JAN 3309","imageList":["NewsImage_settlements3"],"field_galnet_body":"The corporation Azimuth Biotech has outlined its plans to support the war effort against the Thargoids by improving ship anti-xeno firepower.<br>CEO Torben Rademaker was interviewed on The Tau Ceti Journal’s official ICE-cast, where he explained:<br>“As you may recall, one of the many reasons Aegis became redundant was its poor record in improving AX armaments past the initial rush of designs. Azimuth Biotech has established a research and development division specifically designed to correct their failings at a steady, sustainable pace.”<br>“One of the inherent limitations with Aegis’s designs is the maximum number of AX weapons that a ship can be outfitted with. The enhanced versions based on Ryder and Nemo’s designs share this limitation. We seek to increase the upper limit of AX weapons a ship can utilise, and our research teams are already reporting promising results.”<br>One of the ICE-cast’s interactive audience questions asked why Azimuth was not working with Proteus Wave technology to build more anti-xeno superweapons. Rademaker replied:<br>“Under my guidance, the corporation has moved away from Salvation’s esoteric field of research and adopted a more conventional direction. It seems clear to me that the superweapon project led by my predecessor was, ultimately, a failure.”<br>Rademaker also answered an accusation that Azimuth was responsible for the loss of life in HIP 22460, and that he should face trial for ‘causing the Thargoid Maelstroms’:<br>“Sadly, I often come across such simplistic blame-seeking from those with limited comprehension of the issue. The plain fact is that nobody could have predicted the Thargoids’ excessive reaction to our activities in HIP 22460. The Proteus Wave was deemed an acceptable means of ending the war, approved by individuals with far more military experience than Salvation could claim.”<br>Rademaker’s only response to a subsequent barrage of abuse from a member of Operation Wych-Hunt was less verbose. The interview feed was terminated."},{"title":"A Retrospective of 3308 (Part Two)","field_galnet_date":"30 DEC 3308","imageList":["CommunityNewsFeed_6"],"field_galnet_body":"Sima Kalhana continues her review of the most significant historical events that occurred during the past year.<br>“In May 3308, the Thargoid invasions of the Didio, Novas and Sosong systems were completely repelled by the use of Salvation’s unique superweapons. This convinced the Alliance, Empire and Federation to support Azimuth Biotech in developing this Guardian-based technology, with Salvation claiming that he could end the Thargoid threat forever.”<br>“Elsewhere that month, the Kumo Crew syndicate faced civil war as pirate rebels tried to replace Archon Delaine. Eventually his loyal forces triumphed, with the Blue Viper Club dredger clan fleeing his reprisals. And in the Federation, trillionaire entrepreneur Zachary Rackham announced his presidential candidacy for the 3309 election.”<br>“June saw the Golconda generation ship repaired and updated by the Artificers Clan. This provided the majority of its original inhabitants, descended from Earth colonists, the opportunity to resume their spacefaring lifestyle.”<br>“The news around this time was dominated by Salvation, particularly when he rebranded Taurus Mining Ventures as Azimuth Biotech. The scientist, once named Dr Caleb Wycherley, admitted that the corporation had evolved out of the notorious Azimuth Biochemicals. But Allied, Federal and Imperial leaders chose to ignore this, having pinned their anti-xeno strategy on Salvation’s superweapon technology.”<br>“HIP 22460 was the system chosen to construct the Proteus Wave. This interfaced Guardian technology with a Thargoid ground settlement, and was designed to deliberately attract the Thargoids before wiping them out. During July and August, upgraded capital ships along with independent pilots defended Azimuth Biotech’s operation from swarms of Thargoid vessels.”<br>“After weeks of intense combat and delivering vital supplies, the Proteus Wave was activated on 9th August. Initially it seemed successful, rendering the Thargoids powerless, but an unexpected second energy pulse from the planetary site had the same effect on all human ships. The resulting massacre saw the Thargoids take control of the HIP 22460 system, establishing a permanent presence.”<br>“Salvation was dead. Azimuth Biotech’s plans had failed. The superpowers were in retreat. And speculation grew about an unearthly alien screech heard in HIP 22460, dubbed the ‘Thargoid roar’.”"},{"title":"Enhanced AX Weapon Update","field_galnet_date":"29 DEC 3308","imageList":["CommunityNewsFeed_22"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The continued project to provide enhanced AX weaponry for all ships has announced its latest progress update.<br>All enhanced AX weapons designed by the engineers Liz Ryder and Zacariah Nemo have now been completed. It is hoped that with these weapons improvements, humanity will be better positioned to defend itself against Thargoid invasion fleets.<br>The following weapons are now available for purchase:<br>Enhanced AX Multi-cannon (Gimballed)<br>Enhanced AX Missile Rack (Fixed)<br>These modules are offered at all rescue megaships, which can be found using the Galaxy Map filter. Ships looking to engage Thargoid forces are advised to equip these weapons, particularly in Maelstrom systems where Guardian-based technology has proven ineffective."},{"title":"The Time for Aegis?","field_galnet_date":"27 DEC 3308","imageList":["NewsImageFuturisticCityscape"],"field_galnet_body":"Professor Alba Tesreau has again called for the anti-xeno initiative Aegis to be reformed by the superpowers.<br>“The arrival of the Maelstroms has escalated the Second Thargoid War beyond anything we have experienced before. The Thargoids are relentlessly attacking every human settlement within reach. And that reach is steadily expanding on eight fronts, spreading deeper into the core systems.”<br>“In these dire circumstances, the decision to shut down Aegis seems to be a grave mistake. Now, more than ever, superpower-level resources are needed to establish large-scale research and defence projects. This is the surely the time for Aegis to be revived with as much funding and resources as possible.”<br>“My symposium in October proved that there is an increasing appetite for collaboration. Many Allied and Federal military leaders have already discussed working together. Shadow President Winters recently suggested helping those beyond Federal borders, and Deputy Prime Minister Corcoran has championed the prospect of coalition in the Alliance.”<br>“Sadly, the Empire’s current isolationist policy means that Aegis would necessitate a return as a dual-superpower initiative. But even that would be an improvement on the fractured, uncoordinated response to the Thargoid conquests.”<br>There has been no official response to Professor Tesreau from the Alliance or Federation, but several individual congressmen and council members have repeated their support for the reformation of Aegis. <br>In the Empire, only the Citizens’ Chronicle newsfeed reported on Tesreau’s ongoing campaign, commenting: “Even among the Imperial nobility, few dare to question the Emperor’s decree. But those few are growing bolder.”"},{"title":"Winters: ‘Federation Must Protect Independents’","field_galnet_date":"26 DEC 3308","imageList":["CommunityNewsFeed_2"],"field_galnet_body":"Shadow President Felicia Winters has called for the Federal Navy to help defend independent systems being invaded by the Thargoids.<br>She outlined her viewpoint during an interview with the Federal Free Press:<br>“The Thargoid fleets emerging from the Maelstroms have inflicted anguish and loss on millions. Our military forces have responded magnificently, and continue to fight hard against appalling odds. But while they are saving lives in Federal-aligned systems, independent systems are left to suffer.”<br>“Surely this cannot be right? These are our neighbours, our trading partners, our historic cousins. Their populations cry out for help, and the mighty Federal Navy chooses to ignore them, claiming orders to prioritise saving our own. Is that who we are now? No better than the Empire?”<br>“I have argued in Congress that we have a duty of responsibility to protect any independent systems lacking the ability to defend themselves from Thargoid attacks. The Federal Navy’s resources are finite, I understand that. But we are fighting to determine the future of the human race. We lack proof that the Thargoids have any concept of our politics, borders or allegiances. Why would they care which systems claim allegiance to whom? Every one of us is a target.”<br>“And for those whose hearts are hardened to the suffering of others, think on this: the threat is moving closer each day. Leaving non-Federal factions to fend for themselves – and most likely become conquered – will only hasten the Thargoids’ advance. Before long, nowhere within the Federation will be safe. We will all pay the price for such callousness.”"},{"title":"The Voice of the Empire","field_galnet_date":"20 DEC 3308","imageList":["NewsImageImperialPalace"],"field_galnet_body":"On the Empire’s homeworld Capitol, fears over imminent Thargoid invasion sparked a public gathering outside the Imperial Palace.<br>Cassia Carvalho, political journalist for The Imperial Herald, reported from the scene:<br>“The arrival of the Thargoid Maelstroms has triggered protests on many Allied, Federal and independent worlds. The Empire is rarely troubled by such disruption, so the spontaneous march by tens of thousands of citizens through Capitol’s streets caught the media and security services by surprise.”<br>“Chancellor Anders Blaine addressed the crowd, his image projected above us all. He spoke of the Imperial Navy’s swift response to the Thargoid threat, making assurances that our systems were protected and we were all safe.”<br>“But this wasn’t enough to quell the increasingly strident demands that more should be done. I saw anger, frustration and fear etched into those shouting faces. The newsfeed images of burning and broken starports, of Thargoid vessels laying waste to ordinary people’s homes, were all too clear in everyone’s minds.”<br>“I genuinely wasn’t sure which way this impromptu demonstration would go. Might the crowd’s strong emotions even transmute into violence? And then a new voice rang out across the square: the unmistakable tones of Emperor Arissa Lavigny-Duval herself, standing tall as she slowly descended the palace steps toward us.”<br>“‘Remember this: we are Imperials,’ she told her people, her commanding voice amplified for all to hear. The crowd parted in silence as she neared, allowing her to stride amongst us. ‘We possess the strongest civilisation, the grandest achievements, and the most courageous hearts. We shall meet anything that dares to threaten us, human or alien, and we will defeat it. Our Empire will endure!”<br>“By the end of her address, which lasted some ten minutes, emotions had indeed been transmuted – into exultant, cheering jubilation. Our Emperor had stood with us in person, reminded us all of our heritage and our duty. The Thargoids will undoubtedly come. But in that moment we were determined to face them together.”"},{"title":"The Supercruise Factor","field_galnet_date":"19 DEC 3308","imageList":["NewsImage_ax_conflict2"],"field_galnet_body":"Thargoid vessels are interdicting human ships travelling through systems that have been occupied by their fleets.<br>The Thargoids’ ability to force craft to drop out of hyperspace is well documented. Over the past couple of weeks, pilots have reported that the interdiction ability used by human ships in supercruise is also being utilised by the alien forces.<br>Colonel Bris Dekker, an engineer who specialises in frame shift drive technology, submitted his analysis to The Federal Times:<br>“Being intercepted by the Thargoids mid-way through an interstellar journey is certainly a disturbing experience, but not necessarily a fatal one. Many ships have survived such encounters, unless they happen to be carrying Guardian or Thargoid artefacts. By contrast, these more recent incidents are uniformly acts of aggression, with ships being wrenched out of supercruise and immediately fired upon.”<br>“We don’t know precisely how the Thargoids achieve this, though some theories are gathering support. But the intention is clear: to make the hunting of humans vessels easier. Anti-xeno pilots should note that they can no longer escape the Thargoid blasting though their shields by simply entering supercruise.”<br>“Possibly, this is more of a shift in tactics than a new technological development. All reported interdictions have taken place in recently invaded systems close to the Maelstroms, rather than in the aliens’ more well-known haunts. Whatever the reason, the invading Thargoid force has adapted to more efficiently catch its prey.”"},{"title":"Final Maelstroms Advance Thargoid Occupation","field_galnet_date":"16 DEC 3308","imageList":["NewsImage_thargoids2"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>A further 13 systems have fallen under Thargoid control as the last of the Maelstroms materialise.<br>The three rogue signal sources – designated Thor, Raijin and Hadad – entered human-occupied space yesterday. As with the previous five anomalies, they manifested as colossal clouds of corrosive gas over 100 kilometres in diameter. <br>Pilots who attempt to investigate the Maelstroms have been warned that the highly caustic nature of the clouds can disable and destroy ships. Xenologists have speculated that the cloud is a defensive asset, maintained by the huge numbers of caustic generators clustered within.<br>All eight Maelstroms are now established at their destinations, positioned in a broad semi-circle along the fringe of the core systems. Each of these entities has become the centre of an expanding Thargoid sphere of influence. Populated systems in the surrounding regions have been dominated by extremely hostile Thargoid vessels, causing enormous casualties and catastrophic damage. Many more inhabited systems are at risk of invasion. <br>Eleven rescue megaships have entered service at key locations to aid and process the millions of refugees fleeing these attacks. These ships also act as hubs for defence operations to support those systems struggling to resist the Thargoid fleets.<br>The Alliance, Empire and Federation have deployed capital ships equipped with anti-xeno weaponry to defend their respective territories. As yet there appears to be no technology or strategy capable of engaging the ominous power of the Maelstroms directly."},{"title":"Enhanced AX Weapon Project","field_galnet_date":"15 DEC 3308","imageList":["CommunityNewsFeed_22"],"field_galnet_body":"<p>Pilots’ Federation ALERT The continued project to provide enhanced AX weaponry for all ships has announced its latest progress update. Independent pilots have been tasked with establishing a manufacturing base at select locations in the core systems. Thanks to these focused efforts, the following weapons are now available for purchase: Enhanced AX Multi-cannon (Turreted) Enhanced AX Missile Rack (Turreted) Enhanced AX Multi-cannon (Fixed) These modules are offered at all rescue megaships, which can be found using the Galaxy Map filter. Ships looking to engage Thargoid forces are advised to equip these weapons, particularly in Maelstrom systems where Guardian-based technology has proven ineffective. Work continues on the other enhanced weapons, based on designs by the engineers Liz Ryder and Zacariah Nemo which improve the original Aegis models. A further update will be provided next Thursday, unless no additional modules have been established during the week.</p><br>"},{"title":"Corrs Toy Emporium Calls for Help","field_galnet_date":"15 DEC 3308","imageList":["NewsImageOutpost"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Sandra Corrs, CEO of the largest manufacturer of children’s toys in the core systems, has requested help this holiday season.<br>Many parents will be familiar with Sandra’s Workshop, recognising the company logo stamped across countless datapads, interactive suites and tactile play sets designed for youngsters. But the joy of this year’s festive season is at risk, with the recent Thargoid invasion impacting the Workshop’s distribution chain.<br>In an interview with Vox Galactica, Corrs explained:<br>“We typically use a fleet of transports provided by our partner company, Dolph’s Routes, to deliver presents to good children all across the bubble. But those transports have been assigned to provide evacuation support to 63 Tauri. Entirely understandable, and I applaud the company for its brave work. But it does leave many presents without a sleigh, as my grandfather used to say!”<br>“I’m hoping that independent pilots will fill the vacancy left to deliver festive gifts to the children in time for the upcoming holidays. Arrangements will be made to provide a variety of wonderful rewards for those pilots who help keep youthful spirits high in these troubling times.”<br>Pilots willing to help Sandra’s Workshop can collect festive gifts from the Frost Dock outpost in the Njambalba system. A beacon outside Frost Dock will distribute delivery information when scanned."},{"title":"The Darkest Days","field_galnet_date":"13 DEC 3308","imageList":["CommunityNewsFeed_17"],"field_galnet_body":"Newsfeeds have published their reactions as the Thargoid Maelstroms launch fleets to overpower multiple inhabited systems.<br>Sol Today: “Be in no doubt: we are in a war for survival! Dark days are upon us. No more ridiculous ideas of peace with the aliens. No more time for politics or debate. The Thargoids have come to wipe us out unless we stand up and fight.”<br>Old Worlds Gazette: “This is the most severe Thargoid attack ever recorded. Hundreds of thousands slaughtered. Millions more fleeing their homes. Stations and planetary ports bombarded, entire star systems conquered… all in a few days. Many fear that nowhere will be safe if these savage onslaughts cannot be halted.”<br>Citizens' Chronicle: “The speed with which our navy responded to defend Imperial citizens against the Thargoids must be applauded. However, it is becoming harder to ignore the screams from less fortunate systems. Might their cries melt our Emperor’s heart enough for her to consider extending the Empire’s protective wings?”<br>The Empirical: “The hazardous nature of the Maelstroms has challenged all efforts at scientific examination. In terms of scale and composition they resemble small nebulae yet are surely artificial. Their highly corrosive clouds share chemical signatures with known Thargoid technology, but prevent all scans from identifying what generates them.”<br>The Sovereign: “The Kingfisher tragedy has been eclipsed by the current conflicts, but one detail we felt worthy of note was the discovery of Thargoid Sensors among the megaship’s wreckage. The leading theory is that one of the volunteer crewmembers smuggled these aboard, in the hope of attracting the Thargoids’ attention to the megaship’s peaceful communications. This misguided individual was likely unaware that Thargoid vessels can become hostile upon detecting their technology on human ships. One hopes that nothing more sinister was in play.”"},{"title":"Carnage Wrought by Further Maelstroms","field_galnet_date":"08 DEC 3308","imageList":["NewsImage_ax_conflict1"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The rogue signal sources Cocijo and Oya have arrived at their estimated destinations.<br>Their impact mirrored that of the Taranis, Indra and Leigong Maelstroms. A total of 16 neighbouring systems were immediately overwhelmed by Thargoid fleets, which launched devastating bombardments against orbital starports and planetary infrastructure. <br>Other inhabited systems in the vicinity are resisting occupation. Superpower capital ships and independent pilots are currently battling to protect the local populations.<br>Five rogue signal sources have now manifested as Maelstroms, with three more approaching at faster-than-light speed. Many systems have completely fallen to the Thargoids in the vicinity of each Maelstrom. Safeguard Interstellar reported that millions of refugees are threatening to overwhelm emergency services and rescue teams. Military forces are also struggling to contain the enormous numbers of Thargoid vessels.<br>Professor Alba Tesreau is one of many xenologists and other specialists trying to learn more about the mysterious Maelstroms. She gave a brief update to Vox Galactica:<br>“Full-scale war with the Thargoids has always been my greatest fear. It is now a reality. It’s more crucial than ever that we obtain an understanding of this species, particularly these powerful new entities deployed against humanity.”<br>“Seo Jin-ae, who possesses a base comprehension of Thargoid intent via her neural implants, believes these are focused, systematic strikes rather than a frenzied assault. She feels that the Thargoids are working toward a specific goal, but cannot yet identify its nature.”<br>“The one advantage given to us by the arrival of further Maelstroms is the potential that Thargoid forces will be distributed more evenly across systems. With an expanded front line, defensive efforts may gain additional traction when defending or recapturing systems from the aliens.”<br>In related news, Azimuth Biotech’s new anti-xeno megaship has entered service in the T Tauri system. Eternal Vigilance was commissioned following an initiative in November, which was challenged by a counter-campaign aiming to prevent the corporation’s resurgence."},{"title":"Plans for Enhanced AX Weaponry Accelerate","field_galnet_date":"06 DEC 3308","imageList":["NewsImageLoadout"],"field_galnet_body":"Two leading engineers have revealed designs to improve the stock anti-xeno weaponry available to pilots.<br>Liz Ryder and Zacariah Nemo have provided module modifications for many years, specialising in explosive and kinetic weapons respectively. Over the past year they have collaborated privately on the AX weapon designs introduce by Aegis in 3303, seeking to improve the efficiency of delivering a compound, hazardous to Thargoid vessels, which tips AX ammunition.<br>While something of a pet project between the two, the recent invasion of human space by Thargoid forces has made the need for these designs far more urgent. Ryder explained to The Imperial Herald:<br>“Zac and I share a passion for weapon upgrades, and have often used this project as a way to unwind after a long week’s work. He’s a weird guy but fascinating to work with. But when the Taranis signal arrived and the Thargoid forces started taking control of systems, we knew we had to reveal the designs to the public.”<br>“They’re not quite ready to go, though, which is why we’re only announcing the project now. We’re going to need help from independent pilots to finish off the prototypes and get a manufacturing base set up.”<br>The designs would improve the effectiveness of both the fixed and turreted AX multi-cannon and missile rack designs. A gimballed AX multi-cannon is also scheduled, with a campaign to introduce this coming next week.<br>Details about each weapon’s project is available from most mission boards."},{"title":"Chase Admits Kingfisher Mission ‘A Mistake’","field_galnet_date":"06 DEC 3308","imageList":["NewsImagePressConferenceFederal"],"field_galnet_body":"Congressman Dalton Chase has made a public statement regretting his involvement with the Thargoid Advocacy Project.<br>Chase became a member of Congress after an electoral campaign focusing on inter-species diplomatic relations. He was a key organiser and fundraiser for the Kingfisher megaship, which attempted to open communications with the Taranis entity but was subsequently destroyed with no survivors.<br>In a press statement delivered from Olympus Village on Mars, Congressman Chase announced:<br>“The tragic fate that befell the Kingfisher has affected me deeply. I now recognise that sourcing the means for those activists to intercept Taranis was, however well intentioned, a mistake. Such an endeavour should not have been attempted by inexperienced citizens, no matter their courage and tenacity.”<br>“In honour of those brave people, I pledge to focus on proposals to introduce xeno-diplomacy as Federal policy. Rather than civilians needing to risk their lives, we should be bringing such operations to the Federal Navy at a congressional level.”<br>Secretary of State Lana Berkovich has petitioned Congress to launch an investigation into Chase’s involvement with the xeno-peace movement. She described his role in the loss of over 3,000 lives as “beyond reckless”.<br>Although the Thargoid Advocacy Project has faltered following the Kingfisher incident, some of its core members were recently involved in organising anti-authoritarian rallies. According to former spokesperson Timothy Culver: <br>“The superpowers’ involvement in the massacre at HIP 22460, when they supported Salvation’s attempted xenocide, makes them responsible for the Thargoids launching this counterstrike. We need to bring our leaders to account.”"},{"title":"Refugees Flee from Thargoid Offensive","field_galnet_date":"05 DEC 3308","imageList":["NewsImage_fleetcarriers4"],"field_galnet_body":"Millions of people are being evacuated from systems that have suffered devastating attacks by Thargoid fleets.<br>An enormous humanitarian effort is underway, with rescue megaships positioned at key locations near each Thargoid-occupied system. Captain Justine Kemp  of Rescue Ship Hutner, currently stationed in Enayex, described their operations to Vox Galactica:<br>“As per newly established procedures, all contracted transports carrying refugees from systems facing Thargoid invasion are directed to our landing bays. Emergency teams perform triage services and give direct aid where possible. But the focus is on quickly processing them for relocation to temporary housing, away from the warzones.”<br>“This is the most intense situation I’ve ever had to deal with. We’re taking in enormous numbers of people, not just from starports but from planetary settlements too. Virtually everything in some of these systems is ablaze, and the refugees just keep coming.”<br>Vox Galactica also published a selection of soundbites from various civilians escaping from Thargoid-occupied systems:<br>“It all happened so fast. Our family was eating together when the whole port seemed to shake. My son had befriended a trader who’d landed a few days ago, and he convinced her to take us on board her Hauler. The lurches as we weaved through Thargoid ships almost made me bring up the food we’d been enjoying minutes earlier.”<br>“I was at a starport observation window when their ships, those weird star-shaped things, zipped right past. Then the other side of the habitat ring just vanished. Fire and splinters of metal... All the sirens blared, and the crowds surged toward the bays. Heat filled the corridors and smoke clogged our lungs. I didn’t even see the ship I ended up on, only a sea of panicked faces smeared with grime.”<br>“I’m looking for my dad. He was injured when I last saw him. Burns from that green corrosive stuff that punched through our quarters. The Commander didn’t have room on his ship for everyone. I convinced him to take my dad first. But now I can’t find him. The medics don’t have time to talk to me. I hope he’s here somewhere. He’s got to be here somewhere.”"},{"title":"New Maelstroms Increase Thargoid Conquests","field_galnet_date":"01 DEC 3308","imageList":["NewsImageStationDamaged"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Two more rogue signal sources have reached human space, wreaking similar destruction to the Taranis Maelstrom.<br>The Indra anomaly arrived in the HIP 20567 system, with the Leigong anomaly slowing to a halt in HIP 8887. The Maelstroms, as these entities have been classified, both manifested as enormous gaseous clouds. These are known to be extremely hazardous to any ship venturing too close, but the nature of what lies within remains unknown.<br>As with Taranis, each new Maelstrom pre-empted staggering numbers of Thargoid vessels flooding nearby populated systems. Recent reports indicate that the alien fleets have completely dominated 9 systems in proximity to HIP 20567 and none close to HIP 8887. Starports, settlements and outposts have all been devastated or abandoned, with the total number of casualties unknown but feared considerable.<br>A total of 16 systems are currently facing active Thargoid invasions and are transmitting emergency calls for assistance. Rescue megaships have been designated as the gateway destination for refugees. The superpowers have also positioned anti-xeno capital ships to defend Allied, Federal and Imperial territories that have been invaded.<br>Public media channels have expressed grave concerns about the remaining rogue signal sources, which are en route to the core systems. It is expected that these will establish five more Maelstroms, each generating a new wave of Thargoid forces. With the combined death toll rapidly climbing, civil and military authorities alike are scrambling to implement a suitable response."},{"title":"Havoc as Thargoids Overrun Multiple Systems","field_galnet_date":"30 NOV 3308","imageList":["NewsImage_thargoids1"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Nine systems have called for help against massive Thargoid attacks intent on wiping out civilian populations.<br>Ernesto Rios, field correspondent for Vox Galactica, reported:<br>“The arrival of what military scientists have labelled the ‘Taranis Maelstrom’ has brought terror and carnage to millions. As soon as the rogue signal source arrived, local inhabited systems became flooded with enormous numbers of Thargoid vessels. Six populated systems close to Hyades Sector FB-N b7-6 were rapidly overwhelmed, while another nine systems in the region are currently facing full-scale invasions.”<br>“I’ve travelled between several of these systems, and seen for myself the horrific loss of life. Starports are ablaze and covered with corrosive enzymes. Planetary infrastructure is crumbling under the Thargoids’ tremendous firepower. Passing ships are being wrenched out of hyperspace. These attacks seem more merciless than ever before, as if the aliens are determined to eliminate every human population structure they detect.”<br>“Rescue megaships have been established at a safe distance from the invasion’s current front line, facilitating mass evacuation of civilians. These vessels will also stock anti-xeno weaponry for independent pilots seeking to assist the defence efforts or protect themselves while transporting refugees.”<br>“Both President Hudson and Prime Minister Mahon have declared a major emergency, ordering Federal and Allied capital ships to engage the Thargoids. Senator Patreus has dispatched an Imperial Navy force to the Modigi system to defend its territory from Thargoid attack.”<br>“The Taranis Maelstrom itself is the target of intense study, although patrolling Thargoids in the Hyades Sector FB-N b7-6 system make scientific analysis hazardous. Professor Palin and Ram Tah have both warned that this enormous entity appears to have a protective ‘cloud’ of unknown composition, which is proving dangerous to ships that approach it.”<br>“With the other seven rogue signal sources racing toward the core systems, militaries and security forces are preparing for the worst. Will the other seven rogue signal sources bring similar terror? And is humanity capable of withstanding an onslaught of this magnitude?”"},{"title":"Taranis Unleashes Thargoid Invasion Fleets","field_galnet_date":"29 NOV 3308","imageList":["NewsImage_ax_conflict3"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Taranis anomaly has arrived in Hyades Sector FB-N b7-6, triggering a ferocious wave of Thargoid attacks in the region.<br>Multiple inhabited systems are experiencing wide-scale invasions by countless numbers of Thargoid vessels, with casualties expected to number millions in the coming days. Several systems have already reported a complete loss of human control, with ports abandoned amid heavy losses. <br>The Alliance Defence Force and Federal Navy have responded by sending capital ships, which will support independent pilots and anti-xeno squadrons. Neither superpower has entered the Hyades Sector FB-N b7-6 system, from which the Thargoid fleets seem to be emanating.<br>There have been conflicting descriptions of the rogue signal source itself, which finally slowed to a halt after weeks of faster-than-light travel. Dr Remy Leroux, a xenologist working for Professor Palin, transmitted a garbled report describing Taranis as “not a single object but a colossal swirling maelstrom of some kind”, before all contact was lost.<br>These initial reports have not been verified, and many authorities consider them to be unreliable or exaggerated. However, warnings have been issued that the Hyades Sector FB-N b7-6 system is extremely dangerous and should be avoided at all costs.<br>Speaking to The Alliance Tribune, Admiral Rachel Ziegler remarked: “Our focus at present is on defending the populated systems from swarms of highly aggressive Thargoids. Whatever this ‘maelstrom’ actually is, it’s clearly been sent with the purpose of eradicating human influence in the region.”"},{"title":"Vista Genomics Boosts Biodata Payouts","field_galnet_date":"29 NOV 3308","imageList":["NewsImage_on_foot2"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The exobiology company Vista Genomics has increased payments for genetic data collected by independent pilots.<br>Dr Klaus-Peter Sonnek , one of the corporation’s research directors, outlined the changes in a press release:<br>“Public and corporate interest in xenology-related fields remains high, but recent Thargoid aggression has increased the risk in collecting of such data. Vista Genomics is well-placed to incentivise the continued collection of samples. Therefore, we can officially confirm that substantially improved financial rewards will be offered for all genetic data submitted via our outlets.”<br>“We are also aware of many civil and military projects focusing on the Thargoids, a species that makes extensive use of biomechanical technology. There is enormous value in gathering as much exobiology data as possible to provide comparative baselines for anti-xeno research efforts.”<br>Commanders can use the Genetic Sampler tool to acquire genetic data from various species of alien flora found on planetary surfaces. This can be sold on the concourses of ports, megaships and fleet carriers which have an active Vista Genomics vendor.<br>In other news, Sirius Corporation has announced that its popular modified heatsinks and anti-xeno missile rack have been made available to pilots via its company tech brokers. Active Sirius Corporation megaships – Chariot of Rhea, El Centinela Cadejo, Kumiho Sky, Spirit of Laelaps and The Witness Odysseus – now host Sirius tech brokers on board."},{"title":"Militaries on Alert as Taranis Approaches","field_galnet_date":"28 NOV 3308","imageList":["NewsImageFederationFleet"],"field_galnet_body":"The Hyades Sector FB-N b7-6 system has been identified as the location where the rogue signal source named Taranis will finally arrive.<br>Professor Ishmael Palin gave a statement to confirm the findings of several scientific groups:<br>“Data correlated from many long-range scans proves that the anomaly’s velocity is reducing steadily. At its present rate of descent, Taranis will arrive at Hyades Sector FB-N b7-6 in approximately 24 hours. I have sent a research team, led by my colleague Dr Leroux, to gather data on its arrival.”<br>Admiral Maxton Price of the Federal Navy commented:<br>“Fortunately, this particular system is uninhabited so no populations are directly at risk. We are monitoring the situation rather than deploying capital ships. Civilian traffic is ordered not to enter Hyades Sector FB-N b7-6 until we know more about Taranis’s capabilities.”<br>The Alliance Defence Force issued a similar announcement from Admiral Rachel Ziegler:<br>“The Thargoids’ overall strategy remains unknown, as does the true nature of these rogue signal sources. But there is certainly no reason to place ourselves in their path intentionally. It’s possible that, as with HIP 22460, the Hyades Sector FB-N b7-6 system could become a no-go zone occupied by an overwhelming number of Thargoid vessels.”<br>Despite making no official statement, it is believed that the Imperial Navy is likewise holding back from deploying a military fleet to the Taranis anomaly. Independent analysts have suggested that the destruction of the Kingfisher megaship in Hyades Sector YO-Q b5-1 has contributed to the superpowers’ caution, with capital ship losses in HIP 22460 also fresh in the memory. "},{"title":"Xeno-Peace Supporters Killed by Thargoids","field_galnet_date":"25 NOV 3308","imageList":["NewsImageDeathFederal"],"field_galnet_body":"Investigations in the Hyades Sector YO-Q b5-1 system have confirmed that Thargoid vessels attacked and destroyed the Kingfisher megaship.<br>Vox Galactica published this on-the-scene report from field correspondent Ernesto Rios:<br>“Independent and Federal sources have verified that the Kingfisher was struck by multiple barrages from Thargoid weaponry. Medical teams are currently exploring the wreckage of the megaship in search of crew and passengers. Sadly, from what I’ve seen, the scale of the damage suggests that the chances of survival are extremely low.”<br>“Further confirmation came with the discovery of a log made by Dr Elias Pope of Orion University, who was overseeing attempts to communicate with the Thargoids. Although I have yet to hear this recording myself, it apparently describes exactly what happened when the Taranis anomaly passed through the system.”<br>“As news of the tragedy spreads, it has triggered a vociferous backlash against the Thargoid Advocacy Project. This fringe group recently gained a degree of respectability with the involvement of Congressman Dalton Chase and other media figures. But now there is widespread anger that, as Sol Today’s editorial put it, ‘Thousands of people were sent to die based on a vague hope that these alien warmongers might suddenly play nice.’”<br>“Congressman Chase himself told the press that he is reviewing the latest reports from Hyades Sector YO-Q b5-1, and cannot yet make any official comment. As the public face of the Kingfisher mission, it’s likely that any formal demands for accountability will be directed his way.”<br>“Meanwhile, Taranis draws ever closer to human-inhabited space. The Kingfisher’s destruction proves definitively that the rogue signal sources are of Thargoid origin, and that their intentions are hostile. With the prospect of the Second Thargoid War escalating to new levels, tensions throughout the core systems have never been higher.”"},{"title":"Kingfisher Megaship Vanishes","field_galnet_date":"24 NOV 3308","imageList":["NewsImageStarportCobra"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Contact has been lost with the Kingfisher megaship in the Hyades Sector YO-Q b5-1 system, just over a day since its arrival.<br>The Kingfisher was equipped to transmit signals to the interstellar anomaly named Taranis, with the goal of opening communications with it should such a possibility exist. Over 3,000 supporters of the xeno-peace movement were aboard the megaship when it departed the Andavandul system.<br>Rani Zaman , a spokesperson for the Thargoid Advocacy Project team monitoring long-range comms with the megaship, issued a statement to the media:<br>“I regret to say that all attempts to raise the Kingfisher on any frequency have failed. The last message we received was highly distorted, but seemed to be a distress call. We are asking for immediate assistance to locate the megaship and provide whatever support may be needed.”<br>The Federation responded by cancelling the temporary permit restriction to the Hyades Sector YO-Q b5-1 system for all vessels except fleet carriers. This permit was arranged at the request of Congressman Dalton Chase, who played a key role in procuring the Kingfisher megaship for use by TAP volunteers. With access to the system reinstated, Federal investigators have been despatched to assess the situation.<br>Observers have confirmed that the Taranis anomaly passed through Hyades Sector YO-Q b5-1 at faster-than-light speed. As with the other rogue signal sources, Taranis continues to move towards the core systems."},{"title":"Praise for the Pro-Peace Project","field_galnet_date":"23 NOV 3308","imageList":["NewsImageTouristStation"],"field_galnet_body":"Congressman Dalton Chase has applauded the increased public support for the goal of opening diplomatic channels with the Thargoids.<br>During an exclusive interview with ICE-caster Joy Senne, he said:<br>“Not so long ago, the idea of communicating with the Thargoids seemed absurd. But look at what’s happening in Andavandul right now! There’s so much support from the galactic community. People are placing their faith in a better future than just endless warfare.”<br>“My only regret is that I won’t be joining my fellow campaigners aboard the Kingfisher after all. The duties of my new congressional position mean that my diary has become full extremely quickly, with many commitments to uphold. But I’ll be travelling with them in spirit as they journey out to meet Taranis, and prove to its Thargoid controllers that humanity is ready to co-exist peacefully.”<br>Joy Senne revealed that she had planned to ICE-cast a live show from the Kingfisher megaship, as it encountered the interstellar anomaly known as Taranis in the Hyades Sector YO-Q b5-1 system:<br>“I was so disappointed when they told me that only direct transmissions aimed at Taranis would be permitted, to avoid confusing the ‘stargoid’ with other signals. Our good friend Heimar Borichev was due to join the crew today, but he messaged me less than an hour ago saying he’d fallen ill unexpectedly. So it’s left to the brave volunteers – we’re counting on you, Kingfisher!”<br>The Sovereign newsfeed confirmed these plans for its deputy editor, adding that opinion polls in independent systems suggested a 32% approval rate for the Thargoid Advocacy Project. Allied and Federal media primarily view the xeno-peace movement as ‘misguided’, while in the Empire the most common keyword associated with them is ‘suicidal’."},{"title":"Kingfisher Megaship Makes Final Preparations","field_galnet_date":"22 NOV 3308","imageList":["NewsImageStation"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Kingfisher megaship has received commodities in advance of its mission to communicate with the first rogue signal source.<br>The Thargoid Advocacy Project reported that the shipments of semiconductors and Muon Imagers will contribute to the communications array aboard the megaship. The deliveries of basic medicines, fruit and vegetables will be made available to its crew and passengers, which include thousands of pro-peace supporters.<br>Deutsche Elite Piloten Interstellar has announced that contributors can now collect payment from Blenkinsop Hub in the Andavandul system. This includes bounty voucher reimbursements for all pilots who eliminated criminal vessels threatening deliveries during the initiative.<br>The Kingfisher will tomorrow make the journey from Andavandul to the permit-locked Hyades Sector YO-Q b5-1 system. The first of the rogue signal sources, which has been named Taranis, will travel through the system within the next 48 hours. The precise nature of these faster-than-light anomalies remains unknown, but it is now accepted that they are of Thargoid origin.<br>Scheduling conflicts have prevented Congressman Dalton Chase from leading the diplomatic mission, despite his prominent role in organising the Kingfisher’s construction. The Sovereign’s deputy editor Heimar Borichev, another vocal supporter of the xeno-peace has announced plans to report from on board the megaship."},{"title":"The Coming of Taranis","field_galnet_date":"21 NOV 3308","imageList":["NewsImageMap"],"field_galnet_body":"As the rogue signal sources draw closer to human-occupied space, work is underway to initiate peaceful inter-species negotiations.<br>Dr Elias Pope  is a graduate of Orion University with degrees in interstellar relations, political science and xenology. He has recently joined the Kingfisher megaship’s crew to oversee the Thargoid Advocacy Project’s diplomatic mission. In an interview with Vox Galactica, Dr Pope explained his role:<br>“Like most of the Kingfisher’s crew, I volunteered to take part in this operation. It feels like my whole professional life has been leading to this opportunity. Many of the fine people here feel the same way I do. If there’s even a chance that we might begin properly talking to the Thargoids, well… it’ll be historic.”<br>“Luria , my assistant, tells me there are some media-friendly names for these anomalies now. As a scientific purist, she’s very unhappy about that! This first one has been labelled Taranis. It will transit through the Hyades Sector YO-Q b5-1 system at tremendous speed, so we won’t have long to snag its attention. But that’s what we’re aiming to do.”<br>“The megaship has an impressive suite of audio-visual, electromagnetic and hyperspace transmitters that will broadcast to Taranis as it approaches. We’ll be trying everything from flashing light patterns to multi-frequency data bursts. Establishing common ground is key to any negotiation, so I’ve composed messages that impart universally recognisable concepts such as mathematical formulae and star charts. These should illustrate our intellectual prowess and capacity for reasoning.”<br>“The best-case scenario is that whatever controls Taranis hears us and responds in kind. We must at least attempt to make peaceful overtures. Even if we fail, it would signify to humanity that there are many people willing to make the attempt, no matter how dangerous. Wish us luck.”"},{"title":"The Kingfisher Xeno-Peace Mission","field_galnet_date":"17 NOV 3308","imageList":["NewsImageTrade"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Kingfisher megaship has requested supplies for its planned journey to greet the first rogue signal source.<br>Shipments of basic medicines, fruit and vegetables are required for the Kingfisher’s crew, who will be joined by over 3,000 supporters of the Thargoid Advocacy Project. Semiconductors and Muon Imagers have also been requested to establish the mission’s communications arrays, which are being designed to initiate contact with the Thargoids.<br>Congressman Dalton Chase gave a press statement regarding the initiative:<br>“Now that we know the approaching anomalies are Thargoid, many are concerned that hostilities between our species will escalate. However, a brave group of volunteers see this as an opportunity to prove that diplomacy can work. An alien race has sent emissaries toward humanity’s space, and it is our duty to meet them with words rather than weapons.”<br>“The first of the anomalies, which we have named Taranis, is predicted to pass through Hyades Sector YO-Q b5-1. Using the high-level protocols available to Congress, I have successfully obtained a temporary access restriction that grants an exclusive permit to the Kingfisher. A range of broadcasts using multiple techniques will try to attract the Thargoids’ attention. Hopefully, the entity will slow down long enough to give some acknowledgement of these attempts.”<br>The delivery initiative in the Andavandul system is being managed by Deutsche Elite Piloten Interstellar. In order to protect deliveries to Blenkinsop Hub, the faction is offering increased payouts on bounty voucher redemptions."},{"title":"Coalsack Nebula Reports Thargoid Activity","field_galnet_date":"15 NOV 3308","imageList":["NewsImageThargoidIncursion"],"field_galnet_body":"The human colonists in the Coalsack Nebula has raised the alarm after Thargoid forces appeared several systems.<br>Following recent attacks on systems and vessels in the California Nebula, it appears that the Thargoids have again sought to occupy systems where barnacle fields are present on planet surfaces.<br>Councillor Lewis Laychurch, representing the Alliance Expeditionary Pact in HIP 62154, provided the following to the Alliance Tribune:<br>“Our security craft regularly patrol between the populated systems in this region. We had the first reports of nonhuman signals this morning. Obviously we’ve seen Thargoid activity in the Coalsack Nebula several times before, but this time was different. It’s not an attack as much as a presence.”<br>“We witnessed a huge upsurge in these signals in multiple systems. Over a couple of hours, it felt like Thargoid activity was visible on scanners wherever our ships looked. It’s exclusively in areas with barnacle sites, too.”<br>Now, there’s no secret that the Thargoids aren’t happy with our interest in the meta-alloys those sites produce. But this time they’re not attacking ports, or either the Spirit of Nysa or Song of Mecchi megaships. It’s like they’re waiting for something.”<br>The described behaviour matches similar Thargoid incursions into other populated systems in recent weeks. Researchers in the nebula have withdrawn from ongoing field studies of barnacle sites, citing safety concerns.<br>In other news, Azimuth Biotech has announced that the Glorious Prospect will distribute the Mbooni permit from the LHS 1163 system, instead of the T-Tauri system as planned. Federal authorities offered protection to the megaship to reduce the travel time between the two locations, granting combat pilots swift access to the anti-xeno weaponry offered at Prospect’s Deep."},{"title":"Public Unnerved by Palin Announcement","field_galnet_date":"15 NOV 3308","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"The announcement that the rogue signal sources heading towards the core systems are Thargoid in origin has caused unease within the general public.<br>Protests in systems on the edges of human space have taken place, demanding assurances from local governments about their safety. The failure to establish a collective human fleet to counter Thargoid incursions has left many concerned about what the future may hold.<br>Casey Kilpatrick provided this report from Castellan Station in Lave:<br>“Colleagues across multiple systems have confirmed that the impending arrival of the rogue signal sources – termed ‘stargoids’ by some in network media – has led to a shared sense of anxiety. ICE networks are seeing high interest in topics related to Thargoids, with negative sentiment aimed at politicians and military figures seen as responsible for the Proteus Wave event which perhaps attracted the anomalies. Witnesses report families transporting all they own to ships bound for the opposite side of the bubble.”<br>“Palin’s opinion that humanity may not be ready for what happens next has been criticised as needlessly alarming. While Palin is a brilliant scientist, his communication skills have been called ‘less than ideal’ in recent days. Yet his supporters, particularly among academics, have argued that it would be cowardly to hide the truth. If humanity is truly in danger, the statement at least could prompt a fresh allocation of resources to military organisations while also giving independents time to prepare.”<br>“Vista Genomics has reportedly contacted the team working alongside Professor Palin with a proposal to share its genetic database with ongoing research projects. The potential importance of such data may precede an increase in payments to those who record and submit genetic samples.”<br>“The news has also caused a stir across most financial markets. The main issue is the unpredictability of what this could mean for primary industries and their ability to maintain traditional supply and demand. The cost of goods and services may be impacted across clusters of systems. The Bank of Zaonce has announced it is monitoring the situation and is preparing several potential strategies in the event of an interstellar recession.”<br>“In conclusion, most are left with a rather unpalatable course of action: To sit and wait. No superpower has announced a means to prevent the Thargoid anomalies from reaching us. Palin’s announcement has hypothesised on what the signals may be, but could not confirm what they will do. It appears that we will all find out together, for better or worse.”"},{"title":"Xeno-Peacers Reject Prediction of War","field_galnet_date":"14 NOV 3308","imageList":["NewsImageThargoidSite2"],"field_galnet_body":"A claim that the rogue signal sources form part of a potential Thargoid offensive has been disputed by many in the pro-peace movement.<br>A joint statement by respected xenologists Professor Alba Tesreau, Professor Ishmael Palin and Ram Tah concluded that the approaching anomalies are a reaction to events in HIP 22460, and may have dire consequences for humanity. The eight signal sources are projected to arrive in the core systems within weeks.<br>Advocates for the Thargoid Advocacy Project and similar xeno-peace groups have rejected the idea that increased hostilities with the Thargoids is inevitable. As community liaison Bernadette Wells  said on the Joy Senne ICE-cast:<br>“Despite this ominous claim from three respected scientists, they have offered no hard evidence to support the assumption that the anomalies are hostile. I’m sorry, I know Seo Jin-ae has suffered enormously as part of Salvation’s unrelenting obsession with the Thargoids, but I don’t think we should be using her vague instincts to inform official policy regarding this alien species.”<br>Heimar Borichev, deputy editor of The Sovereign newsfeed, claimed:<br>“With all the talk of the superpowers forming a grand fleet, why are we not demanding they form a grand diplomatic effort? Many in the Assembly, Congress and Senate agree with this sentiment, but are too scared to risk their careers. We need a concerted campaign, pressuring elected officials to stop listening to the vultures who stand to benefit from continued conflict with the Thargoids.”<br>Congressman Dalton Chase is one of the few politicians to openly agree with this argument. In an interview with the Federal Free Press, he said:<br>“The Kingfisher megaship was established to lead a mission of peace with the Thargoids. But imagine how much greater our chances of success would be with official support. I call upon my colleagues in the Federation, and like-minded leaders everywhere, to promote peaceful coexistence as a valid strategy.”"},{"title":"Further FSS Scanner Upgrade Released","field_galnet_date":"11 NOV 3308","imageList":["NewsImageGraph"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>A version of the FSS scanning software used to track the Thargoid anomalies has been made available to the Pilots’ Federation.<br>Commanders should experience reduced interference when using the full spectrum system (FSS) scanner to focus on the anomalies. The team leading the development of the software, however, warned that the resultant clarity has done little to ease the concerns of Professor Palin, Ram Tah and other leading scientists.<br>Lori Jameson, an engineer contributing to the FSS scanner's software calibration, commented:<br>“We’re pleased with the update and are happy to share it with Commanders, who have provided much of the data used by the institutions researching the rogue signal sources. Representatives of Canonn Interstellar Research Group, Orion University and Universal Cartographics have also helped greatly. I just wish the results generated a more promising picture.”<br>“I understand the calls for peace that we’ve been hearing more of. But judging by the feedback these signals are emitting, they’re… well, I’m trying not to push my opinions on others. I urge Commanders to take a look with the FSS scanner for themselves.”<br>The update has been delivered to all registered Pilots’ Federation vessels free of charge."},{"title":"Understanding the ‘Thargoid Roar’","field_galnet_date":"10 NOV 3308","imageList":["NewsImageFuturisticCityscape"],"field_galnet_body":"Professor Alba Tesreau, Professor Ishmael Palin and Ram Tah have released a joint statement regarding the alien sound heard at HIP 22460.<br>“There has been much speculation about the mysterious noise that was recorded following the Battle of HIP 22460, which is clearly of Thargoid origin. Thanks to the help of Seo Jin-ae, formerly known as Subject D-2, we have started to comprehend some of its meaning.”<br>“What was audible to humans was only part of a complex multi-frequency transmission, amplified by the energy surging through the Thargoid surface site which housed the Proteus Wave weapon. Its specifics remain indecipherable for the moment, but certain aspects were isolated with the aid of Ms Seo, whose unique neural implants were designed to interface with Thargoid technology.” <br>“She believes there is a ‘call and response’ element, as if the signal was a reply to the Thargoid forces in HIP 22460. This was interwoven with a sense of acknowledgement and focus, which Ms Seo described as: ‘We see them. We are coming.’”<br>“Further insights from Ms Seo plus advanced audio analysis leads us to conclude that the sound emanated from a single Thargoid entity, and was transmitted with more power than anything previously encountered.”<br>“Popular theory has linked this ‘Thargoid roar’ to the anomalies known as rogue signal sources, which are currently converging on the core systems. Seo Jin-ae appears convinced that, whatever their ultimate motive may be, they have been deployed by the Thargoids as a direct response to Salvation’s Proteus Wave weapon.”<br>“We solemnly predict that the Second Thargoid War is about to enter a new phase, and humanity may not yet be prepared to withstand it.”"},{"title":"Azimuth Claim Expensive Success","field_galnet_date":"10 NOV 3308","imageList":["NewsImageWar"],"field_galnet_body":"The recent Azimuth Biotech initiative to expand its operation assets has been described as a ‘partial success’.<br>A primary goal of obtaining sufficient resources to establish a new anti-xeno megaship has been met, Azimuth CEO Torben Rademaker announced. The megaship is expected to be operational within the next few weeks.<br>Opponents of the weapons research corporation, seeking to disrupt the campaign, mobilised forces to engage Azimuth security vessels. While unable to prevent sufficient deliveries from reaching the Musashi, it is thought these pilots inflicted significant losses on the Azimuth fleet.<br>“We are delighted with the support shown to Azimuth Biotech by independent pilots, and look to the future with optimism,” said Rademaker. “We will soon deploy a new AX megaship to lead our mobile operations. Setbacks inflicted by anarchic opponents of progress have delayed our plans to establish planetary research bases, however. This persistent antagonism will have to be resolved separately.”<br>Along with credit rewards, qualifying pilots that contributed to the delivery campaign will receive the Mbooni permit shortly, granting access to Azimuth’s selection of AX weaponry. Rademaker confirmed that the Glorious Prospect megaship will now sell this permit from the T-Tauri system permanently.<br>Pilots who fought for Azimuth Biotech will also receive overcharged Guardian plasma chargers in storage at the Musashi, providing they reaches the contribution threshold. Those who fought against Azimuth will receive rapid-fire multi-cannons with phasing sequence from Wandrama Purple Council soon, collectable from MacLean City."},{"title":"Xeno-Peace Champion Elected to Congress","field_galnet_date":"07 NOV 3308","imageList":["NewsImageFederalCityscape"],"field_galnet_body":"Dalton Chase, the former governor of Andavandul 1, has become a Federal congressman following victory in the recent special election.<br>Despite his relative youth and inexperience, many voters within the congressional district were influenced by Chase’s charm and positive campaign message. His enthusiasm for opening diplomatic relations with the Thargoids resonated with younger voters. The Liberal Party also ran a creative PR campaign across social channels, which was amplified by many counter-cultural ICE-casters.<br>After formally swearing in and taking his oath of office, Congressman Chase proclaimed:<br>“I’m conscious that some view me as unorthodox or contrarian, perhaps even ‘soft on Thargoids’. But I take the security of the Federation as seriously as any of my honourable colleagues. Achieving peace with another species, and thereby saving the lives of countless Federal citizens, would be considered the great moral victory of our generation.”<br>Congratulations were offered by Shadow President Felicia Winters, who referred to Chase as a “spirited addition to our ranks”. Political analysts observed that she made no mention of his affiliation with the xeno-peace movement. Although some in the Liberal Party have expressed sympathy with its intentions, the majority consider it too radical to ever be officially endorsed.<br>Key members of the Thargoid Advocacy Project have thanked Congressman Chase for helping to establish the pro-peace megaship, Kingfisher. This is currently being outfitted with specialist technology designed to transmit signals of various types, in the hope of being able to effect two-way communication with the Thargoids."},{"title":"Destination: Humanity","field_galnet_date":"04 NOV 3308","imageList":["NewsImageMap"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>It has been confirmed that the mysterious anomalies known as rogue signal sources are all converging on the core systems.<br>Professor Yaro Kenyatta , a noted academic in astronomy-related fields, has been collaborating with Professor Ishmael Palin and Ram Tah on analysing the unexplained objects. He published a summary of their work in the scientific journal The Empirical: <br>“The first of these distant objects was detected on the 31st of August 3308, but several more have since been identified. It was quickly apparent that they were travelling through interstellar space at faster-than-light speed. Full spectrum system (FSS) scanners were upgraded to allow more pilots to detect their electromagnetic emissions.” <br>“Data on these phenomena has been analysed by many respected organisations such as Canonn Interstellar Research Group, Orion University and Universal Cartographics. Their consensus is that the rogue signal sources are all approaching the core systems, home to the vast majority of the human population.”<br>“As yet, we cannot determine when and where they will arrive with complete certainty. But it now seems unlikely that these are naturally occurring stellar bodies. It follows that eight distinct anomalies converging upon our small region of the galaxy cannot be pure chance. Human space is their intended destination.”<br>“What will happen when they arrive? Judging by their astonishing energy output, they may be devastating to inhabited systems. Each signal could be an energy projectile or a navigation beacon for some unknown force. More fanciful suggestions include celestial beings beyond our comprehension, or interstellar technology we have never witnessed. Our intention is to narrow down the more probable options soon.”<br>“Alternatively, if these are hyperspace distortions caused by non-human vessels, it’s possible they may decelerate as they draw near. But one conclusion can be made: whatever they are, they must know we are here.”"},{"title":"Azimuth to Expand Operational Assets","field_galnet_date":"03 NOV 3308","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"Azimuth Biotech has announced a campaign in the Wandrama system to expand its military and surface facility capacity.<br>The controversial weapons developer has seen a recent downturn in fortunes, due to fierce opposition by independent pilots protesting Azimuth’s history of illicit research. The failure of Salvation to bring an end to the war has also soured public sentiment towards the corporation.<br>Azimuth Biotech CEO Torben Rademaker announced the initiative:<br>“After a period of reflection, it is time for Azimuth to once again step forward and assume a position of support for the brave pilots engaging Thargoid forces wherever they are encountered. To do this, we shall establish a new megaship equipped to operation in Thargoid-tainted systems. The tragic loss of the Bright Sentinel and Heart of Taurus in HIP 22460 must not hinder our ambition any further.”<br>“We also intend to operate several surface outposts to aid our research projects. We aim to contribute to humanity’s military options once again, being careful not to repeat the mistakes of our former figurehead.”<br>Pilots contributing to Azimuth’s campaign, hosted at the Musashi megaship in Wandrama, will be granted the Mbooni permit and access to the company’s range of anti-xeno weaponry. Rademaker has promised that a successful campaign will allow for the Glorious Prospect to offer the Mbooni permit from the T-Tauri system permanently.<br>Within hours of the announcement, opponents of Azimuth Biotech had organised a counter-campaign to prevent deliveries from reaching Wandrama. Combat between Azimuth security forces and anti-Azimuth activists has been reported in the system. It is believed efforts to derail the campaign are being directed from MacLean City by Wandrama Purple Council. <br>In an effort to rally combat pilots to their respective causes, both factions are offering module rewards. Azimuth Biotech is offering its overcharged Guardian plasma charger, while Wandrama Purple Council promises a rapid-fire multi-cannon with phasing sequence."},{"title":"Peace with the Thargoids?","field_galnet_date":"02 NOV 3308","imageList":["NewsImageFuturisticCityscape"],"field_galnet_body":"The rise of the xeno-peace movement has caused a number of public figures to discuss coexisting peacefully with the Thargoid race.<br>With military options currently under discussion in the political capitals of all three superpowers, calls for diplomacy have sought to keep pace. Professor Shamus Madigan, Head of Xenology at Olympus Village University, is one of several figures to have weighed in on the matter: <br>“The ancient records of the Guardians, as deciphered by Ram Tah, describe how they learned enough of the Thargoids’ language to make peaceful overtures. These were rejected in favour of total war. Though millions of years have passed, it seems improbable that the Thargoids will view humanity any differently - particularly since we actively deploy Guardian-based weaponry against them.”<br>Federal Governor Dalton Chase: <br>“Assuming the communications barrier can be broken, I see no reason why we cannot have non-violent relations with these obviously intelligent beings. The recently consigned pro-peace megaship will help demonstrate to the Thargoids that we are not a single-minded warlike race, but a fellow advanced civilisation.” <br>Jaya Chaudhary , host of historical ICE-cast ‘Ghastly Pasts’:<br>“Human-Thargoid diplomacy might have been possible when our two species first encountered each other. But since then we have made two attempts to eradicate them, first with the mycoid compound and then with the Proteus Wave superweapon. Let’s be honest: would we want to talk to an alien race that did that to us?”<br>Ambassador Jasmina Halsey, former president of the Federation:<br>“We have discovered a little about the Thargoids’ history, behaviour and technologies. But their thought processes and reasoning may be utterly different to our own. I have no idea if they even comprehend what diplomacy is, let alone whether we could find common ground. But I do know that we must try, if only to prove to ourselves that we can do better.”"},{"title":"Council of Admirals Divided Over Unified Fleet","field_galnet_date":"01 NOV 3308","imageList":["NewsImageArrivingShip"],"field_galnet_body":"The Alliance Defence Force has been unable to reach a consensus over the proposal to combine the superpowers’ forces against the Thargoids.<br>Admirals Liam Flanagan , George Varma and Rachel Ziegler all openly support the concept of a unified fleet formed of Allied, Federal and Imperial vessels. However, Admirals Nikolas Glass, Maristela Silva  and Tahir West have rejected this in favour of focusing on the strategic defence pact with Sirius Corporation.<br>Fleet Admiral Hayley Sorokin, the highest ranking officer in the Alliance Defence Force, has yet to reveal her own view. When pressed by a journalist from the Old Worlds Gazette, she commented: “A decision of such magnitude is more political than military, and therefore the province of the Assembly.”<br>There was a more forthright statement from Admiral Ziegler, who previously commanded an Allied anti-xeno taskforce:<br>“This refusal to accept that we must come together to fight the Thargoids is enormously disappointing. Many of our counterparts in the Federal Navy are keen to increase links between militaries, and I firmly believe that we would soon convince the Empire to join us. We must not indefinitely rule out re-establishing Aegis or a similar anti-xeno initiative.” <br>In related news, Deputy Prime Minister Angela Corcoran has proposed a bill to the Assembly approving the reformation of Aegis. However, this has not received enough support to be formally debated and would achieve little without similar acts in the Federal Congress or Imperial Senate."},{"title":"Empire Dismisses Calls for Aegis Return","field_galnet_date":"31 OCT 3308","imageList":["NewsImageImperialPalace"],"field_galnet_body":"The Imperial Senate has debated contributing to anti-xeno activities such as Aegis or a unified superpower fleet. <br>Senator Caspian Leopold initiated the discussions among his colleagues, stating:<br>“One would never criticise Her Majesty’s priority to defend the Empire above all else. Nevertheless, we face an adversary that how shown no sign of understanding humanity’s many political, social or cultural distinctions. To them there is no Empire. Our citizens are simply more humans for the Thargoids to destroy.”<br>“If we were to share our research and resources with a reformed Aegis, might we not end the Second Thargoid War sooner?”<br>Imperial Admiral of the Fleet, Denton Patreus, responded:<br>“Let me be clear: Aegis has been consigned to history. Likewise, the idea of unifying all three superpower fleets is a completely impractical fantasy. We can best serve the Empire by reinforcing the Imperial Navy and other military forces serving the Emperor.”<br>“I assure you, senators, that we are closely monitoring Thargoid activity and the threat is currently contained. The anomalous signals moving towards the core systems are being tracked. But should any xeno force encroach upon Imperial territory, we are more than ready.”<br>The issue was laid to rest Chancellor Anders Blaine:<br>“Esteemed colleagues, there is great honour in exploring how best to protect our people from the alien foe. But I must remind you: a decree from the Emperor cannot be overruled, not even by this august chamber. The Empire will abstain from collaborating with the Alliance, Federation or any other foreign nation until Her Majesty wishes otherwise.”"},{"title":"Superpowers Discuss Unified Anti-Xeno Fleet","field_galnet_date":"28 OCT 3308","imageList":["NewsImageStation"],"field_galnet_body":"Ambassadors of all three superpowers have held emergency talks following the California nebula attacks, with a united military fleet the primary topic.<br>Political journalist Conrad Sterling provided this report for Vox Galactica:<br>“The public demand to address the evolving Thargoid threat has led to key military personnel suggesting that the Allied, Federal and Imperial naval fleets could work in concert for the duration of the war. This once-inconceivable notion seems more plausible following the coalition in HIP 22460, despite the regrettable outcome of that operation.”<br>“Sources have confirmed that Admiral Rachel Ziegler sought to contact Admiral Maxton Price directly, to discuss ways in which the Alliance Defence Force and Federal Navy might collaborate. Others have openly supported the idea of ‘a glorious grand armada to wipe out the alien hordes,’ as Vice Admiral Juno Rochester phrased it.”<br>“However, there has been little in the way of political enthusiasm, with neither the Assembly nor Congress willing to debate the topic. Many leaders had their fingers burnt by aiding Salvation, which could dissuade them from extending the hand of comradeship once again.”<br>“And then there is the Empire, which lacks any interest in further collaboration with outside governments or organisations. While the Emperor pursues her new path of Imperial isolationism, the Imperial Navy’s might cannot be relied upon to protect Allied, Federal or independent systems from Thargoid attack.”<br>“Nevertheless, the prospect of resurrecting the anti-xeno agency Aegis continues to gain traction. Professor Tesreau’s recent symposium outlined plans for a new incarnation that would avoid the mistakes of the past. Even if we never see a grand human armada, the call for unity could manifest in a number of other ways.”"},{"title":"Thargoids Raid Nebula Colony","field_galnet_date":"27 OCT 3308","imageList":["NewsImageThargoidShips"],"field_galnet_body":"The human enclave within the California Nebula has reported multiple attacks from Thargoid forces.<br>Systems such as California Sector CQ-Y c5 and HIP 18077 have experienced direct assaults by large numbers of Thargoid vessels. Megaships in the area have also been attacked and left in disrepair, with surviving crews activating distress signals.<br>Harrison Gladstone, a spokesperson for Turner Research Group which oversees Allied operations in the region, gave a statement to Vox Galactica:<br>“We’re accustomed to the Thargoid encounters in the California nebula, but this time their aggression caught everyone by surprise. Research teams have been recalled from the region’s barnacle sites. It’s just become too dangerous to send our people out there.”<br>Colonisation of the California Nebula took place in 3302 and focused primarily on harvesting meta-alloys from Thargoid barnacle sites. Although the enclave was initially established by the Alliance, the Kumo Crew’s expansion into the area last year brought tension.<br>The Tau Ceti Journal reported that these latest attacks may directly impact the meta-alloy market. Some Federal corporations, which directly purchase this material from the Alliance, have warned that fresh sources of meta-alloys could be required to prevent commercial instability."},{"title":"Xeno-Peace Project Gathers Support","field_galnet_date":"27 OCT 3308","imageList":["NewsImagePoliticalRally"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Deliveries to the Andavandul system have enabled the Thargoid Advocacy Project to begin preparations for a diplomatic mission.<br>Governor Dalton Chase, who is campaigning to become a member of the Federal Congress, arranged the initiative to create a non-partisan envoy vessel. Its objective will be to find ways to open communication with the Thargoids and make peaceful overtures to end the conflict.<br>Polly  French, organiser of a Thargoid Advocacy Project rally in Andavandul, told the media:<br>“War with the Thargoids represents multiple failures. A failure to imagine coexistence with another intelligent species. A failure to restrain our violent reactions to the unknown. By sending emissaries and opening diplomatic channels, we can prove that human civilisation is advanced enough to seek peace.”<br>“I am grateful to Governor Chase for his generous funding and promotion of this project. Sincere thanks are also due to all the pilots who transported computer components, semiconductors and titanium, as well as those who fought hard to defend this operation. Personally, I’m very excited to see our new vessel for the first time.”<br>Deutsche Elite Piloten Interstellar is now offering payment and combat bond reimbursement to all contributors from Blenkinsop Hub in the Andavandul system."},{"title":"The Call for Unity","field_galnet_date":"25 OCT 3308","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"Newsfeeds across the core systems have reflected the increasing public demand for full-scale military cooperation against the Thargoids.<br>Federal Free Press: “Removing the Far God cult from Federal space was a way of distracting the people from President Hudson’s failures. The real threat remains the Thargoids themselves, and there is little chance of withstanding them without Allied and Imperial aid.”<br>Citizens' Chronicle: “With the greatest respect to Her Majesty, the Empire cannot pretend that it played no part in the disaster at HIP 22460. Surely we are strong enough to shoulder some of the burden in defeating this common enemy?”<br>Old Worlds Gazette: “After the Aegis symposium, Deputy Prime Minister Angela Corcoran supported reinstating the tri-superpower agency, claiming: ‘The scale of the conflict deserves a stronger response than our pact with Sirius Corporation can provide.’”<br>The Marlin Standard: “The proximity of the Thargoids to our democratic republic has always been a major concern. Parliament has agreed that any collaborative anti-xeno initiative would be of great interest.”<br>Sol Today: “We all know that you can’t trust the Imps or the Alliars. But at least they’re not vicious genocidal monstrosities. And as General Falkenrath famously said: ‘The enemy of my enemy is my disposable infantry.’”<br>The Sovereign: “The xeno-peace movement, as espoused by our very own Heimar Borichev, is laudable. But many independent systems are demanding a less diplomatic strategy.”<br>Vox Galactica: “The demands for a solution to the Thargoids are becoming more strident. According to unofficial reports, some low-level civil and military leaders have begun talking across the political divides, despite the lack of direction from their superiors. There is clearly a growing appetite for solidarity, whether through Aegis or some other means.”"},{"title":"Hadrian Duval Endorses Imperial Isolation","field_galnet_date":"21 OCT 3308","imageList":["NewsImageImperialCityscape"],"field_galnet_body":"The Empire’s withdrawal from all cross-superpower operations has gained the full support of Hadrian Augustus Duval.<br>Political journalist Cassia Carvalho reviewed the situation for The Imperial Herald:<br>“As the illegitimate grandson of Emperor Hengist, Hadrian Duval has long been considered the ‘black sheep’ of the Imperial Family. Only a few years ago, he sought to replace Emperor Arissa Lavigny-Duval on the throne. But he has since been pardoned and accepted as a genuine Duval, albeit with no royal title or position.”<br>“Now, for the first time, Hadrian openly approves of the Emperor’s decisions. As he told Paresa News Network: ‘Walking away from the Alliance and Federation is the right path for the Empire to take. The Imperial Navy deserves to be our priority, to reinforce our strength and better defend us against our enemies.’”<br>“Senator Zemina Torval dismissed this as a ‘hypocritical volte-face’, but in truth, Hadrian has always championed isolationism and traditional Imperial values. He seems as surprised as anyone to find that Emperor Arissa now shares some of his political ideologies. Ironically, it is now Princess Aisling Duval who has emerged as the voice of rebellion against Imperial policy.”<br>“Others in the Senate have suggested that Hadrian Duval might serve the Empire in a more official capacity, or be bestowed a title and accepted into the nobility. The Emperor may find that the young man who was once her greatest threat could be transformed into a loyal ally.”"}]