[{"title":"Scriveners Clan Resists Orion University","field_galnet_date":"22 OCT 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"The spacefaring tribe that lives aboard an ancient dredger has refused to allow Orion University to take possession of the vessel.<br>Vox Galactica published an eye-witness account by freelance reporter Casey Kilpatrick from the Oochost PC-C c29-0 system:<br>“Once the Scriveners Clan was found, it wasn’t long before Orion University arrived. Their megaship, Scientia Aeterna, remotely disabled the dredger’s hyperdrive using a series of override codes. These had been unearthed from the university’s archives, along with evidence that the ship – commissioned in 3088 as Dredger J-403 – legally belongs to them.”<br>“Despite being unable to escape, the Scriveners have made a stand. All requests to communicate were roundly ignored. I’ve watched several craft try to dock with the dredger, only to be met with sealed airlocks and an electrified hull.”<br>“It’s clear that these people are unwilling to give up their home simply because of centuries-old legislation. But it’s also apparent that Orion University is interested in more than just reclaiming lost property…”<br>“The Scriveners possess something that they refer to as a Knowledge Core, which contains everything that this scholarly society has learned during its long voyage. What discoveries might this database contain? And how far will the university go to get their hands on it?”"},{"title":"Torval Mining Ltd Requests Resources","field_galnet_date":"21 OCT 3307","imageList":["NewsImageArrivingShip"],"field_galnet_body":"*Pilots Federation ALERT*<br>Senator Zemina Torval’s new corporation requires deliveries of commodities to its megaship in the EGM 559 system.<br>Constantia Torval, the senator’s daughter and operations director of the company, provided details of the initiative:<br>“Now that we are a fully independent business, additional resources are urgently needed to continue providing services to the Empire. My goal is to ensure that the Torval name remains synonymous with efficiency and dedication.”<br>“Shipments of geological equipment, microbial furnaces and mineral extractors can be delivered to the megaship Pride of Bitterwood in the EGM 559 system. From there, they will be transferred to our headquarters at Torval Orbital in LTT 198.”<br>The Pride of Bitterwood is part of a corporate fleet recently purchased by Torval Mining Ltd. Most are currently in the LTT 198 system being outfitted for mining and transport operations. Business analysts believe that these megaships were funded by Zemina Torval after selling the majority of her shares in Mastopolos Mining."},{"title":"Federal Agents Crush Jupiter Division Extremists","field_galnet_date":"20 OCT 3307","imageList":["NewsImageFederalCityscape","FederationIconNewsImage"],"field_galnet_body":"A pro-corporatist group planning a series of terror attacks has been shut down by the Federal Intelligence Agency.<br>An update on the operation was delivered by Deputy Director Bethany Blake, who runs the Proactive Detection Bureau:<br>“Special forces have now arrested the organisers of the underground organisation called Jupiter’s Wrath. This was a collection of citizens radicalised by Jupiter Rochester into believing that they could replace democratically elected leaders with corporate overlords.”<br>“This successful operation was only possible thanks to information provided by the PDB. Without this surveillance network, we would be entirely unaware of Jupiter’s Wrath and many leading politicians may have lost their lives.”<br>“Our analysts are now updating the PDB’s algorithms to highlight citizens who are at risk of radicalisation. We will prevent domestic terrorism by identifying those being corrupted by hostile ideologies.”<br>In response, Congressman Bai Zheng was quoted in The Federal Times:<br>“This is an unnerving development in the PDB’s evolution. It’s also what many of us in Congress feared. We are not targeting people who have committed a crime, but people whose personal opinions are unpalatable to the government.”"},{"title":"Jokers’ Deck Hunts the Winking Cat","field_galnet_date":"19 OCT 3307","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"Francesca Wolfe of the Wallglass Investigations Agency has sent a final report from her infiltration of the secretive gambling circle.<br>“The bad news is that Jokers’ Deck security caught up with me as I was trying to sneak onboard a ship to get off-planet. The good news is that they didn’t gun me down, or even threaten to press charges. Instead, they offered me a job!”<br>“Lexi October, the current host, was surprisingly gracious. Turns out she’s a fan of the Galactic Mysteries pieces that Gunnarson and I run, but more importantly, she believes we could give her what she really wants – the Winking Cat.”<br>“She explained that the Joker playing card that was stolen is hugely symbolic to the group, having belonged to its original founder. She also assured me that Jokers’ Deck is extremely private but not criminal. Its members sign legal waivers, and there is a strict honour code to ensure all bets are paid.”<br>“So, Lexi October wants to hire us to track down the infamous Winking Cat thief and retrieve the ceremonial playing card. This may also be a way for her to save face with her fellow super-rich gamblers, who are understandably unhappy about the exposure.”<br>Erik Gunnarson, Wolfe’s detective partner, added:<br>“It’s a huge relief that Wolfe is safe, but what has she got us into now? Will we really be able to catch the Winking Cat? I wouldn’t bet on it.”"},{"title":"Scriveners Clan Dredger Located","field_galnet_date":"18 OCT 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"*Pilots Federation ALERT*<br>The dredger inhabited by the nomadic Scriveners Clan has been found within the Oochost PC-C c29-0 system.<br>Independent pilots conducted a search for the vessel in response to a request from Orion University, which claims that the Dredger-class bulk cruiser is its commercial property.<br>Vice Chancellor Leland Pettigrew announced the operation’s success:<br>“Congratulations to the pilots who managed to locate Dredger J-403. The university will shortly dispatch a megaship to take ownership and arrange repatriation for its current occupants.”<br>The dredger is currently orbiting an ice world in the Oochost PC-C c29-0 system. It is believed to be collecting raw material from planetary rings to sustain its onboard systems, a design feature that allows it to remain self-sufficient indefinitely.<br>There has been no communication with the Scriveners Clan, the spacefaring tribe descended from an academic institute that was later absorbed into Orion University. It is known that they shun contact with all outsiders to protect their Knowledge Core, a repository of research conducted over the past two centuries."},{"title":"NMLA Aims to ‘Extinguish the Duval Line’","field_galnet_date":"15 OCT 3307","imageList":["NewsImageImperialPalace"],"field_galnet_body":"The Neo-Marlinist Liberation Army has taken responsibility for the attack on Dyson City starport in the Paresa system.<br>The primary targets were Imperator Hadrian Duval and his wife Lady Astrid Minerva-Duval, who is pregnant with his child. Although they survived, the bombing left many thousands dead and injured.<br>The following message was sent across NMLA propaganda channels:<br>“As long as a single Duval is left alive, the Republic of Achenar cannot be rebuilt. It is our duty to extinguish that entire line and free our people from Imperial oppression.”<br>Praetor Leo Magnus gave a statement on behalf of ACT:<br>“It is significant that this latest broadcast is not from Theta Seven, the NMLA’s mouthpiece and de facto leader. We believe that Theta Group – the team of weaponsmiths that built the caustic enzyme bombs – has split in two.”<br>“According to the communications we intercepted, Theta Seven and half of his followers went into hiding after the attacks against the Marlinist Colonies in July. The others continued their terror campaign and were responsible for this latest atrocity. ACT is currently pursuing leads and hopes to learn more soon.”<br>Nova Imperium has repeated a call for pilots to help rescue survivors from Dyson City in the Paresa system."},{"title":"Terrorist Attack at Hadrian Duval’s HQ ","field_galnet_date":"14 OCT 3307","imageList":["NewsImageStationDamaged"],"field_galnet_body":"*Pilots Federation ALERT*<br>Explosions have struck Dyson City starport in the Paresa system, home of Hadrian Duval’s organisation Nova Imperium.<br>The starport suffered severe structural damage plus the corrosive effects of caustic enzymes, characteristic of the customised weapons used by the NMLA. Initial reports state that over fifteen thousand people have been killed and a similar number injured.<br>The following statement was issued by Praetor Leo Magnus, the former head of security for Nova Imperium who was seconded to ACT:<br>“Shortly before this attack, my team intercepted a communication between suspected Neo-Marlinist supporters. This referred to an imminent attempt to kill Imperator Hadrian Duval, Lady Astrid Minerva-Duval and their unborn child.”<br>“I immediately ordered the Praetorian Guard to move the Imperator’s family off-station, which was achieved minutes before the bombs detonated. I am pleased to report that they survived this brutal attack, but unfortunately the remaining population could not have been evacuated in time.”<br>A state of emergency has been declared in the Paresa system, with an urgent request for independent pilots to assist with rescuing survivors from Dyson City starport.<br>The Empire confirmed that as per the Treaty of Paresa, it will provide military and medical support to Nova Imperium. ACT is performing investigations to learn more about the attack.<br>"},{"title":"Colonia Bridge Project Receives Deliveries","field_galnet_date":"14 OCT 3307","imageList":["NewsImageStationConstruction"],"field_galnet_body":"*Pilots Federation ALERT*<br>Twin initiatives in the Alcor and Colonia systems have procured materials to construct new dockable megaships.<br>Brewer Corporation made an announcement regarding its Colonia Bridge project:<br>“A positive response has led to generous shipments of ceramic composites, computer components and thermal cooling units being received. As a result, Brewer Corporation can now commence work on enhancing the transportation infrastructure between the core systems and the Colonia region.”<br>“Thanks to the dedication of the galactic community, 30 dockable megaships will be placed along the Colonia Bridge route by the 28th of October. These will serve as stationary ports, providing vital facilities for travellers. Planning is already underway for the second phase of this project, placing further megaships every four to five hundred light years working out from the Alcor and Colonia systems.”<br>“Payment for contributing pilots is now available at Macdonald Settlement in the Alcor system and Jaques Station in the Colonia system. Both starports also offer a temporary discount on purchasing and outfitting to owners of our Drake-class Carriers.”<br>Brewer Corporation will soon be reaching out to the top ten pilots from both the Alcor and Colonia initiatives, to provide naming suggestions for the dockable megaships being placed on the route to Colonia. Submissions will be subject to review by the Brewer Corporation board of directors.<br>"},{"title":"Orion University Searches for Dredger","field_galnet_date":"14 OCT 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"*Pilots Federation ALERT*<br>Rewards are being offered by Orion University to locate the Scriveners Clan dredger, which it claims as its legal property.<br>The self-sustaining Dredger-class bulk cruiser was launched two centuries ago by an academic institute that was later absorbed by the university. Since then the dredger has become the home for a nomadic tribe called the Scriveners Clan, which refuses contact with all outsiders.<br>Vice Chancellor Leland Pettigrew told the media:<br>“Orion University is willing to reward pilots who can pinpoint the dredger’s current location. We believe it is still within 500 light years of the Perseus Dark Region KC-V c2-2 system.”<br>“Pilots who are interested in helping should first dock at Ring Mine station in the 2MASS J03291977+3124572 system, to automatically sign up to the search operation. Our associates at the starport, Deep Space Mining, will provide further information including details of the reward.”<br>"},{"title":"Federal Terrorist Network Exposed","field_galnet_date":"13 OCT 3307","imageList":["NewsImageFederalCityscape","FederationIconNewsImage"],"field_galnet_body":"The Proactive Detection Bureau has been instrumental in identifying violent corporatist extremists within the Federation.<br>Deputy Director Bethany Blake of the Federal Intelligence Agency gave a statement to the media:<br>“In recent weeks, our surveillance algorithms flagged a series of coded communications for investigation. We found that a network of radicalised citizens were discussing plans to assassinate members of Congress and leading political figures.”<br>“This movement, which calls itself Jupiter’s Wrath, is inspired by Jupiter Rochester’s failed attempt to enable corporations to directly rule the Federation. Their goal was to enact revenge on those who they consider to be the ‘enemies of Jupiter Division’.”<br>“Using data intercepted by the Proactive Detection Bureau, FIA agents performed a series of coordinated strikes in several Federal systems. Over a thousand armed extremists were arrested before they could act. We are currently working to identify the remaining Jupiter’s Wrath members.”<br>Vice President Jerome Archer claimed that this was further validation of the Domestic Counter-Terrorism Act, which permitted the PDB to be established. However, Shadow President Felicia Winters commented:<br>“I commend the FIA for performing their duties. But I also question the timing of this operation, coming so soon after President Hudson’s appallingly reckless attempt to capture Yuri Grom. To me it seems calculated to show his administration in a positive light, while ignoring the violation of citizens’ privacy.”"},{"title":"Orion University Claims Ownership of Dredger","field_galnet_date":"13 OCT 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"The ancient spacefaring home of the Scriveners Clan is the legal property of Orion University, according to newfound historical records.<br>The Scriveners Clan is a nomadic tribe travelling onboard a self-sufficient Dredger-class bulk cruiser. Their society is descended from an academic organisation that sent out a research fleet two centuries ago. Unlike some dredger clans, they refuse to have any contact with outsiders.<br>Vice Chancellor Leland Pettigrew of Orion University made this statement:<br>“In the year 3088, Dredger J-403 was commissioned for an exploration mission by an academic institute named Scrivener College. This was absorbed into our university in 3125. Documents detailing these facts were recently discovered in our archives and verified by the courts.”<br>“Therefore the dredger, including all of its contents, is legally owned by Orion University. Naturally we bear no ill will toward its current populace, but the vessel they inhabit has always been our commercial property.”<br>The Scriveners Clan dredger was last seen in the Perseus Dark Region KC-V c2-2 system, where it was salvaging the Hesperus megaship. On the 9th of July it made a hyperspace jump to an unknown destination within 500 light years.<br>Orion University is the largest independent educational institution in the core systems, rivalled only by the Imperial Science Academy and Olympus Village University.<br>"},{"title":"Jokers’ Deck Hit by Art Thief","field_galnet_date":"12 OCT 3307","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"The secretive gambling circle of the super-rich has been raided by the notorious criminal known only as the Winking Cat.<br>The information was revealed by Francesca Wolfe of the Wallglass Investigations Agency, who infiltrated the event. Her report, which was relayed from an unidentified location, has been published by her fellow detective Erik Gunnarson.<br>“I’m not sure this will reach Gunnarson, but I must try. After the security alert the staff started getting their IDs checked, which might have revealed mine to be fake. I managed to slip out of the warehouse and into an abandoned industrial district. I still don’t know what planet I’m on, but I’ve found an old comms transmitter to send this message.”<br>“Before I escaped, I learned what had caused the alert. There was a VIP ceremony involving the group’s most precious possession: an ancient Joker playing card. Apparently this has been passed between senior members of Jokers’ Deck for centuries, always held by the current host. But when Lexi October publicly unveiled the card, she found it had been replaced by one showing a different graphic – a winking cat.”<br>“It’s two years since we’ve heard from the galaxy’s greatest larcenist, but there’s no doubt that only the Winking Cat’s legendary skills could have circumvented their security systems. I’m fascinated that a battered scrap of card has greater value than any of the billion-credit items being wagered here.”<br>“Guards are searching for the thief now. I hope I can get off-world before they find me instead. They’re armed to the teeth and not in the mood to talk…”"},{"title":"Corporate Split between Mastopolos and Torval ","field_galnet_date":"08 OCT 3307","imageList":["NewsImageImperialPalace"],"field_galnet_body":"Senator Zemina Torval’s company Torval-Mastopolos Mining has become fully independent from its parent corporation.<br>The former subsidiary of Mastopolos Mining has officially rebranded itself as Torval Mining Ltd. Zemina Torval is listed as its CEO, with her eldest daughter remaining as operations director. The starport Torval Orbital in the LTT 198 system serves as the company’s headquarters.<br>Business correspondent Anton Lagorio reported for The Imperial Herald:<br>“Although Torval Mining Ltd is now an independent company, shares are legally transferable between it and Mastopolos Mining. This has allowed loyal supporters of both Zemina Torval and Gabriella Mastopolos to flock to each other’s banner. As a result, Torval Mining Ltd has acquired many ships, staff and resources from its former parent.”<br>“There have been assurances that the split was amicable and in line with Imperial traditions of honourable conduct. Constantia Torval has promised customers that mining and transportation services would be maintained to the same high standard.”<br>“Speculation continues over what caused this unexpected rift between the Torval and Mastopolos families. It seems that Zemina Torval is focusing on providing benefits for her own children and grandchildren, rather than her cousins on the Mastopolos side, but the reason for this change of heart remains unclear.”"},{"title":"Twin Initiatives for Colonia Bridge Project","field_galnet_date":"07 OCT 3307","imageList":["NewsImageStationConstruction"],"field_galnet_body":"*Pilots Federation ALERT*<br>Delivery campaigns in the Alcor and Colonia systems aim to improve journeys to the distant colonies.<br>The Colonia Bridge project is being funded by Brewer Corporation, which outlined the details in a press release:<br>“The Colonia region has great potential for businesses and travellers, but the long voyage can be prohibitive. Brewer Corporation is investing in the transportation infrastructure between the core systems and Colonia, to make crossing those thousands of light years easier.”<br>“Up to 30 dockable megaships will be placed along the route to Colonia, providing travellers with valuable respite and resources including tritium. These stationary megaships should be operational by the 28th of October, and will mark the completion of the first phase of the three-phase Colonia Bridge project. Its aim is to place dockable megaships every four to five hundred light years working out from the Alcor and Colonia systems.”<br>“To achieve this, we require large quantities of ceramic composites, computer components and thermal cooling units. These can be delivered to either Macdonald Settlement in the Alcor system or Jaques Station in the Colonia system.”<br>The Colonia Council is subsidising part of the initiative, due to the importance of this enterprise. As a consequence, the commodity requirements for the megaships at Jaques Station are reduced.<br>Brewer Corporation has confirmed that as well as offering payment for the materials, it will ask the top ten contributors at Alcor and Colonia to submit potential names for the new megaships. Submissions will be subject to review by the Brewer Corporation board of directors.<br>As an added incentive, there will be temporary discounts on purchasing and outfitting fleet carriers at both Macdonald Settlement and Jacques Station, based on pilots’ contributions."},{"title":"Yuri Grom Victorious Against Federation","field_galnet_date":"07 OCT 3307","imageList":["NewsImageRebellionFederation"],"field_galnet_body":"*Pilots Federation ALERT*<br>The battle between Delta Pavonis Galactic Interstellar and EG Union has concluded successfully for Yuri Grom’s forces.<br>Freelance war correspondent Karleen Troy reported via Vox Galactica:<br>“For the past week, the Delta Pavonis system has been aflame with ship-to-ship engagements. But despite a fierce effort from Federal auxiliaries, EG Union was able to muster superior numbers.”<br>“Eventually the Federal flagship, Freedom’s Foundation, was boarded. I picked up comms chatter that described intense fighting before EG Union soldiers overran Federal troops. Since then I’ve learned that Yuri Grom has agreed to let the surviving crewmembers leave, but is claiming the megaship as ‘spoils of war’.”<br>The following message was sent by Yuri Grom on public channels:<br>“President Hudson has revealed his true nature as the corrupt heart of the Federation’s rotting carcass. This treachery will not be forgotten.”<br>Pilots who supported Yuri Grom can collect their rewards from the Indomitable megaship. Delta Pavonis Galactic Interstellar confirmed that although the Freedom’s Foundation is now under EG Union control, reimbursement for all Commanders who fought for Delta Pavonis Galactic Interstellar will be processed remotely by the 9th of October 3307."},{"title":"An Undercover Report on Jokers’ Deck ","field_galnet_date":"05 OCT 3307","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"Francesca Wolfe of the Wallglass Investigations Agency provides an inside view of the Jokers’ Deck gambling circle.<br>“Gunnarson’s intel was correct. The latest host is multi-billionaire investor Lexi October, the lady who rescued Supratech from bankruptcy. We’re in one of October Consortium’s disused warehouse complexes, which looks derelict on the outside but is a fabulous glittering palace within. I don’t actually know what planet I’m on, since all the servants – including me with my fake ID – were transported here in total secrecy.”<br>“Jokers’ Deck is exactly what you’d expect of a luxury casino for the super-rich. Exquisite food, sumptuous clothes, and dozens of games from deadlock poker to Giant Verrix racing. Wagers are made using billion-credit chips, precious gemstones and even land deeds to an entire continent. And that’s not counting the VIP rooms that I can’t get into.”<br>“I’ve served exotic drinks to several famous faces, such as Duchess Rouncival and Scorpio DeVorrow. I’ve seen Senator Leatrix talking earnestly to Ambassador Rochester about a princess they both know. Arch-Corsairs Trask and Volantyne from the Kumo Council are here, taking on Zachary Rackham at the roue mortelle tables. And there’s no mistaking the voice of Alliance megastar Xiona whenever she wins big.”<br>“Oh, and who should walk in just now but… wait, I can hear an alarm. Looks like a security alert. Damn it, have they detected me? I should – ”<br>The message was published by Erik Gunnarson, who added this coda:<br>“I’ve heard nothing more from Wolfe since receiving this, and she didn’t check in at a scheduled rendezvous point. I’ve decided to share her report as a warning to Jokers’ Deck. If anything happens to her, just remember we know who you are.”"},{"title":"Ambassador Condemns Entrapment of Yuri Grom","field_galnet_date":"04 OCT 3307","imageList":["NewsImageShipyardFederal"],"field_galnet_body":"The Federal Diplomatic Corps has officially denounced President Hudson’s attempt to capture Yuri Grom in the Delta Pavonis system.<br>The political conference was to determine whether the system’s ruling faction would ally with the EG Union or the Federation. It was abandoned when a Federal black ops team attempted to arrest Yuri Grom’s delegation, triggering a conflict in the system.<br>Ambassador Delphine Dumont told The Federal Times:<br>“We have no option but to state that our own government has violated the conventions of diplomatic immunity. This conference was established in good faith with all parties. We were not informed that any hostile act against EG Union was planned.”<br>“I offer my personal apologies to Yuri Grom. Our negotiations were spirited but honest, and I genuinely felt that progress was being made.”<br>This is the first time that the Federal Diplomatic Corps has distanced itself from the actions of a sitting president. Political observers believe that this is to maintain its reputation for integrity, especially in dealings with the Alliance and Empire.<br>Public reaction in the Federation has been varied, with President Zachary Hudson being praised and criticised in equal measure. Insiders within his administration suggest that he is under enormous pressure to regain popularity, following the recent rebellion of several Federal systems."},{"title":"Torval Loses Control of Mastopolos Mining","field_galnet_date":"01 OCT 3307","imageList":["NewsImageImperialPalace"],"field_galnet_body":"Senator Zemina Torval has relinquished her long-held position as Mastopolos Mining’s majority shareholder.<br>Official reports confirmed that the board of directors passed a resolution to remove Zemina Torval from their number. Over half of her shares were then sold, thereby drastically reducing her personal influence on the corporation.<br>An anonymous insider gave a statement to The Imperial Herald:<br>“Gabriella Mastopolos made it crystal clear to the other shareholders that it was time to topple Zemina Torval from her perch. But what surprised them was Torval’s lack of resistance to this pressure… almost as if she had been planning to step down all along.”<br>“I’ve heard that every credit made by selling the shares went straight into the subsidiary that her daughter is running. So maybe all her eggs are going into that basket?”<br>In related news Constantia Torval, operations director for Torval-Mastopolos Mining, made an announcement:<br>“I am proud to announce that the people of LTT 198 have elected Torval-Mastopolos Mining to replace LTT 198 State Ltd as their controlling authority. Permits to gain entry to the system can be earned via the Pride of Bitterwood megaship, which remains in the nearby EGM 559 system.”"},{"title":"Yuri Grom Targeted by Federal Strike","field_galnet_date":"30 SEP 3307","imageList":["NewsImageShipyardFederal"],"field_galnet_body":"*Pilots Federation ALERT*<br>The Delta Pavonis political conference has erupted into conflict between EG Union and Delta Pavonis Galactic Interstellar.<br>Yuri Grom, the ruler of EG Union, broadcast this message:<br>“This conference was nothing more than a trap! My delegation was apprehended at gunpoint by a squad of undercover Federal agents. Sacrifices made by my loyal guards enabled us to escape from Kessler City, only to find our ships under attack. The Federation has declared war – I will respond in kind!”<br>President Zachary Hudson gave an official statement:<br>“Yuri Grom is a traitor and a dangerous threat to Federal security. We cannot ignore any opportunity to eliminate this ruthless tyrant.”<br>Delta Pavonis Galactic Interstellar has asked for Federal auxiliaries to provide combat support to its forces. In return, the EG Union called for help from “allies of Yuri Grom and enemies of the Federation”.<br>Grand Duke Simion Petrescu, the host of the political conference, has rejected claims that his faction was secretly working with the Federation to entrap Yuri Grom. The Federal Diplomatic Corps has not yet commented on its role in these events."},{"title":"Saud Kruger Receives Exploration Data ","field_galnet_date":"30 SEP 3307","imageList":["NewsImageExpansionExploration"],"field_galnet_body":"*Pilots Federation ALERT*<br>Enormous amounts of data on Earth-like worlds has been collected for a campaign by shipbuilding firm Saud Kruger.<br>The data is highly valuable to the corporation’s subsidiary, Astrogator Tours, which runs holiday cruises across the galaxy and is seeking new locations.<br>The initiative was declared a success by CEO Stanislav Kruger:<br>“Not only have we received data about highly promising systems, but many creative Commanders provided imagery guaranteed to entice adventure-seekers to these new worlds. We are deeply grateful to all pilots who took part.”<br>Vistaenis Incorporated, Saud Kruger’s partner in this initiative, is now offering payment for the exploration data at Youll Port in the Vistaenis system. <br>Tourist beacons will be added to the most suitable systems by Thursday the 28th of October, which will record for posterity the names of the pilots who submitted the most compelling images.<br>As a result of the initiative, a discount of 15% will be applied to sales of all Dolphin, Orca and Beluga Liner ships from the 1st of October, alongside a reduction in cost for the luxury-class cabins which can be installed in any of Saud Kruger’s vessels."},{"title":"Galactic Mysteries: Jokers' Deck","field_galnet_date":"29 SEP 3307","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"Erik Gunnarson of the Wallglass Investigations Agency discusses the secretive gambling circle attended by the galaxy’s wealthiest players.<br>“Casinos and gaming hubs have always been popular, tempting people to risk their credits for the chance to score a lucrative win. But where do the billionaires and trillionaires go to enjoy that buzz?”<br>“Jokers’ Deck is a highly exclusive gambling event attended only by the rich and powerful. Nobody knows who runs it, only that it’s held in a different location each time. Its attendees are guaranteed – and can afford – total anonymity.”<br>“There was one exception. In 3305, Wallglass was hired to find the heiress Lady Talitha Ambrose, after she vanished along with her family’s fortune. I was part of the team that discovered she had gambled away 300 billion credits at Jokers’ Deck in a high-stakes game of deadlock poker. Their security was so tight that we never learned much more.”<br>“This year I’ve been tracking several rumours, such as Jokers’ Deck being present at the Galactic Summit and inviting political leaders to settle their differences at the roue mortelle table. But thanks to some costly bribes – which hopefully I can claim back as expenses – I’ve finally got a solid lead.”<br>“My partner, Francesca Wolfe, and I should have more to reveal soon. With a little luck we will gain a unique insight into this most privileged of gambling dens. Assuming we play our cards right...”"},{"title":"Salvation: Friend or Foe?","field_galnet_date":"27 SEP 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"The anonymous Salvation commands much support in the galactic community, but a resistance movement has emerged to sabotage his efforts.<br>Vox Galactica featured a special report from freelance journalist Alexei Keel:<br>“In his self-proclaimed war against the Thargoids, Salvation recently scored a major victory by eliminating their forces from the Cornsar system. But the ongoing mystery around the identity of this ‘man of science’, as well as his controversial methods, have led to a backlash.\"<br>“To deliver vital components for his mysterious anti-xeno weapon, Salvation once again recruited independent pilots, directly messaging those who had performed tasks for him before. However, this time a counter-initiative was formed by those who did not trust his motivations. It was also supported by believers in non-aggression against the Thargoids, and others who feared that the weapon might endanger Cornsar’s population.”<br>“Their actions involved acquiring the components, which were disguised as basic medicines, but destroying rather than delivering them. Whether or not this partial blockade impacted the weapon’s effectiveness remains unknown, but it acted as a substantial opposition to Salvation’s scheme.”<br>“Aegis is investigating the Cornsar incident, but with faith in that organisation at an all-time low, individual Commanders are now taking matters into their own hands. Time will tell if Salvation’s ambition to replace Aegis is a noble goal, or if we are replacing the devil we know with a darker demon.”"},{"title":"Progress Between Federation and Yuri Grom ","field_galnet_date":"24 SEP 3307","imageList":["NewsImageDiplomacyPressConference"],"field_galnet_body":"Negotiations between the Federation and self-styled dictator Yuri Grom are underway to determine the Delta Pavonis system’s allegiance.<br>Political correspondent Conrad Sterling published an update for Vox Galactica:<br>“In recent years, Yuri Grom has developed a degree of mystique. He was one of the few leaders not to attend the Galactic Summit, and news from within his dominion was scarce. But now he is visibly relishing the opportunity to confront Federal representatives under the protection of diplomatic immunity.”<br>“Initial exchanges were belligerent as both sides argued over who would be the most beneficial partner. This was to be expected since Delta Pavonis is one of the Federation’s founding systems, and it would be a significant coup for EG Union to establish a presence so close to Sol.”<br>“What was unexpected was the mutual respect that gradually developed between Yuri Grom and Ambassador Delphine Dumont. Her charming manner clearly appealed to the dictator, even bringing forth his thunderous laughter on occasion.”<br>“A deal is now being discussed that would allow the Autocracy of Delta Pavonis to have trade and political ties with both parties while remaining independent. Perhaps the Federation has learned some lessons from the recent rebellion, and perhaps Yuri Grom’s hatred of the superpower he once served is finally abating.”"},{"title":"Saud Kruger Seeks New Holiday Worlds","field_galnet_date":"23 SEP 3307","imageList":["NewsImageExpansionExploration"],"field_galnet_body":"*Pilots Federation ALERT*<br>An initiative to gather data on potential tourist destinations has been launched by shipbuilding corporation Saud Kruger.<br>The luxury passenger ship manufacturer aims to identify new Earth-like planets that would be attractive to holidaymakers. These trips will be managed by its subsidiary, Astrogator Tours.<br>CEO Stanislav Kruger announced the campaign to the press:<br>“We are keen to acquire data on Earth-like worlds, to assess their suitability as destinations for future holidaymakers seeking the adventure of a lifetime. However, all exploration data is valuable and will earn generous payments.”<br>“In addition, our marketing department is keen to receive images of eye-catching sights found within unpopulated systems containing Earth-like worlds, to spot the most potentially exciting additions to the Astrogator Tours catalogue.”<br>Vistaenis Incorporated has agreed to organise the initiative on behalf of Saud Kruger. Contributing pilots are invited to deliver exploration data to Youll Port in the Vistaenis system. They can also submit their most compelling images by Thursday the 30th of September. <br>By Thursday the 28th of October, the most suitable locations will receive tourist beacons and credit the Commander for their submission where appropriate.<br>If successful, Saud Kruger’s Dolphin, Orca and Beluga Liner ships will be reduced in price for one week from Friday the 1st of October, with the percentage dependent on the volume of data received. There will also be a discount on the luxury-class cabins used by these crafts to transport VIP passengers."},{"title":"Salvation Takes Credit for Repelling Thargoids","field_galnet_date":"22 SEP 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"The anonymous ‘man of science’ Salvation has claimed responsibility for the Thargoids’ unexplained departure from the Cornsar system.<br>Salvation had predicted their attack, but his claim was discounted by Aegis and other authorities. After a few days the Thargoid vessels fled abruptly, leaving behind wreckages across the system.<br>The following message was transmitted on public channels:<br>“This is Salvation. The Thargoid invasion of Cornsar has now been repulsed, thanks to prototype anti-xeno weaponry that I have been developing for some time. I have achieved what Aegis could not – an effective deterrent against the alien threat.”<br>“Refinement of this weapon is at a critical stage, so I cannot reveal any details. I only regret that my warning was not heeded in time to save everyone on the two starports.”<br>“This triumph was only possible thanks to those loyal pilots who answered my call. Rewards will shortly be available from the Bright Sentinel megaship in the Mbooni system.”<br>Salvation’s identity and capabilities remain unknown, but he has established a reputation as a rival to Aegis. He is also knowledgeable about Azimuth Biochemicals, a research company connected to the earliest recorded encounters with Guardian and Thargoid artefacts."},{"title":"An Heir for Hadrian Duval","field_galnet_date":"21 SEP 3307","imageList":["NewsImageImperialCityscape"],"field_galnet_body":"Lady Astrid Minerva-Duval, wife of Hadrian Augustus Duval, has confirmed that she is expecting a child in December.<br>The story was broken by the Paresa News Network:<br>“Lady Astrid was visibly overjoyed as she told us of her pregnancy, and of Hadrian’s excitement at being a father. Her only complaint was that she’s no longer allowed to fly support missions for Nova Imperium. Once a Commander, always a Commander!”<br>Mainstream media channels also commented on the news.<br>The Imperial Herald: “This has caused tangible ripples of unease in the Senate. Since neither Emperor Arissa Lavigny-Duval nor Princess Aisling Duval have heirs, Hadrian’s claim to the throne will be strengthened if he alone ensures that the Duval bloodline continues.”<br>Eye on Achenar: “Who cares about the spawn of Emperor Hengist’s illegitimate grandson? The NMLA may have assassinated much of the Imperial Family, but this outcast boy is still a footnote in their noble history.”<br>Vox Galactica: “Despite his unofficial status, Hadrian Duval has many silent supporters within the Empire. His isolationist stance appeals to nostalgic citizens, as does returning to the tradition of male Emperors. Should Hadrian have a son, he may feel empowered to seek his birthright more forcefully.” "},{"title":"Thargoids Vanish from Cornsar System","field_galnet_date":"20 SEP 3307","imageList":["NewsImageThargoidIncursion"],"field_galnet_body":"*Pilots Federation ALERT*<br>The Thargoid vessels attacking the Cornsar system have unexpectedly departed from the region.<br>For the last four days, independent pilots and local security forces have been in combat against the alien ships. Although some were destroyed in battle, the remainder have abruptly withdrawn back into hyperspace.<br>The starports Chadwick Port and Ito Market sustained heavy damage during the assault, leaving thousands dead and wounded. Evacuation efforts are still underway to rescue the survivors from both stations.<br>Marshal Noah Sharrow, the ruler of Cornsar, made this statement:<br>“We cannot say why the Thargoids have gone, only that we are grateful they have. I thank all the brave pilots who fought valiantly to defend our people.”<br>Sightings of crashed Thargoid vessels on planetary bodies in the Cornsar system have been confirmed by Aegis observation teams. As yet there are no official explanations."},{"title":"Delta Pavonis Hosts Political Conference","field_galnet_date":"17 SEP 3307","imageList":["NewsImageDiplomacyPressConference"],"field_galnet_body":"Delegations from the Federation and the dictator Yuri Grom are meeting to determine the Delta Pavonis system’s future.<br>Both are on a diplomatic mission to convince its controlling faction to either swear allegiance to Yuri Grom or become a Federal member state. Delta Pavonis was one of the original signatories of the Federal Accord in 2242, but has recently been governed by an independent autocracy.<br>Yuri Grom himself is present, having arrived on the megaship Indomitable. Grom was once a respected admiral in the Federal Navy, before defecting with huge numbers of ships and followers. They established the independent EG Union, which he presides over as a military dictatorship.<br>The rival delegation is led by Ambassador Delphine Dumont of the Federal Diplomatic Corps. They were transported on the Freedom’s Foundation megaship courtesy of Delta Pavonis Galactic Interstellar, which formerly controlled the system. The ambassador invited newsfeeds to witness her initial introduction to Yuri Grom, who seemed slightly taken aback by her warm greeting.<br>Grand Duke Simion Petrescu, ruler of the Autocracy of Delta Pavonis, told attending journalists:<br>“The conference will take place in Kessler City on Reagan’s Legacy, where our distinguished guests will enjoy our famous hospitality. I look forward to learning more about their respective proposals.”<br>This is the first time that the Federation has diplomatically engaged with Yuri Grom. Political observers noted that this tactful approach may be due to several Federal factions recently declaring independence."},{"title":"Thargoid Strike Follows Salvation’s Prediction","field_galnet_date":"16 SEP 3307","imageList":["NewsImageThargoidIncursion"],"field_galnet_body":"*Pilots Federation ALERT*<br>The Cornsar system has been attacked by Thargoid forces, causing severe damage to two starports.<br>Direct assaults against Chadwick Port and Ito Market stations have resulted in over ten thousand casualties. Local reports state that Thargoid vessels have also appeared elsewhere throughout the system, placing millions more lives at risk.<br>The anonymous figure known as Salvation recently warned that Cornsar was in imminent danger of being invaded, having been alerted by his new xeno-detection network. Aegis could not verify Salvation’s claim and saw no evidence of any Thargoid presence.<br>The system’s ruler, Marshal Noah Sharrow of the Allied Cornsar Constitution Party, transmitted this message:<br>“This is a call to any pilots in the vicinity of Cornsar. We urgently need ships to defend our people from the Thargoids, and to rescue civilians trapped within Chadwick Port and Ito Market. This is a grave emergency!”<br>Aegis has released a brief statement:<br>“We can confirm there is a Thargoid presence in the Cornsar system. Unfortunately most of our operations and personnel remain suspended due to the public inquiry, so we cannot contribute to any anti-xeno efforts.”<br>There has been no further communication from Salvation, despite his accurate prediction of the attack."},{"title":"Pharma Giant Victorious in the Haithis System","field_galnet_date":"16 SEP 3307","imageList":["NewsImageTrade"],"field_galnet_body":"*Pilots Federation ALERT*<br>The Haithis Purple Dynamic Group has fought off the Kumo Council assault, securing the completion of Neomedical Industries’ onionhead project. <br>The pharmaceutical corporation had received deliveries to Haithis to begin producing onionhead gamma strain for medicinal purposes. In response, the Kumo Crew syndicate attacked Neomedical’s corporate partner but failed to achieve its objectives.<br>Neomedical Industries confirmed that investment in its project to mass-produce onionhead gamma strain has increased following the conflict’s resolution. The news was eagerly received in many Alliance and independent systems, which have expressed interest in the new healthcare treatment.<br>Olwyn Kendrick, CEO of Neomedical Industries, told the media:<br>“We owe a huge debt to the galactic community for defending our operation. Large-scale manufacture of onionhead gamma strain can now commence. We will soon be able to improve the quality of life for millions of people.”<br>The Haithis Purple Dynamic Group is offering rewards to its supporters from Crippen Port in the Haithis system.<br>"},{"title":"Salvation Warns of Thargoid Strike","field_galnet_date":"14 SEP 3307","imageList":["NewsImageStation"],"field_galnet_body":"The anonymous figure known as Salvation claims that Thargoid forces will shortly launch an assault in the Cornsar system.<br>The following message was received by all major newsfeeds:<br>“This is Salvation. Authorities in the Cornsar system must evacuate the local population immediately. I believe a Thargoid invasion of the system is imminent.”<br>“I became aware of this danger while developing a new interstellar xeno-detection network, which will be far superior to Eagle Eye. Although the network is not fully complete, we cannot dismiss this report as a false reading. Cornsar must act now.”<br>Carter Armstrong, a chief administrator with Aegis, delivered an official statement:<br>“Aegis cannot validate this claim. There is no indication of a Thargoid presence in the vicinity, and Cornsar is too far from their known territories to be a viable target. As most of our operations are suspended due to the public inquiry, we cannot dedicate any resources to investigate further.”<br>There was also a response from Marshal Noah Sharrow, who governs the Cornsar system on behalf of the Allied Cornsar Constitution Party:<br>“We have no interest in the games of one-upmanship between Aegis and Salvation. Nor do we believe for a moment that the Thargoids would go out of their way to harass us.”"},{"title":"Rebellion Spreads Through the Federation","field_galnet_date":"13 SEP 3307","imageList":["NewsImageRebellionFederation"],"field_galnet_body":"A further seven Federal factions have severed ties with the superpower in protest against government monitoring of communications.<br>These latest secessions have been undertaken by minor factions that do not control any systems, including Unktock Free, United Posenoi League and Progressive Party of Inggale.<br>Political journalist Sofia Trevino reported for The Federal Times:<br>“Eight factions had previously declared independence from the Federation, and now an even greater number forms the third wave of rebellion. It’s clear that their populations feel empowered to take a stand against losing their constitutional rights of privacy.”<br>“Vice President Archer shrugged off this latest development, maintaining that ‘the Proactive Detection Bureau performs a vital security role in these troubled times’. Since none of these latest factions currently govern a system, he may also believe that resistance to the PDB is on the wane.”<br>“Although these events have only impacted a small part of Federal territory, they remain an embarrassment for President Hudson’s administration. Shadow President Winters continues to implore Congress to repeal the Domestic Counter-Terrorism Act, but she has also taken political criticism since many feel her rhetoric inspired these factions to secede.”"},{"title":"Empire Marks Anniversary of NMLA Attacks","field_galnet_date":"10 SEP 3307","imageList":["NewsImageImperialCityscape"],"field_galnet_body":"A day of mourning has been declared across the Empire to mark the first anniversary of the NMLA’s Imperial starport bombings.<br>On Thursday the 10th of September 3306, Imperial stations in the Cemiess, Gabjaujis, LHS 4031 and Rabh systems were attacked without warning. Over sixty thousand people were killed and twice as many wounded by powerful explosives that delivered a caustic enzyme payload.<br>The Neo-Marlinist Liberation Army is an extremist paramilitary group that is dedicated to reforming Marlin Duval’s original republican government. Prior to these bombings, it had only performed minor strikes with low casualties.<br>The NMLA’s terror campaign grew to encompass all three superpowers with the Nine Martyrs attacks in March 3307. It also led to supporters of Marlinism fleeing from the Empire as refugees, eventually resettling in the Marlinist Colonies.<br>Princess Aisling Duval paid respects to the victims during a memorial ceremony at her palace on Emerald. She also spoke of her father Prince Harold Duval, who was assassinated by the NMLA shortly after the bombings.<br>Messages of condolence have been sent by President Zachary Hudson, Prime Minister Edmund Mahon, Imperator Hadrian Augustus Duval and First Minister Octavia Volkov. All vowed to continue contributing resources to ACT, which recently shut down many terrorist cells. Coupled with the loss of its political wing, the NMLA threat may finally be diminishing.<br>"},{"title":"Archon Delaine Retaliates Against Pharma Giant","field_galnet_date":"09 SEP 3307","imageList":["NewsImageAnarchyPiracySmallScaleCombat"],"field_galnet_body":"*Pilots Federation ALERT*<br>The Kumo Council has declared war on the Haithis Purple Dynamic Group for the latter’s role in supporting Neomedical Industries.<br>The pharmaceutical corporation’s recent campaign in the Haithis system enabled the mass production of onionhead gamma strain, scheduled to be available as a medicinal product from Alliance and independent markets. The drug is currently distributed in a handful of anarchy systems by the Kumo Crew syndicate.<br>As hostilities erupted in the Haithis system, Archon Delaine broadcast a message for Neomedical Industries:<br>“Did you truly believe you could steal from us and survive unscathed? Now your allies will pay for your greed with their blood.”<br>In response, CEO Olwyn Kendrick broadcast a call for help:<br>“This terrifying attack by the galaxy’s most vicious pirates may pressure investors to withdraw, causing the entire project to collapse. If so, the vital materials that pilots delivered will be wasted. To prevent this, we urgently require support for our corporate partners against these criminals.”<br>The Haithis Purple Dynamic Group is offering rewards to pilots who help protect its ships against pirate assault. The Kumo Council has also offered to reimburse mercenaries who fight on their behalf."},{"title":"Neomedical Industries Onionhead Campaign Concludes","field_galnet_date":"09 SEP 3307","imageList":["NewsImageOnionHead"],"field_galnet_body":"*Pilots Federation ALERT*<br>The pharmaceutical megacorp has received sufficient materials to produce onionhead gamma strain as a medical treatment.<br>Pilots delivered shipments of H.E. suits, polymers and robotics to Crippen Port in the Haithis system. Payment for these deliveries is now available at the starport from the pharma giant’s corporate partner, Haithis Purple Dynamic Group.<br>Bounty vouchers were also offered for all wanted ships, in expectation of pirate attacks coordinated by the Kumo Crew syndicate. Their megaship remains in the Haithis system, which has raised concerns about further retaliation from Archon Delaine.<br>An announcement was made by Olwyn Kendrick, CEO of Neomedical Industries:<br>“Thanks to the sterling contributions, it looks like we are on track to roll out the medically certified strain of onionhead to approximately 15% of all independent systems and Alliance systems  for the 17th of September 3307. It will soon be viewed as a vital healthcare product for millions of people rather than a notorious narcotic.”<br>There has been some criticism of the Alliance, especially from Federal and Imperial quarters, for allowing the popular psychedelic drug to be sold legally. However, the Assembly reiterated that most Alliance trading laws are enforced on a system by system basis, and that the deal is only there because of the firm assurances and underwriting made by Neomedical Industries.<br>"},{"title":"Mahon: Sirius Treaty Would Save Aegis","field_galnet_date":"07 SEP 3307","imageList":["NewsImagePressConferenceAlliance"],"field_galnet_body":"Prime Minister Edmund Mahon has commented on the Aegis inquiry and his failed proposal to unify anti-xeno operations.<br>As part of an interview with The Alliance Tribune, he said:<br>“The greatest regret of my career is that I was unable to formalise the Sirius Treaty at the Galactic Summit. This would have revolutionised Aegis by providing the commitment and resources it deserves, sparing it the indignity of a public inquiry.”<br>“The Nine Martyrs attacks prevented that historic occasion, of course, but the Sirius Treaty itself remains viable. I’d be happy to ratify it on behalf of the Alliance if we can convince the other signatories that defending humanity from the Thargoid threat should be our utmost priority.”<br>Investigators continue to gather information regarding Aegis’s operations. There have been further resignations of key staff, and financial records are being independently audited.<br>Dr Paul Baumann, chair of the board of inquiry, confirmed that charges of criminal negligence could be brought against key figures within Aegis given sufficient evidence. However, there is uncertainty as to which court would deal with legal proceedings for a tri-superpower organisation."},{"title":"ACT Scores Victories Against the NMLA","field_galnet_date":"06 SEP 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"The Affiliated Counter-Terrorism unit has reported progress in its efforts to eliminate the Neo-Marlinist Liberation Army.<br>Captain Milo Castile, one of ACT’s joint leaders, told a press briefing:<br>“The recent civil war in the Marlinist Colonies was a tragedy, of course. But many pro-NMLA individuals were exposed during the conflict. Minister Jean-Christophe Lyon, the newly elected leader of the Marlinism Reformation Party, has cooperated fully in rooting out extremists from his faction.”<br>“As a result, our agents have successfully raided dozens of NMLA cells and arrested several thousand paramilitary activists. We also acquired intelligence leading to hidden assets in multiple systems.”<br>“I can confirm that Theta Seven – as the NMLA’s de facto leader calls himself – personally directed the Marlinist starport attacks. Unfortunately, we have yet to confirm Theta Group’s current whereabouts. The threat of further bombings cannot be ruled out.”<br>“The NMLA has also been seriously impacted by the death of Aaron Whyte and the failure to elect a Neo-Marlinist prime consul. Without the legitimacy of a political wing, I believe the terrorists will find it much harder to recruit new allies.”<br>"},{"title":"Hyford’s Cache Reveals Mysterious Project","field_galnet_date":"31 AUG 3307","imageList":["NewsImageSidewinderExploring"],"field_galnet_body":"*Pilots Federation ALERT*<br>A data bank left by a crashed vessel on the moon Colonia 5 e a has reactivated, revealing clues as to its origin.<br>The crash site was first discovered over four years ago via listening posts in the Colonia, Neche and Wasat systems. These posts held transmissions from the ship’s owner, Commander Hyford, discussing his attempts to avoid members of a private military outfit he had previously worked for.<br>This latest development was discussed by Erik Gunnarson of the Wallglass Investigations Agency:<br>“Commander Hyford spoke of making deliveries to a nameless organisation in the Pleiades, and left a data cache in the Colonia system that provided further details. Hyford’s Cache, as some investigators referred to it, had remained locked until a manually-set timer system finally expired last week. The information within has apparently directed pilots to investigate the HIP 26176 system.”<br>“It’s possible that Kit Fowler’s recent theories regarding Black Flight – another old mystery – might prove relevant after all. But there are bigger questions that need answering. Who was Hyford working for? Were they responsible for causing his ship to crash? And if so, what secrets were they trying to keep?”"},{"title":"Corporation Plans Onionhead Medical Product","field_galnet_date":"30 AUG 3307","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"The pharmaceutical giant Neomedical Industries aims to mass-produce onionhead gamma strain as a medicine.<br>The announcement follows a report from the Interstellar Health Organisation, which details how the new onionhead variant is an effective treatment for many psychological and musculoskeletal conditions.<br>Olwyn Kendrick, CEO of Neomedical Industries, told the media:<br>“The IHO has confirmed the findings of our research of onionhead gamma strain’s use for specific medical purposes. Clinical trials prove that its psychedelic qualities are no more intense than the side effects of conventional neuroleptics.”<br>“It is inappropriate that a crime syndicate should provide a product that can relieve the suffering of millions. Therefore, we aim to build our own stockpile to expedite its distribution to common markets.”<br>This statement was viewed as controversial in some quarters, particularly within the Federation. However, there have been expressions of interest from many independent factions. The Kumo Crew syndicate, which manufactures and distributes onionhead gamma strain, has offered no response as yet.<br>Neomedical Industries is one of the two largest pharmaceutical companies in the galaxy, alongside Vandermeer Corporation. It provides healthcare services and equipment exclusively to Alliance and independent systems."},{"title":"Marlinists Regroup in Civil War Aftermath","field_galnet_date":"27 AUG 3307","imageList":["NewsImageDeathGeneric"],"field_galnet_body":"The Marlinist Colonies are recovering from a period of political infighting and inter-faction conflict.<br>Octavia Volkov has been voted in as the new first minister following a snap election. Her decisive action against Aaron Whyte’s Neo-Marlinist movement, which led to the elimination of the NMLA’s political wing, drew huge support from voters.<br>In a parliamentary address, First Minister Volkov said:<br>“We must focus on building an independent society rather than changing the Empire. In time we will evolve into the fully-fledged Marlinist Republic we have fought so hard for, and perhaps inspire our Imperial cousins to walk the path to democracy.”<br>Marlinist factions now control all eight of their original colony systems, some of which had temporarily fallen under external governance. They have also expanded into a handful of new systems.<br>Prime Consul Kayode Tau, the chief ambassador of the Marlinists, has established formal channels with the Alliance Office of Diplomatic Relations and the Federal Diplomatic Corps. The Empire recognises the Marlinist Consulate, but maintains a distant relationship with what many consider to be subversive ex-Imperials.<br>The ceremonial funeral of First Minister Jenna Fairfax has taken place. Speakers drew attention to her achievements and leadership qualities. In a gesture that many viewed as an olive branch from the Empire, Princess Aisling Duval attended virtually and spoke of her meeting with Fairfax during the Galactic Summit."},{"title":"Mining Campaign Success for Zemina Torval ","field_galnet_date":"26 AUG 3307","imageList":["NewsImagePressConferenceImperial"],"field_galnet_body":"*Pilots Federation ALERT*<br>The Torval-Mastopolos Mining initiative in the LTT 198 system has outperformed Wreaken Construction’s rival campaign.<br>Pilots delivered mined resources to the megaships Pride of Bitterwood and Tobias’s Gift to support the competing corporations. Ultimately, it was the new subsidiary of Mastopolos Mining that received the greatest quantities.<br>Senator Zemina Torval provided a statement to Imperial media:<br>“This is an auspicious beginning for my new enterprise. I am pleased to offer rewards to my supporters at the Pride of Bitterwood in the EGM 559 system.” <br>In addition to credits, the top 75% of Torval’s supporters will be provided with an experimental mining laser and permanent permit access to LTT 198.<br>Constantia Torval, one of the senator’s daughters, has assumed the role of director of operations with Torval-Mastopolos Mining. There has been no comment from the Mastopolos family regarding the subsidiary, which is being run autonomously by Zemina Torval.<br>CEO Emmerich Koenig confirmed that Wreaken Construction will soon withdraw from LTT 198. Pilots who supported its efforts can now claim reimbursement from Tobias’s Gift in the EGM 559 system. The top 10% of Koenig’s supporters will receive an experimental abrasion blaster as well.<br>LTT 198 State Ltd has reinstated permit control for entry to the LTT 198 system. A new starport will shortly be constructed and administered by Torval-Mastopolos Mining.<br>"},{"title":"Onionhead’s Medical Benefits Verified","field_galnet_date":"24 AUG 3307","imageList":["NewsImageArrivingShip"],"field_galnet_body":"The Interstellar Health Organisation has validated the Kumo Crew’s claim that onionhead gamma strain, also known as ‘helix’, has medicinal properties.<br>Dr Nisha Devi, one of the IHO’s senior researchers, told the media:<br>“We have analysed user data in the independent systems where onionhead gamma strain is on sale. Unexpectedly, the initial marketing claims that ‘helix’ can be used for medicinal purposes have been authenticated.”<br>“A significant percentage of customers are believed to be using the drug for healthcare reasons rather than recreational use. Reports show that it is a successful treatment for many psychological disorders, bringing faster results than conventional neuroleptics. It may also provide effective symptomatic relief for patients with musculoskeletal conditions.”<br>“Several research facilities are now running clinical trials on the viability of using onionhead gamma strain in medical practice. The IHO is monitoring these studies and will publish the results.”<br>Vandermeer Corporation, the largest pharmaceutical company in the Federation, published a statement from its head of marketing Ronan Roscoe:<br>“These conclusions are biased and informed by inaccurate data. We maintain that all forms of onionhead are dangerous narcotics with long-term detriments to health. Vandermeer’s antipsychotic treatments are effective without the side effects of mild psychedelic experiences.”<br>"},{"title":"A Fractured Federation","field_galnet_date":"23 AUG 3307","imageList":["NewsImageRebellionFederation"],"field_galnet_body":"Shadow President Felicia Winters has claimed that further systems declaring independence could severely damage the Federation.<br>Her statement was in response to the conflict in the Kuwembaa system, which resulted in more Federal factions seceding from the superpower. Dozens of others are now openly considering breaking away and becoming independent.<br>Addressing Congress, Shadow President Winters said:<br>“We now face the possibility of large-scale rebellion, as more citizens reject intrusion into their private lives. Unless these authoritarian surveillance laws are repealed, we risk many more factions and allies losing their trust in any Federal government.”<br>Vice President Jerome Archer responded:<br>“The Proactive Detection Bureau provides increased security and decreased crime levels for all Federal systems. I deeply regret that a few have rejected its benefits, but we must concentrate on the bigger picture.”<br>The Sovereign newsfeed described how the newly seceded systems are celebrating freedom from government scrutiny. It claims that up to fifty other factions have expressed interest in becoming independent.<br>However, The Federal Times reported that more pragmatic leaders have voiced concerns that they are now more vulnerable. There are particular fears of retaliation by pro-Federation groups or attacks from opportunistic hostile forces."},{"title":"Conspiracy Theorist Finds Network Home","field_galnet_date":"20 AUG 3307","imageList":["NewsImageOutpost"],"field_galnet_body":"Independent journalist Flint ‘Firemaker’ Lafosse has announced that the Rewired network will broadcast Kit Fowler’s conspiracy-laden show End Times.<br>Lafosse, notorious for his own sensationalist claims, announced:<br>“Finally, someone else who sees things as they really are! Kit Fowler’s perceptive views match his technical genius. By retransmitting his End Times broadcasts, I’ll be helping people resist the narrative conditioning being pumped into our minds by the faceless elite.”<br>Kit Fowler provides specialised engineering services from his workshop in the Capoya system. He has used his show to make many outlandish claims over the years. These include labelling the shadowy figure ‘Salvation’ an AI construct, accusing Utopia of secretly creating a new species of human, and arguing that the universe’s true shape is being concealed by superpower-sponsored holograms.<br>Lafosse advertised Fowler’s content with an excerpt from the most recent End Times episode:<br>“Years ago, a sinister group called Black Flight committed multiple crimes, including murder, to suppress evidence of Thargoid activity after the First War. The mainstream newsfeeds buried the story, of course. But the fearless truth-seekers among us have repeatedly named the Colonia, Neche and Wasat systems as locations where the Black Flight operated.”<br>“There’s a real buzz in that region right now… something’s going on that they don’t want you to know about. Never give up our search for the right facts, people!”"},{"title":"Anti-NMLA Forces Win Marlinist Civil War ","field_galnet_date":"19 AUG 3307","imageList":["NewsImagePoliticalRally"],"field_galnet_body":"*Pilots Federation ALERT*<br>The conflict in the Hyades Sector RO-P b6-2 system has been won by the Exiled Marlinist Assembly of Baltah'Sine.<br>Support from independent pilots played a key role in defeating the Marlinism Reformation Party. The faction’s entire leadership has been arrested, with their replacements vowing to reshape it along politically moderate lines.<br>Minister Octavia Volkov made a declaration of victory to the Marlinist Parliament:<br>“The Neo-Marlinists have been crushed and Aaron Whyte is dead – a casualty of the war his terrorist paymasters began. I deeply regret that our society has suffered this, but have no regrets at destroying the NMLA’s political wing once and for all.”<br>Prime Consul Kayode Tau sent assurances to the Alliance, Empire and Federation that they should view this as “confirmation that the Marlinist Colonies are your steadfast allies in the fight against the NMLA”.<br>ACT has drafted in extra resources to investigate the Marlinism Reformation Party’s ties to Theta Group, the terrorist bomb-makers responsible for last month’s devastating starport attacks.<br>With First Minister Jenna Fairfax confirmed as among the fatalities, Acting First Minister Amrita Ross has organised a snap election to democratically appoint a new leader for the Marlinist Colonies."},{"title":"LTT 198 Hosts Competing Mining Campaigns ","field_galnet_date":"19 AUG 3307","imageList":["NewsImageGoldRushMining"],"field_galnet_body":"*Pilots Federation ALERT*<br>Torval-Mastopolos Mining and Wreaken Construction have requested deliveries of mined resources to the LTT 198 system.<br>LTT 198 State Ltd, its controlling faction, will only allow one of the rival corporations to remain permanently. The company with the most successful campaign will establish a new starport in the permit-controlled system.<br>Senator Zemina Torval, who has sole control of the Mastopolos Mining subsidiary, announced:<br>“My company is working on an experimental mining laser with increased range. To achieve this, shipments of mined resources must be delivered in sufficient numbers to the Pride of Bitterwood megaship in LTT 198.”<br>Emmerich Koenig, CEO of Wreaken Construction, outlined a counter-initiative:<br>“We will pay handsomely for deliveries of mined resources to the megaship Tobias’s Gift in the LTT 198 system.”<br>Both factions have requested units of coltan, gallite, praseodymium and silver.<br>LTT 198 State Ltd will provide all contributors to these initiatives with temporary system permits lasting one week. "},{"title":"Leaked Report Exposes Aegis Failures","field_galnet_date":"17 AUG 3307","imageList":["NewsImageStation"],"field_galnet_body":"The Aegis board of inquiry’s initial findings have been leaked to journalists, with several problems within the anti-xeno organisation detailed in the files.<br>Vox Galactica journalist Alexei Keel reported on its contents:<br>“The independent inquiry into Aegis is in its early stages, making this disclosure of delicate information all the more embarrassing. Although only a summary, it highlights shortcomings that were immediately apparent to the investigators.”<br>“The leaked files outline a pattern of poor internal organisation and negligence. One claim is that Aegis accepted its heavy reliance on independent pilots entering combat situations against the Thargoids.” <br>“A lack of technological breakthroughs since the first generation of AX weaponry is also criticised. Professor Tesreau, who has since resigned, is singled out for prioritising communication with the Thargoids rather than developing quickly deployed defences.”<br>“Interview transcripts show that some Aegis personnel consider the inquiry itself to be part of a larger agenda. A recurring claim is that the superpowers directly contributed to Aegis’s inefficiency by reducing funding, and are now scapegoating Aegis management for a lack of progress.”<br>“Dr Paul Baumann, chair of the board of inquiry, said that only the final report should be considered official. It is unclear when the ‘Baumann Report’, as some newsfeeds refer to it, might be ready for publication.”"},{"title":"Rival Corporations Compete in LTT 198 ","field_galnet_date":"16 AUG 3307","imageList":["NewsImageAdderMining"],"field_galnet_body":"Torval-Mastopolos Mining and Wreaken Construction have both established a presence in the LTT 198 system.<br>Marlon Royce, business analyst for Vox Galactica, reviewed the situation:<br>“It is highly unusual for two megacorps to set up new headquarters in the same place. But Mastopolos Mining and Wreaken Construction have always competed aggressively for mining and transportation contracts, so it seems a new chapter in their rivalry has begun.”<br>“This permit-locked system is controlled by the independent faction LTT 198 State Ltd. Insiders claim that it demanded a fortune from both corporations in return for granting passage to its ships and allowing construction of industrial complexes on the planet Dini.”<br>“This is the first significant move from Senator Zemina Torval’s new company, an autonomous offshoot of Mastopolos Mining. It may be that Wreaken Construction’s presence is an effort to crush their old enemy before she can acquire further corporate strength.”<br>The Imperial Herald reported that Constantia Torval, one of Zemina Torval’s daughters, has travelled from the Synteini system to LTT 198. It is believed Constantia has taken command of Torval-Mastopolos Mining’s operations."},{"title":"Onionhead Legality Sparks Debate","field_galnet_date":"13 AUG 3307","imageList":["NewsImageOnionHead"],"field_galnet_body":"The introduction of onionhead gamma strain by the Kumo Crew has reignited long-running arguments around the popular psychedelic drug.<br>An interview with Zander Lachance, spokesperson for the Coalition for Legalisation, was published by Vox Galactica:<br>“I have yet to see evidence that onionhead is more harmful than common recreational substances. Open-minded people in independent systems are now discovering this for themselves.”<br>In response, other newsfeeds featured a range of opinions.<br>Eye on Achenar: “Foppish rogues of the Federation such as Zachary Rackham and Sir Randolph Plaskett may feel comfortable wooing trade tycoons with the outlawed weed, but legalising low-cost onionhead would risk the whole Empire collapsing into a stupor!”<br>The Pegasi Sentinel: “The popularity of ‘helix’ is steadily growing, and the revenue it generates will undoubtedly benefit those fortunate to live within Archon Delaine’s dominion.”<br>Sol Today: “Imperial hedonists such as Senator Leatrix and Duchess Rouncival may offer such illicit treats at their decadent parties, but bombarding the masses with this cheap narcotic will have the entire Federation chasing unicorns!”<br>The Sovereign: “Tourists from many independent worlds are booking holidays to the Alici, Baraswar, Kishpakho, Nastrond and Nocori systems, where the gamma strain of onionhead is legal. There is no shortage of Alliance citizens following suit, which may pressure the Assembly to formally legislate one way or the other.”"},{"title":"Marlinist Civil War Declared","field_galnet_date":"12 AUG 3307","imageList":["NewsImageDiplomacyPressConference"],"field_galnet_body":"*Pilots Federation ALERT*<br>Conflict has erupted in the Hyades Sector RO-P b6-2 system between two factions of the Marlinist Colonies.<br>The Exiled Marlinist Assembly of Baltah'Sine has declared war against the Marlinism Reformation Party, which acts as the political wing of the NMLA.<br>Political relations degenerated into open combat following the NMLA’s recent attacks, with Acting First Minister Amrita Ross’s efforts to negotiate a peaceful resolution proving unsuccessful. <br>A new megaship, Freedom’s Voice, has entered service. It is acting as the operational base for the forces of the Exiled Marlinist Assembly of Baltah'Sine. <br>Supporters of the Marlinism Reformation Party are gathering at the Steel Majesty megaship. This was formerly used by the Neo-Marlinist Order of Mudhrid to flee from their home system.<br>Minister Octavia Volkov announced in parliament: <br>“Aaron Whyte and his collaborators are directly responsible for tens of thousands of deaths. I will not rest until they are defeated and brought to justice.”<br>Minister Aaron Whyte sent this response from his private vessel:<br>“Volkov’s unlawful strike is a violation of our colonies’ charter. We call upon all true Marlinists to defend us from this illegal act of aggression.”<br>The Alliance, Empire and Federation have informed the Marlinist Consulate that they consider this conflict to be a strictly internal matter.<br>"}]