[{"title":"Caine-Massey Victorious in Corporate Conflict","field_galnet_date":"13 APR 3309","imageList":["NewsImageRebellionEmpire"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Fierce combat in the Tavgi system has resulted in Caine-Massey’s partner Tavgi Blue Life Inc overcoming Torval Mining Ltd resistance.<br>The conflict was triggered by the murder of Caine-Massey’s former CEO Johann Fleischer. The assassin was tracked from Mars to the Torval Mining megaship Orchestral Falcon. Circumstantial evidence suggested he was an undercover Imperial agent.<br>Philippa Barlow-Lyons, acting CEO of the Caine-Massey corporation, declared:<br>“Largely thanks to tremendous support from Federal auxiliaries, the path was cleared for us to take control of the Orchestral Falcon megaship. Only then did Torval Mining Ltd agree to hand over Johann’s killer, rather than risk the loss of its precious vessel. A security team has now delivered him to Federal authorities, where I am sure we will see justice finally served.”<br>The Federal Intelligence Agency provided an update to the media from Executive Agent Viola Trask:<br>“The man in our custody has been formally arrested and charged with the homicide of Johann Fleischer. All known IDs associated with him are false. Along with the skills he displayed, this suggests that he is a professional assassin. We are working with the Proactive Detection Bureau and the Federal Navy Intelligence Office to broaden the scope of this investigation.”<br>Independent pilots who fought on behalf of Tavgi Blue Life Inc during the conflict can collect their rewards from Gordon Enterprise. Despite its defeat, Torval Mining Ltd has also agreed to reimburse its supporters from the Orchestral Falcon."},{"title":"Salvation-Utopia Link Raises Concerns","field_galnet_date":"10 APR 3309","imageList":["NewsImageTouristStation"],"field_galnet_body":"Similarities between the Nemesis Failsafe and Utopia’s Sim-Archive have led to questions being asked about a possible connection.<br>Independent journalist Flint ‘Firemaker’ Lafosse reported on Seo Jin-ae’s recent discoveries:<br>“We all knew that Salvation had a messiah complex, so it’s no surprise that he planned to keep his colossal ego alive after his ancient body died. We also know that Pranav Antal has been digitising his followers’ brains for years.”<br>“My question is: did Salvation modify Antal’s system for his own private use, rather than reverse-engineer Guardian technology? Or maybe Azimuth and Utopia were secretly working together all this time, and the Sim-Archive has always been Guardian-based? It would explain how Utopia is able to maintain funding for its little tech-bohemian commune.”<br>This theory was critiqued by The Federal Times’s technology correspondent Harlow Nassry:<br>“It is a fact that most of Utopia’s scientific development remains opaque. But the few inventions that have been examined – such as the nanomedicines acquired by Vitadyne Labs – contain no molecular markers of Guardian origin. The Sim-Archive’s memory-recording techniques are based on exoneurological research conducted over hundreds of years.”<br>Dr Maximo Fonseca, the Alliance’s scientific liaison to Aegis, gave a statement to the media:<br>“Since successful applications in this field are so rare, we cannot ignore the potential relation between the Nemesis Failsafe designs and the Sim-Archive. I have made contact with Simguru Pranav Antal and explained the situation. He kindly invited me and my staff to visit Utopia and discuss the matter. Our findings will determine whether a formal investigation into Salvation’s current status is warranted.”"},{"title":"Corporate Battle Erupts in Tavgi System","field_galnet_date":"06 APR 3309","imageList":["NewsImageWar"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The killing of Caine-Massey’s CEO has sparked conflict between the Federal corporation and Imperial rival Torval Mining Ltd.<br>Acting CEO Philippa Barlow-Lyons provided a statement regarding the hostilities:<br>“The Federal Intelligence Agency tracked Johann Fleischer’s assassin from Mars to the Tavgi system, whereupon he boarded the Orchestral Falcon, one of Torval Mining’s megaships. We demanded that he be handed over to stand trial for his crime. They refused to even acknowledge us. Zemina Torval thinks she has taken her revenge and got away with it. She is wrong.” <br>“Caine-Massey has instructed Tavgi Blue Life Inc, our business partner in the system, to board the Orchestral Falcon – by force, if necessary – and apprehend the suspect. We will do whatever it takes to arrest the Imperial Intelligence agent we hold responsible for murdering a captain of Federal industry.”<br>A response was issued by Senator Zemina Torval:<br>“Caine-Massey is using its CEO’s death to excuse a deliberate strike against my company, damaging our share price and testing the will of our political connections. Torval Mining Ltd will defend its property, as well as the honour of the Empire, against this unjustified assault.”<br>To support their combat operations, Tavgi Blue Life Inc and Torval Mining Ltd have called upon Federal and Imperial naval auxiliaries to report to Gordon Enterprise and the Orchestral Falcon respectively. <br>The conflict has heightened political tensions between the Empire and the Federation. With the majority of superpower naval forces deployed to the Thargoid front line, system authority vessels around Tavgi have been placed on alert. <br>President Zachary Hudson was quick to comment that “my administration upholds the right for our factions to seek justice”. Senator Denton Patreus stated: “The Empire stands ready to shield its citizens, businesses and territories from attacks by foreign powers, xeno or otherwise.”"},{"title":"Archer Launches Presidential Campaign","field_galnet_date":"05 APR 3309","imageList":["NewsImageFederalCityscape"],"field_galnet_body":"The Republican Party has nominated Vice President Jerome Archer as its candidate in the upcoming Federal election.<br>Jerome Archer was formerly the secretary of security in President Zachary Hudson’s cabinet. He was promoted to vice president when his predecessor died during the Nine Martyrs attacks in 3307. He immediately proposed the Domestic Counter-Terrorism Act, which authorised the Proactive Detection Bureau to monitor all civilian communications in the Federation to detect future terrorist activity.<br>Vice President Archer began his election campaign at a political rally on Nanomam 2, where he announced:<br>“Throughout my career, my priority has always been the same: keeping people safe. From my days as a cop on the streets of Nueva Vista to director of the Federal Intelligence Agency, I have worked hard to increase security for all citizens. I pledge to work even harder and achieve far more as your president.”<br>“President Hudson’s excellent legacy regarding anti-xeno operations will continue under my leadership. We will increase our defensive capabilities to protect the Federation against any kind of external or internal threat.”<br>The newsfeed Sol Today was supportive of the Republican Party’s candidate, referring to Archer as “the only sensible choice in this era of war and moral corruption”. By contrast, an editorial in the Federal Free Press stated: “Privacy will become history if the eavesdropper-in-chief is handed the reins of power.”<br>Archer’s running mate in the election is Congressman Niko Shirakawa , who represents the Eta Cassiopeiae system. A former major in the Federal Marine Corp, he sits on several intelligence committees and is known to have military connections."},{"title":"‘Imperial Assassin’ Stokes Superpower Tensions","field_galnet_date":"04 APR 3309","imageList":["CommunityNewsFeed_2"],"field_galnet_body":"Federal mining corporation Caine-Massey has accused Senator Zemina Torval of assassinating its CEO Johann Fleischer.<br>An update from the Federal Intelligence Agency prompted a remarkable declaration from Philippa Barlow-Lyons, the company’s acting CEO:<br>“Thanks to the FIA’s assembled security footage, we now know that the man who murdered Johann Fleischer departed from Olympus Village Spaceport using a false Federal ID. He then transferred to the Tavgi system under another alias, claiming to be a prospector for Torval Mining Ltd. And so, the trail leads directly to the culprit.”<br>“It is very clear that Zemina Torval ordered Johann’s death as an act of revenge, after he defeated her efforts in January 3308 to obtain one of Caine-Massey’s most lucrative mining contracts. Analysis of the hitman’s weapon and other equipment matches those typically used by Imperial Intelligence. And who is a senior officer in that ruthless spy network? Zemina’s own grandson, Titus Torval.”<br>Senator Torval has not acknowledged or responded to the accusation. A formal statement was delivered directly to Congress by the Imperial Senate:<br>“We categorically reject the suggestion that any members of this august body, or of Imperial Intelligence, are connected to these events. The Empire no longer has any political or commercial involvement with the Federation, and remains focused on its extensive anti-xeno operations.”<br>President Zachary Hudson publicly assured Caine-Massey, which is known to be a long-standing corporate donor to the Republican Party, that further resources will be directed to the investigation. He added: <br>“This is a timely reminder that all citizens should be vigilant against the enemy within. If we discover that Imperial assassins and sleeper agents are responsible for this heinous crime, the Empire will be expected to act in a manner we find satisfactory.”"},{"title":"Nemesis Failsafe: Fact or Fiction?","field_galnet_date":"03 APR 3309","imageList":["NewsImageGraph"],"field_galnet_body":"Azimuth Biotech has rejected Seo Jin-ae’s unverified claim that Salvation survived by relocating his mind using advanced Guardian technology.<br>CEO Torben Rademaker issued this statement:<br>“I can officially confirm that Azimuth Biotech has no knowledge of any project related to a ‘Nemesis Failsafe’. Frankly, suggesting that anyone could transmit their living mind across space stretches her credibility past breaking point.”<br>“Seo Jin-ae’s absurd outbursts have justified our fears that she suffers from paranoid delusions, and has falsified data to support her personal vendetta. And she now seems to have an exalted position among the Far God cultists. Only those deranged unfortunates would take her flights of fantasy seriously.”<br>An article in the scientific journal The Empirical addressed the concepts featured in Seo Jin-ae’s statement:<br>“The field of exoneurology, whereby the human mind is isolated from the neuronal network and transferred to an artificial host, is mostly comprised of failed experiments. Only the Utopia commune has ever claimed significant success. Their Sim-Archive allegedly duplicates an individual’s memory engrams and uploads them to a sophisticated digital emulation program. But independent reviews of this technology have been prevented by the reclusive nature of Utopian society.”"},{"title":"Caine-Massey CEO Assassinated","field_galnet_date":"31 MAR 3309","imageList":["NewsImageStation"],"field_galnet_body":"Johann Fleischer, the recently appointed head of the mining corporation Caine-Massey, has been shot and killed on Mars.<br>Fleischer was attending a Federal Commerce Authority seminar at the Olympus Village Conference Centre. He was targeted in the audience by long-range plasma fire that proved immediately fatal. Security forces were unable to locate the shooter, but the weapon and other items were recovered.<br>Philippa Barlow-Lyons , the COO of Caine-Massey, told the media:<br>“I am saddened and sickened by this tragedy, as is everyone in the Caine-Massey family. Johann was approved as our new CEO late last year. He was a much-respected champion of enterprise, and a close personal friend. No effort must be spared in finding his murderer.”<br>Executive Agent Viola Trask provided a statement from the Federal Intelligence Agency:<br>“At present, the assassin’s identity and whereabouts remain unknown. The weapon used in the attack was a professionally modified Manticore Executioner marksman rifle. Local police also found advanced ECM equipment that was used to disrupt security systems. These particular models are known to be utilised by undercover Imperial agents. However, a thorough investigation is underway and we have drawn no conclusions as yet.”"},{"title":"Seo Jin-ae: ‘I Believe Salvation Survived’","field_galnet_date":"30 MAR 3309","imageList":["NewsImage_guardians3"],"field_galnet_body":"Aegis has published a personal statement from Seo Jin-ae, who claims to have evidence that Salvation planned to escape death in the HIP 22460 system.<br>“First of all, yes, Caleb Wycherley died when the Thargoids attacked the Bright Sentinel in HIP 22460. But, I believe, only physically. He was developing technology to automatically relocate his mind, an emergency protocol he named the Nemesis Failsafe.”<br>“I know how implausible that sounds, but the files I recovered from an Azimuth Biotech archive prove his intentions. For several years, Salvation ran a private project to reverse-engineer a Guardian artefact which could store consciousness. The design showed neural interactions as digital impulses, and made reference to exactly retaining his identity and memories.”<br>“Salvation had already extended his life to over 250 years, and was obsessed with staying alive until he could wipe out the Thargoids. I’m convinced that he has survived in some bodiless form, and that Azimuth has known all along.”<br>Aden Tanner, who works for Aegis as an independent specialist, also released a statement:<br>“I’ll admit that the designs Seo found seem authentic and incredibly advanced. But the files contained no concrete proof that the Nemesis Failsafe was constructed, or if it could actually work. I’m more concerned that she was being hunted by unknown parties, who would likely have succeeded if not for the Far God cult’s intervention. Perhaps it needs to be restated that actively seeking to hinder Aegis, or its valued personnel, is a crime against all three superpowers.”<br>In related news, the Testament megaship that rescued Seo Jin-ae from unidentified attackers has now left the Luyten’s Star system, following a week of clemency offered by Federal authorities. A spokesperson for President Hudson reiterated that the Order of the Far God remains illegal in the Federation."},{"title":"Thargoid War Update: March 3309","field_galnet_date":"29 MAR 3309","imageList":["NewsImage_thargoids1"],"field_galnet_body":"Vox Galactica correspondent Jade Sanderlyn reports on the latest developments regarding the war against the Thargoids.<br>“In the broad sense, there have been few significant changes in Thargoid tactics. The eight Maelstroms continue to send waves of Thargoid vessels deeper into the core systems. Anti-xeno forces are certainly winning victories, and in some cases retaking previously occupied systems. But we are still losing more than we save.”<br>“Despite being reformed only recently, Aegis has hit the ground running. Its caustic sink launcher is now available following a successful trial by Aden Tanner. This ingenious device increases the amount of time that a ship can spend inside a Maelstrom before being impaired by corrosive damage.”<br>“The repulsing energy wave at the clouds’ centres, however, remains impenetrable. I understand that Aegis has prioritised gathering data about this defence mechanism, and research is underway into possible countermeasures. Until more can be learned about the true nature of the Maelstroms, the chances of destroying them are virtually zero.”<br>“The Alliance, Empire and Federation are all working to reinforce their military strength. But the front line of this war is primarily being waged by independent pilots and squadrons. Heroic individuals such as Commander Oghmios-TTT, Commander Night Furry and Commander FrankXJR have achieved fame for their phenomenal success at destroying Thargoid vessels.”<br>“Such small rays of hope in the darkness remain few and far between. Many battles are being won, but the creeping fear of inevitable defeat weighs heavily on all our souls. This is Jade Sanderlyn for Vox Galactica. Stay safe out there.”"},{"title":"Winters Announces Election Manifesto","field_galnet_date":"28 MAR 3309","imageList":["NewsImageFederalCityscape"],"field_galnet_body":"The Liberal Party has published a detailed political manifesto in advance of the Federation’s presidential election in June.<br>Shadow President Felicia Winters summarised her party’s plans during a campaign rally on Rhea 3:<br>“The freedoms and privileges of Federal citizens have been abused or ignored by the Hudson administration. Our vision for governance focuses on restoring the Federation’s core values, offering every individual the opportunities they deserve.”<br>“As your democratically elected president, I will take great pleasure in dismantling the Proactive Detection Bureau on day one. The mass-monitoring of private communications is a violation of civil rights that must end immediately.”<br>“For those concerned about security, especially the Thargoid threat, I assure you that there will be no reduction in military spending. In fact, our aim is to extend naval and humanitarian assistance to independent systems near our borders that face Thargoid aggression. By supporting systems around Federal space, we will establish a robust front line to repel Thargoid forces.”<br>The Federal Free Press praised the manifesto, remarking that it “displayed the balance of strength and compassion that has long been lacking from our leadership”. However, an editorial in Sol Today claimed: “Winters’s grip on political reality has been weakened by years of ineffectual hand-wringing.”<br>In related news, the Republican Party is currently holding a series of caucuses to select their presidential candidate. Grand Attorney Edwin Espinosa and Congressman Thandeka Qwabe have been eliminated from the running, leaving Vice President Jerome Archer and Secretary of State Lana Berkovich as the remaining nominees."},{"title":"Far God Cultists Rescue Seo Jin-ae","field_galnet_date":"23 MAR 3309","imageList":["NewsImage_generationship3"],"field_galnet_body":"Seo Jin-ae has arrived safely in the Luyten’s Star system, aboard an Order of the Far God megaship.<br>A message was transmitted by the First Apostle of the True Chapters, a proactive sect of the pacifistic religion, from aboard the Testament:<br>“The one known to non-believers as Subject D-2 or Seo Jin-ae is sacred to us as the Preceptor – the first human to interpret the will of the Far God. We know her to be a holy emissary, on a personal pilgrimage that exposed her to great danger. I was able to convince my brethren to locate the Preceptor and offer her safe harbour from the heretics.”<br>“I beseeched the Preceptor to help us hear the Far God’s divine thoughts as she does, but she informed me that the time was not yet right. She requested a reunion with her friends, who also seek ways to commune with Its heralds. While this insistence on collaborating with the unworthy is curious, we have faith that the Far God guides her path. One day the Preceptor will prepare us for the extinction of all life. It is our honour to serve her.”<br>Professor Alba Tesreau gave a statement to the media:<br>“I am very grateful to the First Apostle for her help. The Testament’s timely intervention routed several unidentified hostile ships that were hunting Seo Jin-ae. Once she has completed a medical assessment, we hope to learn more about her recent findings.”<br>Congressman Tom Gillespie has instructed Aegis not to make formal contact with Far God cultists, whose faith is outlawed in the Federation as well as the Empire. A week’s clemency has been issued in recognition of Seo’s safe return, but the Testament’s presence deep in Federal territory is likely to irritate President Hudson."},{"title":"Congress Votes Against Hudson Contravention","field_galnet_date":"21 MAR 3309","imageList":["NewsImageSPFederation"],"field_galnet_body":"President Zachary Hudson’s motion to allow him to serve a second term of office has been defeated by congressional vote.<br>The proposal would have temporarily repealed the 77th amendment of the Federal Accord, which sets a maximum presidential term of eight years. A narrow majority voted not to accept this change to the Federation’s constitution.<br>President Hudson addressed Congress following the announcement of the result:<br>“The Federation’s democratic principles are paramount, and so I accept the decision of this chamber. I only hope that the disruption caused by a shift in leadership does not weaken our ability to withstand the current challenges. It is with total conviction that I say the Republican party will achieve victory in the ongoing war and maintain security within our borders. I intend to support the next Republican candidate to the best of my ability.”<br>This outcome confirms that President Hudson’s administration will officially end shortly after the election, which is expected to take place in June but with no official date set. However, considering his many commercial and military connections, Hudson will remain a powerful political figure with a loyal supporter base.<br>Nominees for the Republican Party’s new presidential candidate have begun lobbying for support. The frontrunners are three senior members of Hudson’s cabinet: Vice President Jerome Archer, Secretary of State Lana Berkovich and Grand Attorney Edwin Espinosa. Congressman Thandeka Qwabe has also been nominated despite her relative inexperience.<br>The Liberal Party’s candidates, Shadow President Felicia Winters and her running mate Isolde Rochester, have launched their presidential campaign. Several independent candidates are challenging the two main political parties, but only the famous entrepreneur Zachary Rackham is being viewed as a serious threat."},{"title":"Rumours Circulate Around Seo Jin-ae","field_galnet_date":"20 MAR 3309","imageList":["NewsImageStarportCobra"],"field_galnet_body":"An anonymous source has leaked information regarding Seo Jin-ae suggesting that she may be in serious jeopardy.<br>Seo Jin-ae, the individual once known as Subject D-2, voluntarily departed from a private medical facility in January, where she was under the care of former Aegis members. She left a message stating: “I have unfinished business with Salvation.”<br>The engineer Kit Fowler discussed the recent rumours during his End Times broadcast:<br>“Something is definitely going on, people. The interstellar grapevine is buzzing with gossip about Seo Jin-ae. That cortical implant in her head, which provides some weird insight into Thargoid behaviour, makes her pretty much most valuable person in the galaxy right now.”<br>“Some say that a black ops teams have either kidnapped or assassinated her. Maybe it’s Azimuth. Maybe it’s a dead man’s switch group belonging to Salvation. One pilot tells me he spotted an Aegis patrol in the Ngaruayanka system, and thinks it was sent to recover poor Seo’s body. And a hacktivist from the Collective has intercepted comms fragments containing the words ‘Bright Sentinel’ and ‘Nemesis protocol’. What secrets did Seo uncover? And is she still alive to share them?”<br>Aegis has been approached for comment, but only reiterated that they are currently investigating Seo Jin-ae’s whereabouts.<br>Director Nassim Qadir, head of medical research at Azimuth Biotech, provided a statement:<br>“Aegis’s amateurish efforts to examine Ms Seo have clearly resulted in some form of dissociative disorder and paranoid delusions. This explains her obsessive vendetta against a man whose death was independently verified. If Ms Seo can be located, she should be returned to Azimuth’s specialist laboratories for her own wellbeing.”"},{"title":"Aegis Recommends Preventative Anti-Xeno Tactic","field_galnet_date":"16 MAR 3309","imageList":["NewsImageThargoidIncursion"],"field_galnet_body":"*Pilots Federation Alert*<br>An analysis of the ongoing Thargoid war has been released by Aegis and made available to all superpower and independent navies.<br>The focus of the report centres on protecting systems at threat of Thargoid invasion. It suggests that anti-xeno forces are primarily fighting Thargoid invasion fleets which have already arrived, understandable due to the immediate risk to civilian life. However, Aegis proposes that increasing defensive efforts for systems at threat of invasion would be a more efficient way of slowing the spread of Thargoid-controlled territory.<br>Commodore Emil Varga provided a statement alongside the report’s release:<br>“The effort required to repel an invasion fleet is far higher than dissuading that fleet from entering a system in the first place.”<br>“We believe that Thargoids have assumed a ‘path of least resistance’ approach to expansion. Thanks to the efforts of our skilled pilots, we have sufficient evidence to show that Thargoids will not deploy a full strength force in locations where advance Thargoid vessels encounter heavy resistance.”<br>“The Orthrus vessels, in particular, appear key to prepping systems for invasion. The exact mechanisms in which they do so are yet to be verified, but an Orthrus appears to provide key logistical details about an expansion target. It is clear that invading Thargoid vessels know exactly where to emerge from hyperspace to attack local ports and tactical assets. Destroying Orthrus ships may be key to safeguarding an alerted system.”<br>As an incentive to draw combat pilots to systems on alert, combat bonds payouts on Orthrus vessels have been increased."},{"title":"Ammonia World Survey Concludes","field_galnet_date":"16 MAR 3309","imageList":["NewsImageMap"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Aegis and Universal Cartographics have announced that the project to survey ammonia worlds has ended satisfactorily.<br>Special mention goes to Commander aRadish, Commander Lone WolfPack and Commander T'Verez for their efforts.<br>The exploration initiative was praised by Congressman Tom Gillespie, who oversees Federal contributions to Aegis:<br>“An impressive number of terrestrial planets with ammonia-based atmospheres were scanned and catalogued over the last two weeks. Universal Cartographics certainly considers the project to be a great success, and I know our xenological scientists do too.”<br>“This is the kind of task for which independent Commanders are absolutely unmatched in dedication and expertise, and they remain our indispensable allies.”<br>Vice Admiral Skylar Anderson, the Imperial military liaison to Aegis, added:<br>“This information is of considerable strategic value. Each system containing an ammonia world will be monitored using concealed sensor buoys. This will alert Aegis to the presence of Thargoid vessels or Maelstrom manifestations. Advance warnings will provide increased time to evacuate systems or mount pre-emptive strikes.”<br>Pilots can receive payment for their exploration data at Angus Manwaring starport in the Eta Cassiopeiae system.  The promised x3 multiplier on exploration data profits for the next two weeks has also commenced, with Universal Cartographics providing this through its starport contacts."},{"title":"Federal Eyes on Congress Debate","field_galnet_date":"14 MAR 3309","imageList":["NewsImageMap"],"field_galnet_body":"Preliminary motions on the forthcoming Hudson Contravention vote have begun in Federal Congress.<br>The proposal, named after President Zachary Hudson’s call to suspend the 77th amendment to the Federal Accord, is a point of significant contention. If approved, Hudson would be eligible to run for another term in this year’s presidential elections, breaking with centuries of constitutional law. <br>Supporters of the proposal, led by Hudson’s cabinet, point to the ongoing conflict with the Thargoids as a primary reason to vote in favour. With the significant escalation in Thargoid aggression and the loss of hundreds of systems, it has been argued that a change of leadership could weaken the Federation’s ability to defend itself.<br>Opponents have called the move a ‘dictatorial’ tactic which uses the fear of alien attack to influence public opinion. Felicia Winters, the Liberal candidate and current shadow president, recently discussed this further during an interview with the Federal Free Press:<br>“In these difficult times we cannot forget who we are, or what makes the Federation great. The 77th amendment was established in 2594, and has defined the presidential length of service ever since. This structure not only provides clarity to the people who use their vote to inform Federal governance, but also to each individual entrusted with the honour of the presidency. To change it now would send a message that we have lost faith in the Federation’s political mechanism.”<br>The official vote on the Hudson Contravention motion is expected to take place next week."},{"title":"Archon Delaine Counters Mahon’s Rebuke","field_galnet_date":"09 MAR 3309","imageList":["NewsImage_settlements7"],"field_galnet_body":"Archon Delaine has rejected Prime Minister Mahon’s warning over an alleged attempt to gain control of systems in the California Nebula.<br>“Wake up, Old Man Mahon!” Delaine said in a public broadcast. “The Kumo Crew migrated into the nebula with help from some mutual friends of ours… people you now consider allies. You like to portray us as criminals lusting for power and influence, but the real crooks are much closer to home. Rather than watching us, you should try looking over your shoulder.”<br>Independent journalist Flint ‘Firemaker’ Lafosse published his observations via the Rewired network:<br>“Watching two of Sirius Corporation’s business partners openly fight like this must be making Li Yong Rui cringe as much as his poker face allows. What’s that? You never heard of the most powerful megacorp in history dealing with pirates? Surely not!”<br>“Delaine is clearly referring to 3307, when he somehow convinced Kavanagh Spaceframes to build him five Orbis stations. One of these, California Freeport in HIP 18390, planted the Kumo flag in the nebula and served as the base for the gang’s recent attempt to seize Allied assets there.”<br>“It was never revealed how the syndicate funded the construction of the starports. Or why Sirius Corporation subsidiaries appeared in those systems around the same time. But you don’t have to hire the Wallglass Agency to find a connection there.”<br>“Oh and by the way, Kavanagh Spaceframes was renamed Rackham Spaceframes following its purchase by Rackham Capital Investments last year. What’s that? The trillionaire and the pirates working together as well? Surely not!”"},{"title":"Alliance Sends Warning to Kumo Crew","field_galnet_date":"07 MAR 3309","imageList":["NewsImageStationConstruction"],"field_galnet_body":"Recent activities by the Kumo Crew syndicate in the California Nebula have been formally condemned by the Alliance.<br>Councillor Jed Trager  supervised an investigation into the Kumo Council’s attempt to take control of several systems, ostensibly to defend them against a wave of Thargoid attacks. He summarised its findings during a session of the Assembly:<br>“Intelligence provided by Alliance Interpol agents proves that the underlying objective of the Kumo Crew’s anti-xeno militia was to dominate the California Nebula. The syndicate had gathered ships and infiltrated civil institutions weeks earlier, using bribery and coercion to pave the way for their takeover.”<br>“Further Thargoid attacks in the region were seen as inevitable, based on past behaviour and the prevalence of barnacle sites. When they occurred the Kumo Crew mobilised their pre-prepared forces, overthrowing local authorities under the pretence of ‘emergency security measures’.”<br>“Our investigation has concluded that this was a brazen act of aggression against Allied factions. The Kumo Crew illegally attempted to hijack the Alliance’s assets and impose direct rule over our colonies.”<br>Prime Minister Edmund Mahon delivered a public statement:<br>“The Kumo Council’s opportunistic attempt to profit from the horrors of a Thargoid invasion is a truly despicable act. But it has not gone unnoticed that they have suffered setbacks in Haithis, Kolabinates and Saontiana since this misguided effort to disrupt Allied operations. I am grateful to the communities within the California Nebula, and to those independents who aided them, for resisting these criminals.”<br>“My message to Archon Delaine is this: The Alliance is watching you.”"},{"title":"Marlinists Facing ‘Increasingly Grave’ Future","field_galnet_date":"06 MAR 3309","imageList":["CommunityNewsFeed_10"],"field_galnet_body":"The Marlinist Colonies are struggling to survive the harsh realities of independence while preparing for the impact of the Thargoid war.<br>An editorial in The Marlin Standard summarised their situation:<br>“In recent months, our noble goal of building a Marlinist Republic has been harshly curtailed. Many of the original eight colony systems, among them the capital Concordia, are now dominated by outsiders including Federal and Sirius-aligned corporations. We have survived persecution, civil war and terrorism, only to find our people exploited by the opportunism of neighbouring factions.”<br>In the Empire, the prevalent viewpoint is that the Marlinists are suffering the consequences of their own actions. As Senator Arturo Durant remarked: “They voted to reject the Emperor’s offer to become an Imperial protectorate, so now they must pay the price.”<br>Compounding this is the increasing danger posed by the Thargoids as their fleets penetrate deeper into the core systems. The Citizens’ Chronicle newsfeed has published concerned messages from some Imperial citizens for their Marlinist cousins. One viral commenter proclaimed: “The colonists aren’t enemies! They were once our loved ones, our friends and family, driven away for their political beliefs. How can we turn our backs on them?”<br>The Marlinist Parliament has signalled a willingness to contribute to Aegis, but its priority is to establish control over its chartered systems. First Minister Octavia Volkov has admitted: “Without a dedicated military to achieve this, our future prospects look increasingly grave.”<br>The Marlinists’ situation is mirrored elsewhere, as noted by war reporter Ernesto Rios for Vox Galactica:<br>“Vulnerability to Thargoid attack is a universal concern among independent systems. Many non-superpower factions are banding together in small clusters to cooperate on anti-xeno operations and share resources. A spirit of camaraderie has arisen in the face of annihilation. But will that be enough against the overwhelming might of the Thargoids?”"},{"title":"Explorers Needed for Ammonia World Survey","field_galnet_date":"02 MAR 3309","imageList":["CommunityNewsFeed_12"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Universal Cartographics has announced a two-week initiative to locate planets with ammonia atmospheres.<br>The survey was outlined by Cynthia Sideris, chairperson of Universal Cartographics:<br>“Aegis has urgently requested an update to our database of terrestrial planets with ammonia atmospheres. It is no coincidence that each Maelstrom is located in a system containing such worlds, given that Thargoid biochemistry is ammonia-based.”<br>“We are therefore liaising with Aegis to chart as many ammonia worlds as possible. As well as contributing to xenological research, our intent is to identify potential staging grounds for Thargoid fleets and arrival points for additional Maelstroms.”<br>“Over the next two weeks, pilots can obtain increased payouts for delivering cartographic survey data to Angus Manwaring starport in the Eta Cassiopeiae system. Only ammonia world data will be recognised for the purpose of the survey campaign, however, with detailed surface scans particularly appreciated.”<br>As an incentive for participation, general cartographic data payouts will be multiplied for a further period if the initiative is successful. The multiplier will depend on the campaign tier achieved.<br>The most recent survey of this kind took place in 3306, when Sirius Atmospherics claimed to be developing a method of terraforming ammonia worlds for human habitation. Dr Maximilian North has since stated that the project is on hold following “practical obstacles impacting our ecosphere conversion theories”."},{"title":"Caustic Sink Launcher Aids Maelstrom Exploration","field_galnet_date":"02 MAR 3309","imageList":["CommunityNewsFeed_23"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Aegis’s initiative in the Duamta system has kick-started production of a ship module designed for caustic environments.<br>Shipments of advanced catalysers, heatsink interlinks and palladium were delivered following a request from Professor Alba Tesreau. Pilots also provided tissue samples extracted from the caustic generators inside each Maelstrom, which are a vital component of these modules.  Manufacturing bases have now been established, allowing stocks of the caustic sink launcher to reach the public market. <br>Dr Maximo Fonseca, head of xenological research at Gateway Laboratories, published a statement on behalf of Aegis:<br>“The Thargoids have developed powerful defences to prevent their enemies reaching the heart of the Maelstroms. The dangerously caustic gas clouds are an effective deterrent, and have sadly claimed the lives of many intrepid pilots.”<br>“So, the caustic sink launcher is an exciting breakthrough that will both save lives and facilitate vital data recovery. Now that ships can survive for longer within the clouds, the acquisition and study of tissue samples and caustic shards should increase. The next priority for Aegis is to study the massive energy surges that prevent access to the inner region of a Maelstrom.”<br>Aegis has invited all pilots who took part in the delivery initiative to collect their rewards from the Orunmilla in the Duamta system."},{"title":"Rackham Reveals Presidential Manifesto","field_galnet_date":"27 FEB 3309","imageList":["NewsImagePoliticalRally"],"field_galnet_body":"Trillionaire entrepreneur Zachary Rackham has launched his campaign to be elected as Federal president in the forthcoming election.<br>He outlined several policies during a press event in the tropospheric suite of Rackham’s Spire on the planet Homeland:<br>“As I see it, the job of president is to help ordinary, hard-working people from humble backgrounds – just like me. So I pledge to reduce all civil taxes and public service fees, and boost government funding for business grants and commercial opportunities. Let’s make everyone rich and successful – just like me!”<br>Mr Rackham is running for the position of Federal president as an independent candidate and claims support from several corporate interests including Rackham Capital Investments. His manifesto has triggered a surge in popularity, with several high-profile celebrities promoting his campaign slogan: ‘Just Like Me’.<br>However, economists have noted that his tax-cutting proposals remain uncosted and are considered virtually unachievable. The journalist Bryanna Blanco, who has been investigating Mr Rackham’s business affairs for years, described his presidential promises as “populist nonsense from a former pirate turned politician”.<br>The presidential election will be held in June 3309. Shadow President Felicia Winters has confirmed that she will represent the Liberal Party, with Congressman Isolde Rochester as her running mate.<br>The Republican Party candidate will be announced after Congress’s vote on the Hudson Contravention, which is scheduled for mid-March. If this constitutional amendment is approved, it will permit President Zachary Hudson to stand for a second eight-year term. Other senior Republican congressmen, including Vice President Jerome Archer, are also preparing their electoral campaigns."},{"title":"Aegis Launches Caustic Sink Launcher Initiative","field_galnet_date":"23 FEB 3309","imageList":["NewsImageStarportAnaconda"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Deliveries are requested in Duamta to fast-track production of a module that protects ships in caustic environments.<br>Professor Alba Tesreau, the head of Aegis, provided these details:<br>“We are grateful to Aden Tanner for personally testing our prototype caustic sink launcher. The electrochemical reaction within the Maelstrom cloud was successfully channelled into semi-liquid anodes for ejection. This kept the ship hull intact for considerably longer before Tanner was forced to withdraw.”<br>“Aegis is setting up manufacturing and distribution centres to make the caustic sink launcher widely available. The Alliance, Empire and Federation will all contribute, but we know that the process can be accelerated with the direct support of the galactic community.”<br>“Therefore, we have an open order for shipments of advanced catalysers, heatsink interlinks and palladium. We also require caustic tissue samples obtained from the caustic generators that can be found inside the Maelstrom clouds. I urge pilots to exercise caution as these are highly dangerous to obtain, but crucial to the modules’ manufacturing process.”<br>Pilots can deliver these resources to the Orunmilla in the Duamta system. Aegis confirmed that the first commercially produced caustic sink launchers will be awarded to the initiative’s top contributors.<br>Xenological research groups have reacted positively to this development. Director Ivano Colombera of the Imperial Science Academy stated:<br>“Aegis has immediately justified its reformation with this contribution to the war effort. The caustic sink launcher will allow more data on the Maelstroms to be gathered, thus furthering our understanding of the Thargoids’ capabilities.”"},{"title":"Thargoid War Update: February 3309","field_galnet_date":"23 FEB 3309","imageList":["NewsImage_thargoids4"],"field_galnet_body":"An overview of recent developments regarding the Thargoid conflict, as reported by Jade Sanderlyn on the Vox Galactica newsfeed. <br>“Over the last month, Thargoid fleets have continued expanding outwards from the eight Maelstroms. The front lines of the war are relentlessly encroaching deeper into the core systems, leaving desolation and death in their wake.”<br>“A dedicated resistance force won a few precious victories, with 61 systems fully liberated from Thargoid control. But compared to the 634 systems that have been overrun, it would be optimistic to suggest the aliens’ advance is being significantly impeded at this stage.” <br>“Fierce fighting has also broken out in the California and Witch Head Nebulas. It’s been speculated that the Thargoids seek to secure the barnacle sites seeded in those regions millennia ago… a reminder that this species may view all of our space as its original territory.”<br>“Despite these grim developments, practical support arrived in the form of Azimuth Biotech’s experimental weapons stabilisers and Professor Palin’s improved xeno scanner. Both were welcomed by independent pilots, increasing their chances of triumphing over the powerful Thargoid vessels.”<br>“Of course, the biggest news is the resurrection of Aegis. Key figures in the Alliance, Empire and Federation managed to re-establish the anti-xeno agency that was once abandoned in favour of Salvation. Already there are promises of technological breakthroughs, including the ability for ships to better withstand the caustic hell inside the Maelstroms.”<br>“As our best and brightest work together in earnest, time will tell if they can prevent this war from overwhelming us all. This is Jade Sanderlyn for Vox Galactica. Stay safe out there.”"},{"title":"Maelstrom Protection Technology Undergoes Testing","field_galnet_date":"20 FEB 3309","imageList":["CommunityNewsFeed_9"],"field_galnet_body":"Aegis has produced a prototype module that increases a ship’s ability to survive within caustic environments.<br>Professor Alba Tesreau, head of the newly reformed agency, published this statement:<br>“The blueprints provided by Petra Olmanova have been rapidly developed by Aegis’s newly acquired chemical engineers, metallurgists and ship technicians. Utilising their combined skills, they have constructed a working prototype.”<br>“This new module functions along similar lines to a heatsink launcher. It is designed to channel the corrosive reaction experienced within a Thargoid Maelstrom to specific replaceable anodes prior to ejection, thereby extending a ship’s range and operating time. We hope this will allow more data to be acquired about these mysterious objects.”<br>“Aden Tanner has volunteered to personally pilot the ship in the live tests taking place this week. Time is of the essence, since the humanitarian cost of the Thargoid invasions rises every day.”<br>Rear Admiral Daniel Parry, the Federal Navy’s military liaison to Aegis, commented:<br>“I’ve served under Admiral Tanner, and his involvement with these test flights doesn’t surprise me one bit. He takes pride is never sending personnel on assignments he wouldn’t undertake personally. But he’s also sending a message: Aegis will no longer rely so heavily on independent pilots risking their lives. While Commanders of the Pilots’ Federation are still our most adaptable and reliable field agents, Aegis will seek to work alongside them wherever possible.”"},{"title":"Princess Aisling ‘Understood Risk of Speaking Out’","field_galnet_date":"17 FEB 3309","imageList":["NewsImageImperialCityscape"],"field_galnet_body":"Princess Aisling Duval has assumed oversight of the Empire’s contributions to the tri-superpower agency Aegis.<br>She discussed her new role during an interview with The Imperial Herald:<br>“Loathe though I was to defy the Emperor’s decree, every instinct told me that the Aegis initiative can develop methods of protecting the Empire from enormous losses in this war. I’m grateful that Arissa recognised the value of my plea.”<br>“I’ve been liaising with Professor Alba Tesreau, as well as Dr Fonseca, Vice Admiral Anderson and the rest of my team. Our challenge is to make the most of the Imperial resources allocated to Aegis.”<br>“It’s true that I was critical of Aegis’s effectiveness in the past, but I’ve always believed that cooperation with other superpowers can bring mutual benefits. The mass slaughter inflicted by the Thargoids eclipses the NMLA’s atrocities – a challenge we faced together. We must trust each other now as we did then.”<br>The newsfeed also featured a response from Hadrian Augustus Duval:<br>“It’s gratifying to see that Patreus and Torval aren’t as influential as they think they are. Yet that doesn’t mean Aisling is right. The Empire must not chain itself to the Alliance and Federation once again. The Emperor can be ruthless when it suits her, as I know only too well, but in this case she lacks the courage of her convictions.”<br>Royal correspondent Gudrun Vestergaard observed:<br>“This is a calculated move by Emperor Arissa Lavigny-Duval. If Aegis fails, her isolationist policy will be vindicated. If Aegis succeeds, she can claim credit for permitting this exception. The risk is whether the public would credit an Aegis-assisted victory over the Thargoids to the Princess. Such an outcome would increase Aisling’s popularity and political capital to a level Arissa is unlikely to tolerate for long.”"},{"title":"Thargoids Devastate Witch Head Enclave","field_galnet_date":"16 FEB 3309","imageList":["NewsImageStationDamaged"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Populated systems in the Witch Head Nebula have been overrun by Thargoid fleets, resulting in widespread chaos.<br>Thargoid vessels have directly targeted starports and planetary bases, leaving tens of thousands of casualties. With the nebula located hundreds of light years from the core systems, rescue services are struggling to aid the fleeing survivors.<br>Vox Galactica published a fragmented message transmitted by the engineer Chloe Sedesi:<br>“…emergency SOS from the Shenve system. The Thargoids… full-scale invasion. They’ve hit us hard. The… evacuated my team and abandoned Cinder Dock. We’re trying to get clear from… swarms of them, in every direction we turn. If anyone’s receiving this, we’re…”<br>Captain Warren Lamar, head of security for the Alliance Expeditionary Pact, made this statement:<br>“In recent years we’ve fought off several Thargoid strikes, but the sheer scale of these attacks is unprecedented. The Golden Stag megaship in Onoros has been destroyed, with most of our forces scattered. I’ve urgently requested reinforcements from the Alliance, but we are desperate for immediate support.”<br>The Witch Head Enclave was established in 3305 following the discovery of barnacle sites, which were commercially exploited by the Alliance as sources of meta-alloys. Dr Maximo Fonseca and other leading xenologists believe that securing barnacle-rich systems is part of the Thargoids’ expansion strategy."},{"title":"Aegis Returns","field_galnet_date":"13 FEB 3309","imageList":["CommunityNewsFeed_3","AegisIconNewsImage"],"field_galnet_body":"The anti-xeno agency Aegis has been officially reformed by the Alliance, Empire and Federation.<br>Aegis was initially founded in 3303 to centralise research into the Thargoids, as well as coordinate defence and rescue operations. It was disbanded in 3308 following accusations of incompetence in the wake of the Alexandria disaster and the subsequent findings of the Baumann Report. The recent escalation of the Thargoid War and calls for renewed collaboration between the superpowers have led to a reversal of that decision.<br>Professor Alba Tesreau will serve as the head of the revived organisation. She provided details at a press conference:<br>“Aegis remains humanity’s best hope of ending this calamitous war with the Thargoids. Its priority is to better understand the alien species through scientific research, and to utilise those findings to improve our defensive and weapon capabilities.”<br>“Each superpower has appointed an individual to oversee its contributions: Deputy Prime Minister Angela Corcoran for the Alliance, Princess Aisling Duval for the Empire, and Congressman Tom Gillespie for the Federation. We have also invited many independent specialists to partner with Aegis, including Professor Ishmael Palin, Ram Tah and a previous key member of Aegis, Aden Tanner.”<br>“Criticism from the Baumann Report has been taken on board. Our new organisational structure follows the streamlined approach used by the Affiliated Counter-Terrorism Unit to great success. To improve coordination, a limited application of Omega Grid networking will facilitate rapid and secure communications between key members.”<br>“Aegis’s first research project is already underway. The engineer Petra Olmanova has approached us with preliminary designs for a method of allowing ships to survive longer within the Maelstroms’ corrosive clouds. We have assigned several metallurgy and chemistry experts to develop this further.”"},{"title":"Federation Pledges Resources to Aegis","field_galnet_date":"10 FEB 3309","imageList":["CommunityNewsFeed_13"],"field_galnet_body":"President Zachary Hudson and Shadow President Felicia Winters have united behind Federal backing for the reformation of Aegis.<br>Congress held an emergency debate after the Alliance and Empire agreed to support an official tri-superpower initiative against the Thargoids. A majority of votes from Republican, Liberal and independent representatives approved the provision of ships, personnel and materials from the Federation.<br>President Hudson delivered a short address to mark the occasion:<br>“The intensified Thargoid attacks against the core systems demand a proportionate response. We recognise that Salvation was directly responsible for many of the tragic events that Aegis was blamed for. The Federation has an opportunity to correct that misjudgement and do our part to defeat a common adversary.”<br>Congressman Tom Gillespie has volunteered to coordinate the Federation’s involvement with any unified anti-xeno activities. Professor Shamus Madigan of Olympus Village University will continue to lead on xenological research. The Federal Navy has assigned Rear Admiral Daniel Parry to act as its military liaison, a reduced version of the role formerly occupied by Admiral Aden Tanner.<br>Professor Alba Tesreau has publicly thanked the leaders of the Alliance, Empire and Federation for their “renewed faith in the ideals that Aegis represents”.<br>"},{"title":"Kumo Crew Rebuffed after Anti-Xeno Campaign","field_galnet_date":"09 FEB 3309","imageList":["NewsImageSPEmpire","NewsImageOutpost"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>A successful initiative to hold the California Nebula against Thargoid invasion has succeeded, for now at least.<br>Systems recently invaded by Thargoid fleets were protected by a militia organised by the Kumo Council, the criminal syndicate’s ruling authority in the enclave. But an attempt to assume control of the region’s ports has been surprisingly repelled by opponents of Delaine.<br>The Pegasi Sentinel reported on the situation:<br>“There can be no doubt that Archon Delaine takes the security of the California Nebula seriously. Many lives were saved thanks to his decisive actions. A Kumo Crew anti-xeno militia is already being considered for future Thargoid attacks.”<br>“Local residents remain wary of Delaine’s reputation, however. Security forces deployed to local ports have been driven out, with communities apparently unconvinced by claims of ‘emergency security measures’. Turner Research Group has re-established control in locations the Kumo Council had attempted to seize.”<br>A related article was also published by The Alliance Tribune:<br>“The Assembly received an urgent request for support from the Turner Research Group. They claim that the Kumo Crew’s campaign was an excuse to encroach upon the Alliance’s operations in the California Nebula. Councillors have raised a motion to begin a formal inquiry into the situation.”<br>The Mictlan megaship, currently in California Sector HR-W d1-28, is reimbursing Thargoid combat bonds for all pilots who contributed to the initiatives.<br>"},{"title":"Activists Blame Leaders for Thargoid War","field_galnet_date":"07 FEB 3309","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"Anti-authoritarian protests have surged in the Alliance, Empire and Federation with governments accused of responsibility for Thargoid hostility.<br>Vox Galactica’s political correspondent Conrad Sterling published a special report:<br>“The xeno-peace movement, which originally advocated diplomatic relations with the Thargoids, lost a lot of momentum following the arrival of the Maelstroms. But some former members are blaming Allied, Federal and Imperial leaders for allowing the war to escalate, with profits from corporate arms deals seen as the motive.”<br>“Timothy Culver, once a spokesperson for the Thargoid Advocacy Project, believes that conflict was always the superpowers’ policy. ‘They knew the Proteus Wave would trigger an aggressive reaction from the Thargoids,’ he claims – without providing evidence, it should be noted. ‘Shareholders in the military/industrial complex always make a fortune during wartime. The blood of billions is on their money-grabbing hands.’”<br>“An uncoordinated wave of activism across the core systems has included civil lawsuits, protest marches and occasional clashes with security personnel. There have even been attempted break-ins at administrative complexes and politicians’ homes, where some activists believe proof of conspiracy can be found.”<br>“Xeno-peace figureheads, such as ICE-caster Joy Senne, have distanced themselves from these incidents and the general TAP movement in recent weeks. Congressman Dalton Chase has made no further statements on the Kingfisher tragedy, his spokesperson citing a ‘focus on other projects’. Only Heimar Borichev of the Sovereign continues to broach the subject, claiming recently: ‘Institutional corruption requires radical solutions.’”<br>“Allied Interpol and the Imperial Internal Security Service claim that the public disorder is under control, while the Proactive Detection Bureau has begun identifying and ‘pre-cautioning’ Federal citizens who express anti-authority sympathies. But as the death toll from the Thargoid war continues to rise, the demands for responsibility seem unlikely to fade.”"},{"title":"Mahon: ‘Alliance Will Support Aegis’","field_galnet_date":"06 FEB 3309","imageList":["NewsImageSPAlliance"],"field_galnet_body":"The Alliance Assembly has voted to make a contribution to Aegis if the agency is reformed by the three superpowers.<br>Prime Minister Edmund Mahon made an official announcement:<br>“Emperor Arissa Lavigny-Duval’s change of heart regarding anti-xeno collaboration has triggered swift action from Alliance systems. The Assembly has re-appraised a bill proposed last November by Deputy Prime Minister Angela Corcoran, seeking to approve Aegis’s reformation. A majority vote has now passed that bill.”<br>“The Alliance will therefore commit ships, resources and personnel to a collaborative anti-xeno agency. We will also share Thargoid-related intelligence and scientific data to a central database shared with the Empire and Federation.”<br>“The strategic defence pact with Sirius Corporation remains in effect, and the company continues to work with us on protecting Allied systems.”<br>It has been suggested that Li Yong-Rui privately advised the prime minister against holding the vote, with the view that Sirius Corporation could fill the role of humanity's primary anti-xeno organisation. However, political analysts noted that Mahon has a long-standing dedication to multilateral cooperation against the Thargoids.<br>Deputy Prime Minister Corcoran will act as the Alliance’s primary contact with any new incarnation of Aegis. Commodore Emil Varga  has volunteered to serve as military liaison, with Dr Maximo Fonseca  of Gateway Laboratories taking the lead on xenological research."},{"title":"Pirates Lead Counter-Attack Against Thargoids","field_galnet_date":"02 FEB 3309","imageList":["CommunityNewsFeed_8"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Kumo Crew is marshalling the defence of the California Nebula by offering rewards for eliminating Thargoid vessels.<br>The Kumo Council, the syndicate’s ruling body, assumed control of several systems that were recently invaded by Thargoid fleets. Independent pilots have been asked to take part in anti-xeno initiatives within the region, which are being coordinated from The Mictlan megaship. <br>Harrison Gladstone of the Turner Research Group, which represents the Alliance in the California Nebula, made a formal protest:<br>“We are not happy about defence initiatives being funded by a ruthless criminal gang. These pirates are using the Thargoid attacks to expand their illegal activity, thus jeopardising our faction’s scientific and commercial interests. Several of our ports in the area are now under Kumo Crew ‘emergency protections’, as they’ve termed it. This is an illegal occupation of Allied territory!”<br>In response, Archon Delaine claimed:<br>“Taking charge of local security forces is necessary to form an effective anti-xeno militia. If the Alliance cares so much about this region, where are their warships? We’re doing Mahon’s job for him. The colonists here will soon understand our decision is the correct one.”<br>The Kumo Council has agreed to reimburse all Thargoid combat bonds handed in at The Mictlan in California Sector HR-W d1-28."},{"title":"Class 5 Experimental Weapons Stabiliser Released","field_galnet_date":"01 FEB 3309","imageList":["CommunityNewsFeed_13"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Azimuth Biotech has commercially launched a new module that allows two additional AX weapons to be added to large ships.<br>The experimental weapons stabiliser increases the number of AX weapons which can be installed on a ship. The class 3 variant released last week increases the limit to five, whereas the class 5 variant released yesterday increases it to six. <br>Both versions entered mass production following Azimuth Biotech’s highly successful resource drive in the LHS 1163 system. CEO Torben Rademaker issued a statement to accompany the product launch:<br>“Our proprietary technology has bypassed the inherent design flaws of Aegis’s AX weaponry. The experimental weapons stabiliser will play a vital role in the ongoing defence of the core systems.”<br>“I can only assume that the current chatter about reforming Aegis is due to misplaced nostalgia. How quickly people forget the Baumann Report, which laid bare the organisation’s inefficiency and incompetence. The logical path to victory is to employ the most accomplished anti-xeno specialists, such as those found here at Azimuth Biotech.”"},{"title":"Emperor Approves Aisling’s Plan for Aegis","field_galnet_date":"31 JAN 3309","imageList":["NewsImageImperialPalace"],"field_galnet_body":"Princess Aisling Duval met with Emperor Arissa Lavigny-Duval in person to discuss an Imperial contribution to the reformation of Aegis.<br>The Imperial Herald’s political journalist Cassia Carvalho reported on events:<br>“Aisling Duval’s arrival at the Imperial Palace was completely unexpected, according to several dignitaries whose appointed meetings with the Emperor were abruptly cancelled. One senatorial aide described how the princess ‘burst into the throne room so suddenly that I’m surprised the Imperial Guard didn’t shoot her’.”<br>“Despite visible irritation, Emperor Arissa acceded to Princess Aisling’s demand for urgent talks. The two royals held a private conversation behind closed doors for many hours. I heard claims of raised voices at one stage, but nobody was willing to go on record to confirm this.”<br>“Eventually, Her Majesty call for the media to assemble, which we did eagerly. The Emperor made it clear that her decree to isolate from the other superpowers remained active. However, if Aegis were to be re-established, a limited number of scientists and naval vessels would be allocated to the anti-xeno agency. Princess Aisling would take ownership of the endeavour, and coordinate with both Imperial and foreign organisations.”<br>“Senators and Imperial Navy officials were surprised by this exception to the Emperor’s policy. But political analysts remarked on the shrewdness of making Princess Aisling personally responsible for the proposed anti-xeno collaboration, thereby distancing the Emperor from any potential failures.”<br>“Insiders claim that Princess Aisling has already requested members for her delegation including Senator Caspian Leopold, Vice Admiral Skylar Anderson  and xenological specialist Ivano Colombera. She has also tasked the Imperial Diplomatic Corps with re-opening diplomatic channels to the Alliance and Federation, specifically to share information about Alba Tesreau’s respective proposals for a reformed Aegis.”"},{"title":"Admiral Tanner Withdraws from Federal Navy","field_galnet_date":"30 JAN 3309","imageList":["NewsImagePressConferenceFederal"],"field_galnet_body":"Admiral Aden Tanner has formally resigned his commission with the Federal Navy, mere weeks after a presidential pardon overturned his court martial.<br>He had returned to naval service following an executive order from President Zachary Hudson. But this unexpected resignation means he is no longer a member of the military, although he retains the honorific of ‘admiral’.<br>Admiral Tanner released a personal statement, which was published by The Federal Times:<br>“I must begin by expressing my gratitude to President Hudson, and thank all those who supported my actions in the T Tauri system. History has proven that Salvation was willing to sacrifice millions of lives in his personal vendetta against the Thargoids, and we are suffering the after-effects of that obsession today.”<br>“The Federal Navy was once my home, but my disillusionment has grown over recent years. Politics and commercial influences hold this great institution back from safeguarding the Federation to its fullest capability. Now that the Thargoid threat has reached such a colossal degree, I find such restrictions frustrating to a point that I would likely be a nuisance to my fellow admirals. I have too much respect for every person serving the navy to offer anything less than my best – that best is now prohibited by bureaucracy. Therefore I am stepping down for the benefit of all.”<br>“As per the presidential pardon’s terms, I will continue developing anti-xeno strategies as an independent military specialist. I will liaise directly with Fleet Admiral Tayo Maikori to contribute to the navy’s war efforts, while also collaborating with other organisations down the line. I remain dedicated to saving lives and bringing this war to an end as soon as possible.”<br>“To any Thargoids who may be listening: you haven’t seen the last of me yet.”"},{"title":"Xeno Scanner Upgrade","field_galnet_date":"27 JAN 3309","imageList":["NewsImage_thargoids3"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>An improved xeno scanner has been released to assist combat vessels engaged in anti-xeno operations.<br>Following increased calls from AX pilots that the existing xeno scanner’s limited range was a hindrance, Professor Palin’s team at Arque Laboratory delivered a redesign to manufacturers that extends the scanner’s upper range to two kilometres. <br>Industrial complexes have worked overtime to distribute the latest model of xeno scanner. It is now available from military, high-tech and industrial planetary bases, as well as rescue megaships."},{"title":"Delaine Vows to Defend California Nebula","field_galnet_date":"27 JAN 3309","imageList":["NewsImageThargoidSite2"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Kumo Crew syndicate has rallied in the California Nebula to repel the region’s Thargoid invasion forces.<br>In recent weeks Thargoid fleets swarmed through several local systems. The Kumo Council, the enclave’s authority for the notorious organisation, rapidly called in reinforcements in three systems it governs. Local security forces are now organising counter-attacks against Thargoid vessels.<br>Archon Delaine, warlord of the Kumo Crew, announced:<br>“Already the war has reached the California Nebula. But are any superpower navies racing to its defence? Of course not – the Alliance considers this colony expendable. It’s down to us to protect the nebula’s citizens, and will do whatever it takes to succeed.”<br>The Pegasi Sentinel newsfeed published a request for populations not to impede Kumo Crew activity, suggesting that fleet mobilisation is ‘a temporary measure to provide a coordinated resistance against the Thargoids’. It is thought Kumo Crew’s megaship, the Mictlan, is preparing to deploy in support of these efforts.<br>This message was rejected by Turner Research Group, which controls several of the invaded systems. The scientific organisation was established by the Alliance in 3302 to study the barnacles discovered in the region. Harrison Gladstone, the group’s spokesperson, declared: “Delaine is obviously using the Thargoid attacks as a pretence for a power grab. There is no chance that these pirates will defend our systems out of the goodness of their blackened hearts. We’ll know what Delaine’s real plan is soon enough.”<br>The California Nebula has witnessed several Thargoid attacks, most recently last October, but this is the first marked increase in hostilities following the arrival of the Maelstroms."},{"title":"Experimental Weapons Stabiliser Becomes Available","field_galnet_date":"26 JAN 3309","imageList":["CommunityNewsFeed_22"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The class 3 experimental weapon stabiliser is now available following Azimuth Biotech’s delivery initiative in LHS 1163.<br>The corporation’s PR division confirmed the release of its new product in a press release:<br>“This variant of Azimuth’s experimental weapons stabiliser is now widely available for purchase. By redirecting and absorbing internal stresses, it allows a ship to carry a total of five AX weapons rather than the previous limit of four. The class 5 variant of the stabiliser, which permits two additional AX weapons, is scheduled to reach the market next week.”<br>“Our manufacturing partners were able to begin this rapid production cycle thanks to receiving great quantities of meta-alloys, insulating membranes, HN shock mounts and beryllium. Pilots who delivered these materials can now collect their rewards from the Glorious Prospect megaship in the LHS 1163 system.”<br>“Azimuth Biotech remains fully committed to supporting anti-xeno initiatives. Our team will continue playing a significant role in combating Thargoid aggression and protecting innocent lives.”<br>Retail outlets have reported an increase in purchases for both AX missile racks and multi-cannons, including the enhanced designs recently produced by the engineers Liz Ryder and Zacariah Nemo. The class 5 variant of the experimental weapons stabiliser is expected to further boost sales of AX weaponry when released on Thursday 2nd February.<br>"},{"title":"The Pro-Aegis Stance of the Princess","field_galnet_date":"23 JAN 3309","imageList":["NewsImageShipyardImperial"],"field_galnet_body":"Princess Aisling Duval’s call for the Empire to commit to a resumed Aegis project, alongside the Alliance and Federation, has received a harsh response.<br>Admiral Denton Patreus was approached for comment by the Eye on Achenar newsfeed:<br>“We all have our part to play in the Empire, but questioning military policy is hardly within a princess’s remit. I would humbly suggest that Her Highness focuses on those areas where she excels: charity work, hosting parties, advocating the wellbeing of the citizens and so forth.”<br>A similar viewpoint was expressed by Senator Zemina Torval, who simply remarked: “Perhaps I am old-fashioned, but there was a time when attempting to challenge the Emperor’s decree was viewed as an insult to the throne.”<br>Hadrian Augustus Duval’s response was less confrontational but clear: “I firmly believe that non-collaboration is the best direction for the Empire, and respectfully ask Aisling not to undermine this policy through the press.”<br>However, Senator Caspian Leopold offered an alternative take:<br>“Princess Aisling has a much better understanding of political realities than many give her credit for. After personally consulting with scientific, military and political specialists, she has concluded that reforming Aegis is the logical move. Far from challenging Emperor Arissa’s policy, this is a heartfelt attempt to support her reign by increasing the Empire’s chances of victory against the Thargoids.”"},{"title":"Thargoid War Update: January 3309","field_galnet_date":"20 JAN 3309","imageList":["NewsImage_thargoids2"],"field_galnet_body":"Vox Galactica reporter Jade Sanderlyn has published a summary of the current situation in the conflict against the Thargoids.<br>“Many of us who witnessed those terrifying events in HIP 22460 felt that it was both an ending and a beginning – that history had turned a page. Five months later, the Second Thargoid War has escalated to a point which may yet close the book altogether.”<br>“The arrival of the eight Maelstroms resulted in 44 populated systems being completely overwhelmed by the Thargoids. Dozens of neighbouring regions were also attacked by their fleets, leaving starports and settlements ablaze. Billions were killed and billions more fled from their homes as panicked refugees, creating the greatest humanitarian crisis of all time.”<br>“Despite the lack of coordination previously provided by Aegis and Salvation, anti-xeno efforts have been herculean. Allied, Federal and Imperial warships rapidly responded to form a vanguard against the invaders, and thousands of independent pilots have valiantly fought the Thargoid swarms across multiple battlefields.”<br>“Military experts believe that neutralising the Maelstroms will stem the endless waves of Thargoid vessels. Unfortunately, their caustic clouds and repulsing energy waves prevent our ships from exploring whatever resides within. They also generate the same disruptive field found in HIP 22460, which prevents any Guardian-based weapons from functioning within the system.”<br>“But there is hope. A small but steady flow of unclassified relics, those strange artefacts recovered from Thargoid surface sites after the Proteus Wave fired, have made their way to Professor Ishmael Palin and Ram Tah. A leading theory is that they share esoteric properties with several of the Thargoids’ recent technological advances, and may hold the key to developing countermeasures. Many other scientists are focusing on xenological research, striving to locate a weakness or develop an advantage.”<br>“Until such a breakthrough occurs, we are reliant upon our spacefaring warriors to contain the most destructive adversary the human race has ever faced. This is Jade Sanderlyn for Vox Galactica. Stay safe out there.”"},{"title":"Experimental Weapon Stabiliser Initiative Begins","field_galnet_date":"19 JAN 3309","imageList":["NewsImage_fleetcarriers4"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Azimuth Biotech has requested deliveries to LHS 1163 to manufacture a module that increases AX weapons capacity. <br>A press release from the corporation’s PR division stated:<br>“Azimuth’s dedication to defeating the Thargoids, which stretches back more than a century, has reached a new milestone with the development of our experimental weapon stabiliser.”<br>“This proprietary invention redistributes the physical stresses that AX weapons place upon a ship’s infrastructure. The class 3 and class 5 variants allow ships to be outfitted with one or two additional AX weapons respectively.”<br>“Supplies of meta-alloys, insulating membranes, HN shock mounts and beryllium are required to begin mass production of our successful prototypes. All shipments should be delivered to the Glorious Prospect megaship in the LHS 1163 system. Sufficient resources will allow the class 3 variant of the experimental weapon stabiliser to become available immediately, with the class 5 variant reaching the market a short time later.”<br>The opportunity to increase hardpoint capacity for anti-xeno combat ships has been broadly welcomed. But critics have noted that Azimuth Biotech stands to commercially benefit from this contribution  to the conflict, which many believe was triggered by its Proteus Wave operation in the HIP 22460 system.<br>A spokesperson for Operation Wych Hunt, an independent community established to oppose Azimuth Biotech, offered this statement:<br>\"The proposed modules will benefit humanity in the fight against the ongoing Thargoid threat and we support anybody who takes advantage of them. But this does not absolve Azimuth Biotech of the terrible acts that they committed under the leadership of Caleb Wycherley. The company still must be held accountable for the many atrocities it has committed, including the inhumane experiments of Project Seraph and the vile murder of thousands onboard the Alexandria.\""},{"title":"Princess Aisling Echoes Aegis Reformation Calls","field_galnet_date":"16 JAN 3309","imageList":["NewsImageImperialCityscape"],"field_galnet_body":"Princess Aisling Duval has publicly asked Emperor Arissa Lavigny-Duval to reconsider pledging Imperial resources to a cross-superpower anti-xeno initiative.<br>Her message was shared on all Imperial newsfeeds:<br>“The Empire’s capability to defend itself is not in question. But neither is there any doubt that we are facing a protracted war. The ferocity and scale of the Thargoid onslaught on human space is unprecedented. Of course the Empire will survive, as it has for over a millennium… but at what cost? How many systems must fall? How many citizens will grieve for lost loved ones?”<br>“Emperor Arissa, I implore you: work with the Alliance and Federation to reform Aegis. Our combined resources are needed to develop new technologies to overcome the alien armadas. Corporate interests must not dictate this path. Let Imperial ingenuity and courage light the way to victory over a common enemy.”<br>A handful of senators supported Princess Aisling’s plea initially, though others have criticised her for daring to challenge the Emperor’s decree. As yet there has been no response from the Imperial Palace.<br>Gudrun Vestergaard , royal correspondent for The Imperial Herald, commented:<br>“There is speculation that this may cause friction between Aisling and her cousin Hadrian Duval, whose long-held isolationist beliefs are now aligned with Imperial policy. Until now both have enjoyed a close relationship, with Aisling even being chosen as honour-mother to Hadrian’s baby son Hector. But their views on Imperial foreign policy could not be more different, and recent events have brought this into sharp focus.”"},{"title":"Azimuth Announces Experimental Weapons Stabiliser","field_galnet_date":"12 JAN 3309","imageList":["NewsImage_megaship2"],"field_galnet_body":"Azimuth Biotech has revealed prototypes of a module which improves hardpoint capacity for AX ships at the TZ Arietis Weapon Expo.<br>The event showcased a range of military products to entice governments, corporations and private groups into contracts with arms suppliers. But the current demand for anti-xeno weaponry meant that Azimuth Biotech’s announcement gained the greatest media attention.<br>CEO Torben Rademaker delivered a presentation on the expo’s main stage:<br>“Azimuth’s experimental weapons stabiliser is designed to redistribute the physical stresses that experimental modules place upon a ship’s structural integrity. Its unique technology will allow ships to utilise AX weapons above the current limit of four, expanding a pilots’ options when engaging Thargoid vessels.”<br>“The medium variant of our stabiliser allows one additional experimental weapon to be installed, while the large variant can facilitate two additional experimental weapons. Both stabilisers support the enhanced AX missile racks and multi-cannons that recently became available.”<br>“While I have your attention, I’d like to add that Azimuth utterly condemns the recent pardon of the war criminal Aden Tanner. It is shocking that Aegis’s unprovoked attack against our headquarters at Hind Mine could be glossed over so easily. We have informed the Federation that Azimuth has no intention of relinquishing our ownership of the Musashi, the megaship commanded by Tanner during his failed attempt to steal company assets.”<br>During the weapons expo, Azimuth Biotech made successful deals to commercially manufacture its experimental weapons stabilisers. An initiative is being planned to acquire the raw materials needed to establish mass production."},{"title":"Admiral Tanner Receives Presidential Pardon","field_galnet_date":"09 JAN 3309","imageList":["NewsImageFederalCityscape"],"field_galnet_body":"The court martial verdict of Admiral Aden Tanner has been officially overturned by an executive order from President Zachary Hudson.<br>In November 3307, Tanner attempted to take control of Hind Mine starport while in command of the Musashi megaship. He claimed that databanks at the headquarters of Taurus Mining Ventures – as Azimuth Biotech was then known – contained evidence that Salvation’s anti-xeno superweapons were designed to attract the Thargoids into populated systems before they were deployed. <br>A legal review last September, after the Proteus Wave was used to entice Thargoids to HIP 22460, substantiated Tanner’s claims. His sentence was commuted to time served, but his dishonourable discharge was upheld. This granting of clemency by President Hudson quashes the convictions of mutiny and unlawful military action.<br>The Office of the Federal President published the following:<br>“Aden Tanner has an impressive and honourable record of service to the Federation, including a key role as chief military liaison to Aegis. His brief violation of protocol has since been accepted as based on sound intelligence. President Hudson therefore believes that Tanner’s in-depth experience in combating Thargoid forces is too valuable to disregard, considering the current situation.”<br>A brief statement was also made by Fleet Admiral Tayo Maikori:<br>“I fully support this presidential pardon, which is in the best interests of all citizens. Admiral Tanner has been formally reinstated and is already being briefed on strategic plans regarding the Thargoids.”<br>“I’d like to stress that I believe the Federal Navy Criminal Court’s original verdict was just and fair, given all available information at the time. This executive action does not undermine the court’s crucial role in maintaining order among enlisted personnel.”"},{"title":"Subject D-2 Departs on Lone Mission","field_galnet_date":"05 JAN 3309","imageList":["NewsImageArrivingShip"],"field_galnet_body":"Mystery surrounds the unexpected disappearance of Seo Jin-ae, who has reportedly departed the facility she’d been staying at.<br>Professor Alba Tesreau provided a statement to the media:<br>“Seo Jin-ae’s mental and physical health have improved over the past three months, with the discomfort caused by her cortical implant significantly reduced. This afternoon, I learned that she failed to attend a routine therapy appointment, and was soon found to have left the facility altogether. Somehow Seo managed to depart without logging her ID at the primary entry point.”<br>“Initially I feared that she had been abducted by Azimuth operatives, sent by the company which subjected her to horrific neurosurgical procedures. But I soon received a time-delayed communiqué from Seo explaining her departure was voluntary. She offered heartfelt thanks to me and other former Aegis members for our help, but declared: ‘I have unfinished business with Salvation.’”<br>“I don’t know what this refers to, since Salvation died in HIP 22460. Seo is a headstrong and determined individual who clearly prefers operating alone. I believe she should not be travelling without protection, though. Her ability to interpret the Thargoids’ actions could make her a target for those who mean her harm. I urge anyone who encounters her to alert local authorities.”<br>Azimuth Biotech offered a response from Director Nassim Qadir , head of the corporation’s medical research division:<br>“This erratic activity from Ms Seo displays typical characteristics of delusion and paranoid obsession with Salvation, whose death has been confirmed by eyewitness reports. We must question what type of ‘medical help’ she has been subjected to, if it forced her to abscond in this fashion. She would receive far more effective therapeutic care at our facilities.”"},{"title":"A Retrospective of 3308 (Part Three)","field_galnet_date":"02 JAN 3309","imageList":["CommunityNewsFeed_17"],"field_galnet_body":"The concluding article in a series by historian Sima Kalhana, providing an overview of last year’s key events.<br>“The aftermath of the Battle of HIP 22460 was an unsettling time. With Salvation dead, Azimuth Biotech fell under new management and struggled to maintain prominence. The Empire withdrew from further collaborations with the other superpowers. And despite widespread fears of Thargoid reprisals, a xeno-peace movement sought diplomacy with the aliens to prevent further conflict.”<br>“September brought further mysteries with sightings of eight swirling anomalies in deep space, detectable by ship scanners within a certain range. Initially assumed to be stellar phenomena, these rogue signal sources were later discovered to be travelling faster than light.”<br>“Professor Alba Tesreau continued to call for Aegis to be reinstated, and held a symposium in October to outline her plans. This was gatecrashed by a woman named Seo Jin-ae, formerly Subject D-2 in Azimuth’s notorious Project Seraph experiments. Her neural link to a Thargoid vessel provided a degree of insight into the aliens’ behaviour. With Tesreau’s help, she later claimed the rogue signal sources were of Thargoid origin, summoned in response to events in HIP 22460.”<br>“The Far God cult was overjoyed by the Thargoids’ recent victory, but its radical True Chapters sect was accused of sharing classified media from HIP 22460 which included the ‘Thargoid roar’. The Federation outlawed the religion, forcing the True Chapters megaships to flee.”<br>“By November, it was confirmed that all eight rogue signal sources were approaching the core systems. Congressman Dalton Chase arranged for the xeno-peace movement to outfit the Kingfisher megaship, which was sent to meet and communicate with one of the so-called ‘stargoids’. It was swiftly destroyed, establishing a grim prelude for the bloodshed to follow.”<br>“Taranis, the first of the anomalies, arrived in Hyades Sector FB-N b7-6 on 29th November, manifesting as a colossal gas cloud. This Maelstrom immediately unleashed vast numbers of Thargoid vessels into neighbouring systems, ferociously attacking all orbital and planet-based habitats.”<br>“The remaining seven Maelstroms arrived during December, empowering the Thargoids to invade and conquer systems. Superpower militaries, anti-xeno squadrons and independent pilots rushed to their defence, but were clearly unprepared for an onslaught of such magnitude.”<br>“By the end of 3308, Thargoid forces were raging across the core systems, causing millions of casualties and displacing millions more from their homes. The cataclysmic events of the past year have cast a chilling shadow over the future, with only one certainty: that 3309 will be dominated by the Second Thargoid War.”"},{"title":"Azimuth Conducts AX Weapons Research","field_galnet_date":"03 JAN 3309","imageList":["NewsImage_settlements3"],"field_galnet_body":"The corporation Azimuth Biotech has outlined its plans to support the war effort against the Thargoids by improving ship anti-xeno firepower.<br>CEO Torben Rademaker was interviewed on The Tau Ceti Journal’s official ICE-cast, where he explained:<br>“As you may recall, one of the many reasons Aegis became redundant was its poor record in improving AX armaments past the initial rush of designs. Azimuth Biotech has established a research and development division specifically designed to correct their failings at a steady, sustainable pace.”<br>“One of the inherent limitations with Aegis’s designs is the maximum number of AX weapons that a ship can be outfitted with. The enhanced versions based on Ryder and Nemo’s designs share this limitation. We seek to increase the upper limit of AX weapons a ship can utilise, and our research teams are already reporting promising results.”<br>One of the ICE-cast’s interactive audience questions asked why Azimuth was not working with Proteus Wave technology to build more anti-xeno superweapons. Rademaker replied:<br>“Under my guidance, the corporation has moved away from Salvation’s esoteric field of research and adopted a more conventional direction. It seems clear to me that the superweapon project led by my predecessor was, ultimately, a failure.”<br>Rademaker also answered an accusation that Azimuth was responsible for the loss of life in HIP 22460, and that he should face trial for ‘causing the Thargoid Maelstroms’:<br>“Sadly, I often come across such simplistic blame-seeking from those with limited comprehension of the issue. The plain fact is that nobody could have predicted the Thargoids’ excessive reaction to our activities in HIP 22460. The Proteus Wave was deemed an acceptable means of ending the war, approved by individuals with far more military experience than Salvation could claim.”<br>Rademaker’s only response to a subsequent barrage of abuse from a member of Operation Wych-Hunt was less verbose. The interview feed was terminated."},{"title":"A Retrospective of 3308 (Part Two)","field_galnet_date":"30 DEC 3308","imageList":["CommunityNewsFeed_6"],"field_galnet_body":"Sima Kalhana continues her review of the most significant historical events that occurred during the past year.<br>“In May 3308, the Thargoid invasions of the Didio, Novas and Sosong systems were completely repelled by the use of Salvation’s unique superweapons. This convinced the Alliance, Empire and Federation to support Azimuth Biotech in developing this Guardian-based technology, with Salvation claiming that he could end the Thargoid threat forever.”<br>“Elsewhere that month, the Kumo Crew syndicate faced civil war as pirate rebels tried to replace Archon Delaine. Eventually his loyal forces triumphed, with the Blue Viper Club dredger clan fleeing his reprisals. And in the Federation, trillionaire entrepreneur Zachary Rackham announced his presidential candidacy for the 3309 election.”<br>“June saw the Golconda generation ship repaired and updated by the Artificers Clan. This provided the majority of its original inhabitants, descended from Earth colonists, the opportunity to resume their spacefaring lifestyle.”<br>“The news around this time was dominated by Salvation, particularly when he rebranded Taurus Mining Ventures as Azimuth Biotech. The scientist, once named Dr Caleb Wycherley, admitted that the corporation had evolved out of the notorious Azimuth Biochemicals. But Allied, Federal and Imperial leaders chose to ignore this, having pinned their anti-xeno strategy on Salvation’s superweapon technology.”<br>“HIP 22460 was the system chosen to construct the Proteus Wave. This interfaced Guardian technology with a Thargoid ground settlement, and was designed to deliberately attract the Thargoids before wiping them out. During July and August, upgraded capital ships along with independent pilots defended Azimuth Biotech’s operation from swarms of Thargoid vessels.”<br>“After weeks of intense combat and delivering vital supplies, the Proteus Wave was activated on 9th August. Initially it seemed successful, rendering the Thargoids powerless, but an unexpected second energy pulse from the planetary site had the same effect on all human ships. The resulting massacre saw the Thargoids take control of the HIP 22460 system, establishing a permanent presence.”<br>“Salvation was dead. Azimuth Biotech’s plans had failed. The superpowers were in retreat. And speculation grew about an unearthly alien screech heard in HIP 22460, dubbed the ‘Thargoid roar’.”"}]