[{"title":"Manhunt for Theta Seven Escalates","field_galnet_date":"12 NOV 3307","imageList":["NewsImageFederalCityscape"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Affiliated Counter-Terrorism unit has acquired an encrypted message that may reveal Theta Seven’s location.<br>ACT successfully captured most of the bomb-making engineers known as Theta Group, and has now prioritised hunting down the NMLA’s de facto leader.<br>This latest breakthrough was explained by Captain Milo Castile:<br>“Theta Group managed to delete most of their data prior to capture, but we retrieved a short message that they received on the 31st of July. At this point most of Theta Group were being harboured by Neo-Marlinist sympathisers within the Marlinist Colonies, but Theta Seven and his closest aides had fled to an unknown destination.”<br>“Unfortunately the message has been encrypted using a pre-arranged cipher key, without which its contents are unreadable. It is unclear why this wasn’t transmitted via the NMLA’s dark-comms network, which remains undetectable despite our best efforts.”<br>“As it’s possible that this was sent by Theta Seven, we welcome any assistance from the galactic community in decoding it. This ruthless terrorist must be tracked down before he can take more innocent lives.”<br>ACT has requested that all newsfeeds publish the encrypted message, which is as follows:<br>61-76-126-67-99-74-71-113-81-41-96-103-51-117-55-103-91-69-104-117-84-114-141-134-90-108-90-79-115-95-102-102-98-76-91-57-83-104-92-99-96-78-79-83-132-115-80-106-91-150-114-105-148-144-93-163-83-138-123-94-108-115-81-128-147-162-131-140-150-129-29-98-99-59-74-125-55-123-107-112-98-108-82-91-124-71-75-111-109-95-129-89-155-135-98-131-149-97-151-105-152-152-144-128-155-64-81-123-89-90-87-96-59-116-127-52-94-103-51-89-51-47-98-88-61-112-112-111-129-147-124-153-134-109-87-114-121-80-90-113-111-153-131-84-104-131-84-151-113-129-130-117-105-123-73-99-126-106-118-144-97-83-123-104-75-78-90-49<br>There is a substantial reward on offer for the first person to submit a correctly deciphered version of this message to ACT."},{"title":"Aegis Renegades Attack Salvation’s Allies","field_galnet_date":"11 NOV 3307","imageList":["NewsImageStarportCobra"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>A rogue Aegis Defense force has initiated conflict with Taurus Mining Ventures in the T Tauri system.<br>The megaship Musashi is commanded by Aegis’s chief military liaison Admiral Aden Tanner, who made this announcement:<br>“The Hind Mine asteroid base contains proof that Salvation’s unlicensed anti-xeno weapon is intentionally designed to provoke the Thargoids, and therefore endangers us all. As Taurus Mining Ventures refuses to cooperate, we have no choice but to obtain the evidence by force.”<br>“This may be our only opportunity to discover Salvation’s true ambitions. I urge all independent pilots who have fought alongside Aegis to help us complete this vital mission.”<br>Patience Middleton, a spokesperson for Taurus Mining Ventures, responded:<br>“This is an illegal attack that jeopardises the important work we are undertaking on behalf of Salvation. It is in the galactic community’s interests to defend our corporate headquarters.”<br>Aegis officially stated that Admiral Tanner is acting on his own authority, and that the Musashi’s presence in the T Tauri system is in direct violation of orders. Despite this, there are reports that Tanner has tacit support from many members of Aegis, who disagree with the public inquiry that has suspended its operations."},{"title":"Colonia Bridge Gains Further Resources","field_galnet_date":"11 NOV 3307","imageList":["NewsImageExpansionExploration"],"field_galnet_body":"*Pilots Federation ALERT*<br>Successful campaigns in the Alcor and Colonia systems will result in new megaships being added to the Colonia Bridge.<br>Large quantities of ceramic composites, computer components and thermal cooling units were provided at either end of the route between the core systems and the distant Colonia region.<br>Brewer Corporation provided an update on the project: <br>“Once again, the galactic community has provided the vital materials required to construct dockable megaships. These additional ports should be operational by the 25th of November, making journeys to and from Colonia easier and safer.”<br>“Pilots can now collect their rewards from Macdonald Settlement in the Alcor system and Jaques Station in the Colonia system. We shall also be awarding an engineered frame shift drive with long range and fast boot to the majority of contributors.”<br>The top ten pilots who delivered materials to Alcor and Colonia will shortly be invited to submit suggestions to name the new megaships. Submissions will be subject to review by the Brewer Corporation board of directors. To ensure a variety of choice, only pilots who have not yet submitted names for the Colonia Bridge megaships will be eligible.<br>"},{"title":"Long-Lost Research Facility Discovered","field_galnet_date":"10 NOV 3307","imageList":["NewsImageSidewinderExploring"],"field_galnet_body":"*Pilots Federation ALERT*<br>A distress call has led independent pilots to locate an abandoned settlement in the Snake Sector GW-W c1-1 system.<br>The SOS was initially detected by one of the megaships that form the Colonia Bridge, inspiring many ships to search nearby systems. The source was eventually identified as Holloway Bioscience Research Facility 15 on the moon Snake Sector GW-W c1-1 AB 5 b.<br>Pilots unearthed a series of mission logs recorded in the year 3255 by a freelance military unit named Excalibur Troop. As yet, the contents of these logs have not been made available to newsfeeds.<br>Aanya Gupta, CEO of the Holloway Bioscience Institute, gave a statement to the press:<br>“Research Facility 15 was one of the first wave of planetary survey laboratories established by our founder, the esteemed scientist Lord Roland Holloway. Our records of these settlements are patchy, so we are grateful that this has been located.”<br>“Unfortunately, we can find no data regarding Excalibur Troop or the circumstances under which they were contracted. Our investigative teams are on-site to gather further information.”<br>The Holloway Bioscience Institute refused to comment on rumours that a previously unidentified life form had been encountered by the research facility’s original crew.<br>"},{"title":"No Progress with Dredger Deadlock ","field_galnet_date":"09 NOV 3307","imageList":["NewsImageDiplomacyPressConference"],"field_galnet_body":"The nomadic Scriveners Clan continues to resist Orion University’s attempts to take possession of their dredger.<br>Freelance reporter Casey Kilpatrick published an update from the Oochost PC-C c29-0 system:<br>“Orion University’s claim that the vessel is their property has been countered by Advocacy’s reminder of laws preventing cultural contamination. So the question now is: who actually owns the dredger? Is it the families that have lived there for generations, or the organisation which originally built it?”<br>“Various solutions have been proposed to resolve this stand-off. These include an offer from Canonn Interstellar Research Group to purchase the dredger from Orion University, gift it to the Scriveners Clan then publicly share the contents of their mysterious Knowledge Core.”<br>“However, two centuries of isolation have instilled this academia-focused society with a pathological need to protect its research. They are no more likely to cooperate than a deeply religious nation asked to hand over its most holy artefact.”<br>“Orion’s megaship Scientia Aeterna is still transmitting requests to communicate. I have even seen one of its secondary craft narrowly avoid being consumed by the dredger’s maw while searching for an access point. But the Scriveners are locked down tight, and this siege situation shows no sign of ending.”"},{"title":"ACT Captures Theta Group","field_galnet_date":"08 NOV 3307","imageList":["NewsImageBountyCollection"],"field_galnet_body":"The creators of the NMLA’s caustic enzyme bombs have been arrested, although the terrorist figurehead Theta Seven remains at large.<br>Theta Group is directly responsible for 17 starport bombings conducted by the NMLA across the core systems. These attacks resulted in a combined death toll of almost 800,000 people, with twice as many suffering serious injury.<br>Senior Agent Tanya Ramirez, one of the Affiliated Counter-Terrorism unit’s co-leaders, told the media:<br>“We have finally tracked down the NMLA’s bomb-making engineers, and a joint task force made the arrest with minimal casualties. Large quantities of Thargoid corrosives and explosive components were also seized.”<br>“This achievement was only possible due to intercepting Theta Group’s communications with Neo-Marlinist sympathisers. We are unsure why the NMLA’s dark-comms network was not used in that instance.”<br>“As our intel predicted, the group’s leader Theta Seven was not among those we captured. We have confirmed that he and a handful of followers disappeared after the bombings in July, anticipating their imminent capture. ACT will not rest until the galaxy’s most wanted terrorist has been brought to justice.”<br>The name ‘Theta Group’ was assigned to the bomb-makers during their incarceration at Serene Harbour, an Imperial Intelligence penal facility in the R CrA Sector AF-A d42 system. After escaping, their leader adopted his prisoner designation – Theta Seven – as a reaction to what he viewed as dehumanising treatment of Neo-Marlinists by the Empire.  "},{"title":"Aegis Leader Opposes Salvation","field_galnet_date":"05 NOV 3307","imageList":["NewsImageDiplomacyPressConference","FederationIconNewsImage"],"field_galnet_body":"Admiral Aden Tanner has called for Aegis to reject the public inquiry’s shutdown and take direct action against Salvation.<br>The Musashi, an Aegis Defense megaship under his command, has entered the T Tauri system to challenge Taurus Mining Ventures. The corporation has performed activities on Salvation’s behalf, including preparation for the anti-xeno weapon used to eliminate all Thargoids from the Cornsar system.<br>Admiral Tanner transmitted this message to media outlets:<br>“Salvation’s unlicensed weapons technology is deliberately designed to provoke the Thargoids, risking millions of lives. My sources tell me that Hind Mine asteroid base contains evidence of this. I therefore demand that Taurus Mining Ventures allows us access so we can determine the truth.”<br>Patience Middleton of Taurus Mining Ventures responded:<br>“We are a legitimate business under contract to a private citizen, whose activities are protected by confidentiality agreements. These threats have no legal standing and are not welcome.”<br>Admiral Tanner is a highly decorated Federal Navy officer and Aegis’s chief military liaison, having coordinated many combat efforts against the Thargoids. The Musashi’s relocation has been condemned by Aegis leadership, and Tanner has been ordered to depart the T Tauri system.<br>"},{"title":"Colonia Bridge Project Enters Phase Two","field_galnet_date":"04 NOV 3307","imageList":["NewsImageDiplomacyPressConference","FederationIconNewsImage"],"field_galnet_body":"*Pilots Federation ALERT*<br>Brewer Corporation requests deliveries in the Alcor and Colonia systems for the next phase of the Colonia Bridge project.<br>A successful initiative in October resulted in the placement of 30 dockable megaships at intervals of several hundred light years, providing services such as refuelling and repairs. The second phase seeks to establish this support for the full route between the core systems and the Colonia region.<br>A press release from Brewer Corporation stated:<br>“We are now ready to continue work on the Colonia Bridge, by constructing additional megaships to fill the middle of the planned route. As before, we require shipments of ceramic composites, computer components and thermal cooling units at Macdonald Settlement in the Alcor system or Jaques Station in the Colonia system.”<br>“Should deliveries reach sufficient levels, the top 75% of contributors will be awarded an engineered frame shift drive with increased range and faster boot sequence. Our hope is that this encourages deep space explorers and long-distance haulers to take part in the Colonia Bridge project.”<br>As an additional reward, the top ten contributors at Alcor and Colonia will be invited to submit naming suggestions for the new megaships. Submissions will be subject to review by the Brewer Corporation board of directors. To ensure a variety of choice, only pilots who have not yet submitted names for the Colonia Bridge megaships will be eligible."},{"title":"Demands for Federal Rebellion Decline","field_galnet_date":"03 NOV 3307","imageList":["NewsImageFederalCityscape","FederationIconNewsImage"],"field_galnet_body":"Many factions have seceded from the Federation in recent months, but recent polls suggest the likelihood of further withdrawals is waning.<br>The Federal Times published an update on the situation by political correspondent Sofia Trevino:<br>“Some negative reaction to the Proactive Detection Bureau was anticipated. But it’s unlikely that Congress foresaw nearly forty systems abandoning the Federal Accord, as their governing factions declared independence.”<br>“Fears that this would spiral into mass rebellion now seem misplaced, however. This is partly thanks to the PDB’s recent role in preventing Jupiter’s Wrath from committing terrorist acts. Although that group is hardly in the NMLA’s league, evidence that communications surveillance can save lives seems to have convinced some Federal citizens to reconsider their opposition.”<br>“President Hudson’s efforts against the breakaway factions were hailed by his supporters and decried by his opponents. But the Federal Diplomatic Corps remain displeased that Hudson suffered no repercussions for violating diplomatic immunity when attempting to capture Yuri Grom.”<br>“Shadow President Winters continues to call for the PDB to be shut down to prevent the Federation from becoming an authoritarian police state. But many accuse her rhetoric on civil liberties to have triggered the secessions in the first place.”<br>“Meanwhile, many Federal factions are carefully observing those who did become independent. Their future success or failure may well determine whether or not this rebellion continues.”"},{"title":"Hadrian Duval Accepts Senate Protection","field_galnet_date":"02 NOV 3307","imageList":["NewsImageImperialCityscape","EmpireIconNewsImage"],"field_galnet_body":"The Empire has officially proclaimed Hadrian Augustus Duval and his wife Lady Astrid Minerva-Duval to be wards of the Senate.<br>The offer of senatorial protection was made following an NMLA attempt to assassinate them and their unborn child by bombing Dyson City starport.<br>Prior to being transported from the Paresa system to a secure location, Hadrian Duval sent this message:<br>“Lady Astrid and I accepted this offer with enormous reluctance. Neither of us wish to abandon our home or loyal followers. Yet we feel it is a matter of duty to protect our family and ensure future generations of the Duval bloodline.”<br>“Nova Imperium will henceforth be known as Nova Paresa. It will continue to serve as a staunch ally of the Empire, as per the Treaty of Paresa. To all those who fought for our cause over the years, I assure you that history will never forget us. Memento Mordanticus!”<br>There has been public support for Praetor Leo Magnus to assume leadership of Nova Paresa. Hadrian Duval has endorsed his former head of security taking his place, but confirmed that the title of Imperator is now defunct.<br>In related news, ACT stated that its investigation into the Dyson City attack has yielded results. Although details remain embargoed for security reasons, a significant breakthrough is expected to be announced soon.<br>"},{"title":"Advocacy Defends Dredger Clan","field_galnet_date":"01 NOV 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"The Scriveners Clan’s legal ownership of their dredger has been supported by the civil rights organisation Advocacy.<br>The ancient Dredger-class bulk cruiser, currently located in the Oochost PC-C c29-0 system, is inhabited by a nomadic tribe descended from the vessel’s original crew. Orion University claims that the cruiser is its commercial property, but has failed to make contact with its occupants.<br>Rhiannon Grady, director of Advocacy, explained:<br>“For centuries, there has been widespread legislation to protect remote communities from cultural contamination. These laws apply to micro-societies, such as those found aboard generation ships, that evolved in isolation.”<br>“Therefore, Orion University should not presume to deprive over ten thousand people of the only home they have ever known. Unlike cases such as the Golconda, which requested emergency assistance, in this case we are legally and morally obliged to respect the status quo.”<br>Professor Elizabeth Perez, head of anthropology at Orion University, responded:<br>“I was involved with the Golconda aid efforts, and fully appreciate the delicacy of this situation. But the dredger’s age and condition makes it a hazardous environment for its people. Evacuation should be considered for their own safety, with appropriate measures to minimise cultural disruption.”<br>The university’s megaship, Scientia Aeterna, has halted attempts to gain access to the Scriveners Clan dredger. However, it has not withdrawn its remote override of the vessel’s hyperdrive.<br>"},{"title":"Initial Stage of Colonia Bridge Operational","field_galnet_date":"29 OCT 3307","imageList":["NewsImageExpansionExploration"],"field_galnet_body":"*Pilots Federation ALERT*<br>Thirty megaships have been placed between the core systems and the Colonia region to serve as stationary ports.<br>Twenty-five dockable megaships were sent out from the Alcor system toward Colonia, taking position in systems approximately 400 to 500 light years apart. Five further megaships have been established from the direction of the Colonia system.<br>Each vessel serves as a permanent way station for travellers and businesses, designed to improve the journey to and from Colonia. A variety of services are provided, including tritium refuelling for Drake-class fleet carriers.<br>The Colonia Bridge is the product of Brewer Corporation, which ran a highly successful deliveries campaign to collect resources. The megacorp has confirmed that phase two of this project will commence next week.<br>During the creation of the Colonia Bridge, the crew aboard the stationary megaship Memories of Oresrati in the Snake Sector OD-S b4-2 system reported an unusual incident. A distorted transmission that could have been an SOS was detected on long-range sensors. Although they were unable to triangulate its source, the signal strength suggested a point of origin within 50 light years.<br>"},{"title":"The View from Colonia","field_galnet_date":"29 OCT 3307","imageList":["NewsImageExpansionExploration"],"field_galnet_body":"Vox Galactica’s culture correspondent Lishan Abara looks at the Colonia region, the largest enclave of humanity outside the core systems:<br>“Colonia. A place that few ever see, which exists following a computer malfunction. The famed Jaques Station suffered a mis-jump on its scheduled journey to Beagle Point, relocating some 22,000 light years from Sol. The subsequent rescue effort led to the establishment of the first permanent base in what is now considered a new frontier for humanity.”<br>“Over the last five years, courageous explorers have struck out to inhabit several dozen local systems. This, in turn, invited a steady stream of colonists seeking a fresh start. Nearly 13 million souls now count this remote area as their home.”<br>“This is a place beyond the influence of the superpowers and mega-corporations, and most residents prefer it that way. The Colonia Council works hard to maintain order, helping local organisations function along cooperative lines. There have been a handful of regional conflicts, but generally you’re less likely to witness trouble out here.”<br>“Having become self-sufficient early on, Colonia’s healthy economy encourages both traders and tourists to make the long journey. The scientific community maintains a notable presence, a notable example is the Holloway Bioscience Institute, which studies the many vacuum-dwelling life forms found in the Colonia Nebula.”<br>“Independent and faction-aligned pilots are catered to, with shipyards and even a fleet carrier construction dock found in the area. Local engineers such as Baltanos, Eleanor Bresa, Rosa Dayette and Yi Shen also offer suit and personal equipment modifications to those who make a living working on low-atmosphere worlds.”<br>“With the Colonia Bridge project well underway, it will soon be easier than ever to cross the interstellar gulf and reach this distant haven. Businesses, settlers and visitors alike may find themselves increasingly drawn to the Colonia experience.”"},{"title":"Thargoid Fleets Invade Nebula Systems","field_galnet_date":"28 OCT 3307","imageList":["NewsImageThargoidIncursion"],"field_galnet_body":"*Pilots Federation ALERT*<br>Several inhabited systems in the Pleiades and Witch Head Nebulas have come under attack by large numbers of Thargoid ships.<br>An emergency has been declared by the authorities in multiple systems including Asterope, Shenve and Onoros. Thargoid vessels have again targeted starports, with casualties estimated in the many thousands.<br>Increased Thargoid activity has also been reported in the California and Coalsack Nebulas. Independent pilots and anti-xeno squadrons are moving to defend the invaded systems and evacuate survivors from damaged starports.<br>Aegis is not currently able to assist, as the operational shutdown enforced by the public inquiry has led to many ships and pilots being withdrawn from service. Admiral Aden Tanner, chief military liaison to Aegis, commented: <br>“Many of us in Aegis are frustrated that the Baumann Report has tied our hands. I am also convinced that these Thargoids are reacting aggressively to the weapon of mass destruction that Salvation deployed in the Cornsar system. Not only should we be fighting the alien threat, but Salvation must be prevented from escalating the war.”<br>The Taurus Mining Ventures megaship Bright Sentinel has moved to the Merope system at Salvation’s request. Reports indicate that tech brokers on board are offering a Guardian-hybrid plasma charger as well as material cost discounts to support the anti-xeno effort."},{"title":"Resources Boost for Torval Mining Ltd","field_galnet_date":"28 OCT 3307","imageList":["NewsImageArrivingShip"],"field_galnet_body":"*Pilots Federation ALERT*<br>Vital materials have been delivered to the EGM 559 system to sustain Senator Zemina Torval’s new corporation.<br>The megaship Pride of Bitterwood received multiple shipments of geological equipment, microbial furnaces and mineral extractors. These will be transferred to Torval Orbital in the LTT 198 system, supplying the starport acting as the primary base of operations for Torval's new venture.<br>Operations director Constantia Torval announced the campaign’s conclusion:<br>“All of us here at Torval Mining Ltd are pleased with the contributions. These supplies will ensure that we meet our first year’s targets and continue providing high-quality services to our customers in the Empire.”<br>Torval Mining Ltd was originally a subsidiary of Mastopolos Mining, but became autonomous following a rift between Zemina Torval and her cousins in the Mastopolos family. The two corporations are now commercial rivals in the Empire’s industrial mining market.<br>The megaships Champion of Commerce and The House Ascendant have recently jumped to the Laguz and 21 Eridani systems, respectively. These vessels represent part of the corporate fleet recently purchased by Torval Mining Ltd."},{"title":"Alliance and Marlinists Address Refugee Crisis","field_galnet_date":"26 OCT 3307","imageList":["NewsImagePressConferenceAlliance","AllianceIconNewsImage"],"field_galnet_body":"The Marlinist Colonies have offered to provide help for political refugees who sought sanctuary in Alliance space.<br>In 3306, the Empire’s security forces began arresting followers of Marlinism, suspecting them of being linked to the NMLA. Many pro-republican Imperial citizens fled to the Federation, but some set course for the Alliance instead.<br>The situation has been highlighted by Prime Consul Kayode Tau of the Marlinist Consulate:<br>“Having made a desperate journey for survival, over a million Marlinists are now dispersed across Alliance territory. Most are clustered in small groups, lacking basic supplies and facing extreme deprivation. Some Alliance systems have offered citizenship, but others are attempting to expel them as illegal immigrants.”<br>“The Empire wishes to repatriate these people, which means harsh interrogation for some and lifelong persecution for others. I hope to negotiate with the Alliance to arrange an alternative – transportation to the Marlinist Colonies. There they will be welcomed into the democratic society established by their brethren.”<br>Ambassador Elijah Beck, head of the Alliance Office of Diplomatic Relations, has agreed to meet with Prime Consul Tau to examine solutions. The Imperial Diplomatic Corps officially refused an invitation to join this discussion."},{"title":"Senators Offer to Protect Hadrian Duval","field_galnet_date":"25 OCT 3307","imageList":["NewsImageImperialCityscape"],"field_galnet_body":"The recent NMLA attack in the Paresa system has encouraged the Imperial Senate to reach out to Imperator Hadrian Duval.<br>An official pronouncement was made by Senator Caspian Leopold:<br>“A majority of us believe that preserving the Duval bloodline is paramount for the future of the Empire. Hadrian Duval is not officially a member of the Imperial Family but he is the grandson of Emperor Hengist, meaning his as-yet unborn child is also of royal lineage.”<br>“The NMLA has already murdered many Duvals, including Prince Harold. Indeed, Hadrian himself barely survived an assassination attempt last year. It’s clear that the Empire can provide greater security than he currently has, and it is our duty to do so.”<br>“Therefore, we propose making both Hadrian and Lady Astrid wards of the Senate. They will be placed under the highest level of protection, at least until this grave threat has abated.”<br>Imperator Hadrian Duval is currently holding discussions with a delegation from the Senate. Political observers believe that their proposal may be conditional on him severing ties with Nova Imperium, an isolationist organisation that was once outlawed in the Empire.<br>Independent newsfeeds have speculated that since the NMLA’s terror campaign began, Emperor Arissa Lavigny-Duval has been under similar senatorial protection and performing her duties from a secure location."},{"title":"Scriveners Clan Resists Orion University","field_galnet_date":"22 OCT 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"The spacefaring tribe that lives aboard an ancient dredger has refused to allow Orion University to take possession of the vessel.<br>Vox Galactica published an eye-witness account by freelance reporter Casey Kilpatrick from the Oochost PC-C c29-0 system:<br>“Once the Scriveners Clan was found, it wasn’t long before Orion University arrived. Their megaship, Scientia Aeterna, remotely disabled the dredger’s hyperdrive using a series of override codes. These had been unearthed from the university’s archives, along with evidence that the ship – commissioned in 3088 as Dredger J-403 – legally belongs to them.”<br>“Despite being unable to escape, the Scriveners have made a stand. All requests to communicate were roundly ignored. I’ve watched several craft try to dock with the dredger, only to be met with sealed airlocks and an electrified hull.”<br>“It’s clear that these people are unwilling to give up their home simply because of centuries-old legislation. But it’s also apparent that Orion University is interested in more than just reclaiming lost property…”<br>“The Scriveners possess something that they refer to as a Knowledge Core, which contains everything that this scholarly society has learned during its long voyage. What discoveries might this database contain? And how far will the university go to get their hands on it?”"},{"title":"Torval Mining Ltd Requests Resources","field_galnet_date":"21 OCT 3307","imageList":["NewsImageArrivingShip"],"field_galnet_body":"*Pilots Federation ALERT*<br>Senator Zemina Torval’s new corporation requires deliveries of commodities to its megaship in the EGM 559 system.<br>Constantia Torval, the senator’s daughter and operations director of the company, provided details of the initiative:<br>“Now that we are a fully independent business, additional resources are urgently needed to continue providing services to the Empire. My goal is to ensure that the Torval name remains synonymous with efficiency and dedication.”<br>“Shipments of geological equipment, microbial furnaces and mineral extractors can be delivered to the megaship Pride of Bitterwood in the EGM 559 system. From there, they will be transferred to our headquarters at Torval Orbital in LTT 198.”<br>The Pride of Bitterwood is part of a corporate fleet recently purchased by Torval Mining Ltd. Most are currently in the LTT 198 system being outfitted for mining and transport operations. Business analysts believe that these megaships were funded by Zemina Torval after selling the majority of her shares in Mastopolos Mining."},{"title":"Federal Agents Crush Jupiter Division Extremists","field_galnet_date":"20 OCT 3307","imageList":["NewsImageFederalCityscape","FederationIconNewsImage"],"field_galnet_body":"A pro-corporatist group planning a series of terror attacks has been shut down by the Federal Intelligence Agency.<br>An update on the operation was delivered by Deputy Director Bethany Blake, who runs the Proactive Detection Bureau:<br>“Special forces have now arrested the organisers of the underground organisation called Jupiter’s Wrath. This was a collection of citizens radicalised by Jupiter Rochester into believing that they could replace democratically elected leaders with corporate overlords.”<br>“This successful operation was only possible thanks to information provided by the PDB. Without this surveillance network, we would be entirely unaware of Jupiter’s Wrath and many leading politicians may have lost their lives.”<br>“Our analysts are now updating the PDB’s algorithms to highlight citizens who are at risk of radicalisation. We will prevent domestic terrorism by identifying those being corrupted by hostile ideologies.”<br>In response, Congressman Bai Zheng was quoted in The Federal Times:<br>“This is an unnerving development in the PDB’s evolution. It’s also what many of us in Congress feared. We are not targeting people who have committed a crime, but people whose personal opinions are unpalatable to the government.”"},{"title":"Jokers’ Deck Hunts the Winking Cat","field_galnet_date":"19 OCT 3307","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"Francesca Wolfe of the Wallglass Investigations Agency has sent a final report from her infiltration of the secretive gambling circle.<br>“The bad news is that Jokers’ Deck security caught up with me as I was trying to sneak onboard a ship to get off-planet. The good news is that they didn’t gun me down, or even threaten to press charges. Instead, they offered me a job!”<br>“Lexi October, the current host, was surprisingly gracious. Turns out she’s a fan of the Galactic Mysteries pieces that Gunnarson and I run, but more importantly, she believes we could give her what she really wants – the Winking Cat.”<br>“She explained that the Joker playing card that was stolen is hugely symbolic to the group, having belonged to its original founder. She also assured me that Jokers’ Deck is extremely private but not criminal. Its members sign legal waivers, and there is a strict honour code to ensure all bets are paid.”<br>“So, Lexi October wants to hire us to track down the infamous Winking Cat thief and retrieve the ceremonial playing card. This may also be a way for her to save face with her fellow super-rich gamblers, who are understandably unhappy about the exposure.”<br>Erik Gunnarson, Wolfe’s detective partner, added:<br>“It’s a huge relief that Wolfe is safe, but what has she got us into now? Will we really be able to catch the Winking Cat? I wouldn’t bet on it.”"},{"title":"Scriveners Clan Dredger Located","field_galnet_date":"18 OCT 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"*Pilots Federation ALERT*<br>The dredger inhabited by the nomadic Scriveners Clan has been found within the Oochost PC-C c29-0 system.<br>Independent pilots conducted a search for the vessel in response to a request from Orion University, which claims that the Dredger-class bulk cruiser is its commercial property.<br>Vice Chancellor Leland Pettigrew announced the operation’s success:<br>“Congratulations to the pilots who managed to locate Dredger J-403. The university will shortly dispatch a megaship to take ownership and arrange repatriation for its current occupants.”<br>The dredger is currently orbiting an ice world in the Oochost PC-C c29-0 system. It is believed to be collecting raw material from planetary rings to sustain its onboard systems, a design feature that allows it to remain self-sufficient indefinitely.<br>There has been no communication with the Scriveners Clan, the spacefaring tribe descended from an academic institute that was later absorbed into Orion University. It is known that they shun contact with all outsiders to protect their Knowledge Core, a repository of research conducted over the past two centuries."},{"title":"NMLA Aims to ‘Extinguish the Duval Line’","field_galnet_date":"15 OCT 3307","imageList":["NewsImageImperialPalace"],"field_galnet_body":"The Neo-Marlinist Liberation Army has taken responsibility for the attack on Dyson City starport in the Paresa system.<br>The primary targets were Imperator Hadrian Duval and his wife Lady Astrid Minerva-Duval, who is pregnant with his child. Although they survived, the bombing left many thousands dead and injured.<br>The following message was sent across NMLA propaganda channels:<br>“As long as a single Duval is left alive, the Republic of Achenar cannot be rebuilt. It is our duty to extinguish that entire line and free our people from Imperial oppression.”<br>Praetor Leo Magnus gave a statement on behalf of ACT:<br>“It is significant that this latest broadcast is not from Theta Seven, the NMLA’s mouthpiece and de facto leader. We believe that Theta Group – the team of weaponsmiths that built the caustic enzyme bombs – has split in two.”<br>“According to the communications we intercepted, Theta Seven and half of his followers went into hiding after the attacks against the Marlinist Colonies in July. The others continued their terror campaign and were responsible for this latest atrocity. ACT is currently pursuing leads and hopes to learn more soon.”<br>Nova Imperium has repeated a call for pilots to help rescue survivors from Dyson City in the Paresa system."},{"title":"Terrorist Attack at Hadrian Duval’s HQ ","field_galnet_date":"14 OCT 3307","imageList":["NewsImageStationDamaged"],"field_galnet_body":"*Pilots Federation ALERT*<br>Explosions have struck Dyson City starport in the Paresa system, home of Hadrian Duval’s organisation Nova Imperium.<br>The starport suffered severe structural damage plus the corrosive effects of caustic enzymes, characteristic of the customised weapons used by the NMLA. Initial reports state that over fifteen thousand people have been killed and a similar number injured.<br>The following statement was issued by Praetor Leo Magnus, the former head of security for Nova Imperium who was seconded to ACT:<br>“Shortly before this attack, my team intercepted a communication between suspected Neo-Marlinist supporters. This referred to an imminent attempt to kill Imperator Hadrian Duval, Lady Astrid Minerva-Duval and their unborn child.”<br>“I immediately ordered the Praetorian Guard to move the Imperator’s family off-station, which was achieved minutes before the bombs detonated. I am pleased to report that they survived this brutal attack, but unfortunately the remaining population could not have been evacuated in time.”<br>A state of emergency has been declared in the Paresa system, with an urgent request for independent pilots to assist with rescuing survivors from Dyson City starport.<br>The Empire confirmed that as per the Treaty of Paresa, it will provide military and medical support to Nova Imperium. ACT is performing investigations to learn more about the attack.<br>"},{"title":"Colonia Bridge Project Receives Deliveries","field_galnet_date":"14 OCT 3307","imageList":["NewsImageStationConstruction"],"field_galnet_body":"*Pilots Federation ALERT*<br>Twin initiatives in the Alcor and Colonia systems have procured materials to construct new dockable megaships.<br>Brewer Corporation made an announcement regarding its Colonia Bridge project:<br>“A positive response has led to generous shipments of ceramic composites, computer components and thermal cooling units being received. As a result, Brewer Corporation can now commence work on enhancing the transportation infrastructure between the core systems and the Colonia region.”<br>“Thanks to the dedication of the galactic community, 30 dockable megaships will be placed along the Colonia Bridge route by the 28th of October. These will serve as stationary ports, providing vital facilities for travellers. Planning is already underway for the second phase of this project, placing further megaships every four to five hundred light years working out from the Alcor and Colonia systems.”<br>“Payment for contributing pilots is now available at Macdonald Settlement in the Alcor system and Jaques Station in the Colonia system. Both starports also offer a temporary discount on purchasing and outfitting to owners of our Drake-class Carriers.”<br>Brewer Corporation will soon be reaching out to the top ten pilots from both the Alcor and Colonia initiatives, to provide naming suggestions for the dockable megaships being placed on the route to Colonia. Submissions will be subject to review by the Brewer Corporation board of directors.<br>"},{"title":"Orion University Searches for Dredger","field_galnet_date":"14 OCT 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"*Pilots Federation ALERT*<br>Rewards are being offered by Orion University to locate the Scriveners Clan dredger, which it claims as its legal property.<br>The self-sustaining Dredger-class bulk cruiser was launched two centuries ago by an academic institute that was later absorbed by the university. Since then the dredger has become the home for a nomadic tribe called the Scriveners Clan, which refuses contact with all outsiders.<br>Vice Chancellor Leland Pettigrew told the media:<br>“Orion University is willing to reward pilots who can pinpoint the dredger’s current location. We believe it is still within 500 light years of the Perseus Dark Region KC-V c2-2 system.”<br>“Pilots who are interested in helping should first dock at Ring Mine station in the 2MASS J03291977+3124572 system, to automatically sign up to the search operation. Our associates at the starport, Deep Space Mining, will provide further information including details of the reward.”<br>"},{"title":"Federal Terrorist Network Exposed","field_galnet_date":"13 OCT 3307","imageList":["NewsImageFederalCityscape","FederationIconNewsImage"],"field_galnet_body":"The Proactive Detection Bureau has been instrumental in identifying violent corporatist extremists within the Federation.<br>Deputy Director Bethany Blake of the Federal Intelligence Agency gave a statement to the media:<br>“In recent weeks, our surveillance algorithms flagged a series of coded communications for investigation. We found that a network of radicalised citizens were discussing plans to assassinate members of Congress and leading political figures.”<br>“This movement, which calls itself Jupiter’s Wrath, is inspired by Jupiter Rochester’s failed attempt to enable corporations to directly rule the Federation. Their goal was to enact revenge on those who they consider to be the ‘enemies of Jupiter Division’.”<br>“Using data intercepted by the Proactive Detection Bureau, FIA agents performed a series of coordinated strikes in several Federal systems. Over a thousand armed extremists were arrested before they could act. We are currently working to identify the remaining Jupiter’s Wrath members.”<br>Vice President Jerome Archer claimed that this was further validation of the Domestic Counter-Terrorism Act, which permitted the PDB to be established. However, Shadow President Felicia Winters commented:<br>“I commend the FIA for performing their duties. But I also question the timing of this operation, coming so soon after President Hudson’s appallingly reckless attempt to capture Yuri Grom. To me it seems calculated to show his administration in a positive light, while ignoring the violation of citizens’ privacy.”"},{"title":"Orion University Claims Ownership of Dredger","field_galnet_date":"13 OCT 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"The ancient spacefaring home of the Scriveners Clan is the legal property of Orion University, according to newfound historical records.<br>The Scriveners Clan is a nomadic tribe travelling onboard a self-sufficient Dredger-class bulk cruiser. Their society is descended from an academic organisation that sent out a research fleet two centuries ago. Unlike some dredger clans, they refuse to have any contact with outsiders.<br>Vice Chancellor Leland Pettigrew of Orion University made this statement:<br>“In the year 3088, Dredger J-403 was commissioned for an exploration mission by an academic institute named Scrivener College. This was absorbed into our university in 3125. Documents detailing these facts were recently discovered in our archives and verified by the courts.”<br>“Therefore the dredger, including all of its contents, is legally owned by Orion University. Naturally we bear no ill will toward its current populace, but the vessel they inhabit has always been our commercial property.”<br>The Scriveners Clan dredger was last seen in the Perseus Dark Region KC-V c2-2 system, where it was salvaging the Hesperus megaship. On the 9th of July it made a hyperspace jump to an unknown destination within 500 light years.<br>Orion University is the largest independent educational institution in the core systems, rivalled only by the Imperial Science Academy and Olympus Village University.<br>"},{"title":"Jokers’ Deck Hit by Art Thief","field_galnet_date":"12 OCT 3307","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"The secretive gambling circle of the super-rich has been raided by the notorious criminal known only as the Winking Cat.<br>The information was revealed by Francesca Wolfe of the Wallglass Investigations Agency, who infiltrated the event. Her report, which was relayed from an unidentified location, has been published by her fellow detective Erik Gunnarson.<br>“I’m not sure this will reach Gunnarson, but I must try. After the security alert the staff started getting their IDs checked, which might have revealed mine to be fake. I managed to slip out of the warehouse and into an abandoned industrial district. I still don’t know what planet I’m on, but I’ve found an old comms transmitter to send this message.”<br>“Before I escaped, I learned what had caused the alert. There was a VIP ceremony involving the group’s most precious possession: an ancient Joker playing card. Apparently this has been passed between senior members of Jokers’ Deck for centuries, always held by the current host. But when Lexi October publicly unveiled the card, she found it had been replaced by one showing a different graphic – a winking cat.”<br>“It’s two years since we’ve heard from the galaxy’s greatest larcenist, but there’s no doubt that only the Winking Cat’s legendary skills could have circumvented their security systems. I’m fascinated that a battered scrap of card has greater value than any of the billion-credit items being wagered here.”<br>“Guards are searching for the thief now. I hope I can get off-world before they find me instead. They’re armed to the teeth and not in the mood to talk…”"},{"title":"Corporate Split between Mastopolos and Torval ","field_galnet_date":"08 OCT 3307","imageList":["NewsImageImperialPalace"],"field_galnet_body":"Senator Zemina Torval’s company Torval-Mastopolos Mining has become fully independent from its parent corporation.<br>The former subsidiary of Mastopolos Mining has officially rebranded itself as Torval Mining Ltd. Zemina Torval is listed as its CEO, with her eldest daughter remaining as operations director. The starport Torval Orbital in the LTT 198 system serves as the company’s headquarters.<br>Business correspondent Anton Lagorio reported for The Imperial Herald:<br>“Although Torval Mining Ltd is now an independent company, shares are legally transferable between it and Mastopolos Mining. This has allowed loyal supporters of both Zemina Torval and Gabriella Mastopolos to flock to each other’s banner. As a result, Torval Mining Ltd has acquired many ships, staff and resources from its former parent.”<br>“There have been assurances that the split was amicable and in line with Imperial traditions of honourable conduct. Constantia Torval has promised customers that mining and transportation services would be maintained to the same high standard.”<br>“Speculation continues over what caused this unexpected rift between the Torval and Mastopolos families. It seems that Zemina Torval is focusing on providing benefits for her own children and grandchildren, rather than her cousins on the Mastopolos side, but the reason for this change of heart remains unclear.”"},{"title":"Twin Initiatives for Colonia Bridge Project","field_galnet_date":"07 OCT 3307","imageList":["NewsImageStationConstruction"],"field_galnet_body":"*Pilots Federation ALERT*<br>Delivery campaigns in the Alcor and Colonia systems aim to improve journeys to the distant colonies.<br>The Colonia Bridge project is being funded by Brewer Corporation, which outlined the details in a press release:<br>“The Colonia region has great potential for businesses and travellers, but the long voyage can be prohibitive. Brewer Corporation is investing in the transportation infrastructure between the core systems and Colonia, to make crossing those thousands of light years easier.”<br>“Up to 30 dockable megaships will be placed along the route to Colonia, providing travellers with valuable respite and resources including tritium. These stationary megaships should be operational by the 28th of October, and will mark the completion of the first phase of the three-phase Colonia Bridge project. Its aim is to place dockable megaships every four to five hundred light years working out from the Alcor and Colonia systems.”<br>“To achieve this, we require large quantities of ceramic composites, computer components and thermal cooling units. These can be delivered to either Macdonald Settlement in the Alcor system or Jaques Station in the Colonia system.”<br>The Colonia Council is subsidising part of the initiative, due to the importance of this enterprise. As a consequence, the commodity requirements for the megaships at Jaques Station are reduced.<br>Brewer Corporation has confirmed that as well as offering payment for the materials, it will ask the top ten contributors at Alcor and Colonia to submit potential names for the new megaships. Submissions will be subject to review by the Brewer Corporation board of directors.<br>As an added incentive, there will be temporary discounts on purchasing and outfitting fleet carriers at both Macdonald Settlement and Jacques Station, based on pilots’ contributions."},{"title":"Yuri Grom Victorious Against Federation","field_galnet_date":"07 OCT 3307","imageList":["NewsImageRebellionFederation"],"field_galnet_body":"*Pilots Federation ALERT*<br>The battle between Delta Pavonis Galactic Interstellar and EG Union has concluded successfully for Yuri Grom’s forces.<br>Freelance war correspondent Karleen Troy reported via Vox Galactica:<br>“For the past week, the Delta Pavonis system has been aflame with ship-to-ship engagements. But despite a fierce effort from Federal auxiliaries, EG Union was able to muster superior numbers.”<br>“Eventually the Federal flagship, Freedom’s Foundation, was boarded. I picked up comms chatter that described intense fighting before EG Union soldiers overran Federal troops. Since then I’ve learned that Yuri Grom has agreed to let the surviving crewmembers leave, but is claiming the megaship as ‘spoils of war’.”<br>The following message was sent by Yuri Grom on public channels:<br>“President Hudson has revealed his true nature as the corrupt heart of the Federation’s rotting carcass. This treachery will not be forgotten.”<br>Pilots who supported Yuri Grom can collect their rewards from the Indomitable megaship. Delta Pavonis Galactic Interstellar confirmed that although the Freedom’s Foundation is now under EG Union control, reimbursement for all Commanders who fought for Delta Pavonis Galactic Interstellar will be processed remotely by the 9th of October 3307."},{"title":"An Undercover Report on Jokers’ Deck ","field_galnet_date":"05 OCT 3307","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"Francesca Wolfe of the Wallglass Investigations Agency provides an inside view of the Jokers’ Deck gambling circle.<br>“Gunnarson’s intel was correct. The latest host is multi-billionaire investor Lexi October, the lady who rescued Supratech from bankruptcy. We’re in one of October Consortium’s disused warehouse complexes, which looks derelict on the outside but is a fabulous glittering palace within. I don’t actually know what planet I’m on, since all the servants – including me with my fake ID – were transported here in total secrecy.”<br>“Jokers’ Deck is exactly what you’d expect of a luxury casino for the super-rich. Exquisite food, sumptuous clothes, and dozens of games from deadlock poker to Giant Verrix racing. Wagers are made using billion-credit chips, precious gemstones and even land deeds to an entire continent. And that’s not counting the VIP rooms that I can’t get into.”<br>“I’ve served exotic drinks to several famous faces, such as Duchess Rouncival and Scorpio DeVorrow. I’ve seen Senator Leatrix talking earnestly to Ambassador Rochester about a princess they both know. Arch-Corsairs Trask and Volantyne from the Kumo Council are here, taking on Zachary Rackham at the roue mortelle tables. And there’s no mistaking the voice of Alliance megastar Xiona whenever she wins big.”<br>“Oh, and who should walk in just now but… wait, I can hear an alarm. Looks like a security alert. Damn it, have they detected me? I should – ”<br>The message was published by Erik Gunnarson, who added this coda:<br>“I’ve heard nothing more from Wolfe since receiving this, and she didn’t check in at a scheduled rendezvous point. I’ve decided to share her report as a warning to Jokers’ Deck. If anything happens to her, just remember we know who you are.”"},{"title":"Ambassador Condemns Entrapment of Yuri Grom","field_galnet_date":"04 OCT 3307","imageList":["NewsImageShipyardFederal"],"field_galnet_body":"The Federal Diplomatic Corps has officially denounced President Hudson’s attempt to capture Yuri Grom in the Delta Pavonis system.<br>The political conference was to determine whether the system’s ruling faction would ally with the EG Union or the Federation. It was abandoned when a Federal black ops team attempted to arrest Yuri Grom’s delegation, triggering a conflict in the system.<br>Ambassador Delphine Dumont told The Federal Times:<br>“We have no option but to state that our own government has violated the conventions of diplomatic immunity. This conference was established in good faith with all parties. We were not informed that any hostile act against EG Union was planned.”<br>“I offer my personal apologies to Yuri Grom. Our negotiations were spirited but honest, and I genuinely felt that progress was being made.”<br>This is the first time that the Federal Diplomatic Corps has distanced itself from the actions of a sitting president. Political observers believe that this is to maintain its reputation for integrity, especially in dealings with the Alliance and Empire.<br>Public reaction in the Federation has been varied, with President Zachary Hudson being praised and criticised in equal measure. Insiders within his administration suggest that he is under enormous pressure to regain popularity, following the recent rebellion of several Federal systems."},{"title":"Torval Loses Control of Mastopolos Mining","field_galnet_date":"01 OCT 3307","imageList":["NewsImageImperialPalace"],"field_galnet_body":"Senator Zemina Torval has relinquished her long-held position as Mastopolos Mining’s majority shareholder.<br>Official reports confirmed that the board of directors passed a resolution to remove Zemina Torval from their number. Over half of her shares were then sold, thereby drastically reducing her personal influence on the corporation.<br>An anonymous insider gave a statement to The Imperial Herald:<br>“Gabriella Mastopolos made it crystal clear to the other shareholders that it was time to topple Zemina Torval from her perch. But what surprised them was Torval’s lack of resistance to this pressure… almost as if she had been planning to step down all along.”<br>“I’ve heard that every credit made by selling the shares went straight into the subsidiary that her daughter is running. So maybe all her eggs are going into that basket?”<br>In related news Constantia Torval, operations director for Torval-Mastopolos Mining, made an announcement:<br>“I am proud to announce that the people of LTT 198 have elected Torval-Mastopolos Mining to replace LTT 198 State Ltd as their controlling authority. Permits to gain entry to the system can be earned via the Pride of Bitterwood megaship, which remains in the nearby EGM 559 system.”"},{"title":"Yuri Grom Targeted by Federal Strike","field_galnet_date":"30 SEP 3307","imageList":["NewsImageShipyardFederal"],"field_galnet_body":"*Pilots Federation ALERT*<br>The Delta Pavonis political conference has erupted into conflict between EG Union and Delta Pavonis Galactic Interstellar.<br>Yuri Grom, the ruler of EG Union, broadcast this message:<br>“This conference was nothing more than a trap! My delegation was apprehended at gunpoint by a squad of undercover Federal agents. Sacrifices made by my loyal guards enabled us to escape from Kessler City, only to find our ships under attack. The Federation has declared war – I will respond in kind!”<br>President Zachary Hudson gave an official statement:<br>“Yuri Grom is a traitor and a dangerous threat to Federal security. We cannot ignore any opportunity to eliminate this ruthless tyrant.”<br>Delta Pavonis Galactic Interstellar has asked for Federal auxiliaries to provide combat support to its forces. In return, the EG Union called for help from “allies of Yuri Grom and enemies of the Federation”.<br>Grand Duke Simion Petrescu, the host of the political conference, has rejected claims that his faction was secretly working with the Federation to entrap Yuri Grom. The Federal Diplomatic Corps has not yet commented on its role in these events."},{"title":"Saud Kruger Receives Exploration Data ","field_galnet_date":"30 SEP 3307","imageList":["NewsImageExpansionExploration"],"field_galnet_body":"*Pilots Federation ALERT*<br>Enormous amounts of data on Earth-like worlds has been collected for a campaign by shipbuilding firm Saud Kruger.<br>The data is highly valuable to the corporation’s subsidiary, Astrogator Tours, which runs holiday cruises across the galaxy and is seeking new locations.<br>The initiative was declared a success by CEO Stanislav Kruger:<br>“Not only have we received data about highly promising systems, but many creative Commanders provided imagery guaranteed to entice adventure-seekers to these new worlds. We are deeply grateful to all pilots who took part.”<br>Vistaenis Incorporated, Saud Kruger’s partner in this initiative, is now offering payment for the exploration data at Youll Port in the Vistaenis system. <br>Tourist beacons will be added to the most suitable systems by Thursday the 28th of October, which will record for posterity the names of the pilots who submitted the most compelling images.<br>As a result of the initiative, a discount of 15% will be applied to sales of all Dolphin, Orca and Beluga Liner ships from the 1st of October, alongside a reduction in cost for the luxury-class cabins which can be installed in any of Saud Kruger’s vessels."},{"title":"Galactic Mysteries: Jokers' Deck","field_galnet_date":"29 SEP 3307","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"Erik Gunnarson of the Wallglass Investigations Agency discusses the secretive gambling circle attended by the galaxy’s wealthiest players.<br>“Casinos and gaming hubs have always been popular, tempting people to risk their credits for the chance to score a lucrative win. But where do the billionaires and trillionaires go to enjoy that buzz?”<br>“Jokers’ Deck is a highly exclusive gambling event attended only by the rich and powerful. Nobody knows who runs it, only that it’s held in a different location each time. Its attendees are guaranteed – and can afford – total anonymity.”<br>“There was one exception. In 3305, Wallglass was hired to find the heiress Lady Talitha Ambrose, after she vanished along with her family’s fortune. I was part of the team that discovered she had gambled away 300 billion credits at Jokers’ Deck in a high-stakes game of deadlock poker. Their security was so tight that we never learned much more.”<br>“This year I’ve been tracking several rumours, such as Jokers’ Deck being present at the Galactic Summit and inviting political leaders to settle their differences at the roue mortelle table. But thanks to some costly bribes – which hopefully I can claim back as expenses – I’ve finally got a solid lead.”<br>“My partner, Francesca Wolfe, and I should have more to reveal soon. With a little luck we will gain a unique insight into this most privileged of gambling dens. Assuming we play our cards right...”"},{"title":"Salvation: Friend or Foe?","field_galnet_date":"27 SEP 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"The anonymous Salvation commands much support in the galactic community, but a resistance movement has emerged to sabotage his efforts.<br>Vox Galactica featured a special report from freelance journalist Alexei Keel:<br>“In his self-proclaimed war against the Thargoids, Salvation recently scored a major victory by eliminating their forces from the Cornsar system. But the ongoing mystery around the identity of this ‘man of science’, as well as his controversial methods, have led to a backlash.\"<br>“To deliver vital components for his mysterious anti-xeno weapon, Salvation once again recruited independent pilots, directly messaging those who had performed tasks for him before. However, this time a counter-initiative was formed by those who did not trust his motivations. It was also supported by believers in non-aggression against the Thargoids, and others who feared that the weapon might endanger Cornsar’s population.”<br>“Their actions involved acquiring the components, which were disguised as basic medicines, but destroying rather than delivering them. Whether or not this partial blockade impacted the weapon’s effectiveness remains unknown, but it acted as a substantial opposition to Salvation’s scheme.”<br>“Aegis is investigating the Cornsar incident, but with faith in that organisation at an all-time low, individual Commanders are now taking matters into their own hands. Time will tell if Salvation’s ambition to replace Aegis is a noble goal, or if we are replacing the devil we know with a darker demon.”"},{"title":"Progress Between Federation and Yuri Grom ","field_galnet_date":"24 SEP 3307","imageList":["NewsImageDiplomacyPressConference"],"field_galnet_body":"Negotiations between the Federation and self-styled dictator Yuri Grom are underway to determine the Delta Pavonis system’s allegiance.<br>Political correspondent Conrad Sterling published an update for Vox Galactica:<br>“In recent years, Yuri Grom has developed a degree of mystique. He was one of the few leaders not to attend the Galactic Summit, and news from within his dominion was scarce. But now he is visibly relishing the opportunity to confront Federal representatives under the protection of diplomatic immunity.”<br>“Initial exchanges were belligerent as both sides argued over who would be the most beneficial partner. This was to be expected since Delta Pavonis is one of the Federation’s founding systems, and it would be a significant coup for EG Union to establish a presence so close to Sol.”<br>“What was unexpected was the mutual respect that gradually developed between Yuri Grom and Ambassador Delphine Dumont. Her charming manner clearly appealed to the dictator, even bringing forth his thunderous laughter on occasion.”<br>“A deal is now being discussed that would allow the Autocracy of Delta Pavonis to have trade and political ties with both parties while remaining independent. Perhaps the Federation has learned some lessons from the recent rebellion, and perhaps Yuri Grom’s hatred of the superpower he once served is finally abating.”"},{"title":"Saud Kruger Seeks New Holiday Worlds","field_galnet_date":"23 SEP 3307","imageList":["NewsImageExpansionExploration"],"field_galnet_body":"*Pilots Federation ALERT*<br>An initiative to gather data on potential tourist destinations has been launched by shipbuilding corporation Saud Kruger.<br>The luxury passenger ship manufacturer aims to identify new Earth-like planets that would be attractive to holidaymakers. These trips will be managed by its subsidiary, Astrogator Tours.<br>CEO Stanislav Kruger announced the campaign to the press:<br>“We are keen to acquire data on Earth-like worlds, to assess their suitability as destinations for future holidaymakers seeking the adventure of a lifetime. However, all exploration data is valuable and will earn generous payments.”<br>“In addition, our marketing department is keen to receive images of eye-catching sights found within unpopulated systems containing Earth-like worlds, to spot the most potentially exciting additions to the Astrogator Tours catalogue.”<br>Vistaenis Incorporated has agreed to organise the initiative on behalf of Saud Kruger. Contributing pilots are invited to deliver exploration data to Youll Port in the Vistaenis system. They can also submit their most compelling images by Thursday the 30th of September. <br>By Thursday the 28th of October, the most suitable locations will receive tourist beacons and credit the Commander for their submission where appropriate.<br>If successful, Saud Kruger’s Dolphin, Orca and Beluga Liner ships will be reduced in price for one week from Friday the 1st of October, with the percentage dependent on the volume of data received. There will also be a discount on the luxury-class cabins used by these crafts to transport VIP passengers."},{"title":"Salvation Takes Credit for Repelling Thargoids","field_galnet_date":"22 SEP 3307","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"The anonymous ‘man of science’ Salvation has claimed responsibility for the Thargoids’ unexplained departure from the Cornsar system.<br>Salvation had predicted their attack, but his claim was discounted by Aegis and other authorities. After a few days the Thargoid vessels fled abruptly, leaving behind wreckages across the system.<br>The following message was transmitted on public channels:<br>“This is Salvation. The Thargoid invasion of Cornsar has now been repulsed, thanks to prototype anti-xeno weaponry that I have been developing for some time. I have achieved what Aegis could not – an effective deterrent against the alien threat.”<br>“Refinement of this weapon is at a critical stage, so I cannot reveal any details. I only regret that my warning was not heeded in time to save everyone on the two starports.”<br>“This triumph was only possible thanks to those loyal pilots who answered my call. Rewards will shortly be available from the Bright Sentinel megaship in the Mbooni system.”<br>Salvation’s identity and capabilities remain unknown, but he has established a reputation as a rival to Aegis. He is also knowledgeable about Azimuth Biochemicals, a research company connected to the earliest recorded encounters with Guardian and Thargoid artefacts."},{"title":"An Heir for Hadrian Duval","field_galnet_date":"21 SEP 3307","imageList":["NewsImageImperialCityscape"],"field_galnet_body":"Lady Astrid Minerva-Duval, wife of Hadrian Augustus Duval, has confirmed that she is expecting a child in December.<br>The story was broken by the Paresa News Network:<br>“Lady Astrid was visibly overjoyed as she told us of her pregnancy, and of Hadrian’s excitement at being a father. Her only complaint was that she’s no longer allowed to fly support missions for Nova Imperium. Once a Commander, always a Commander!”<br>Mainstream media channels also commented on the news.<br>The Imperial Herald: “This has caused tangible ripples of unease in the Senate. Since neither Emperor Arissa Lavigny-Duval nor Princess Aisling Duval have heirs, Hadrian’s claim to the throne will be strengthened if he alone ensures that the Duval bloodline continues.”<br>Eye on Achenar: “Who cares about the spawn of Emperor Hengist’s illegitimate grandson? The NMLA may have assassinated much of the Imperial Family, but this outcast boy is still a footnote in their noble history.”<br>Vox Galactica: “Despite his unofficial status, Hadrian Duval has many silent supporters within the Empire. His isolationist stance appeals to nostalgic citizens, as does returning to the tradition of male Emperors. Should Hadrian have a son, he may feel empowered to seek his birthright more forcefully.” "},{"title":"Thargoids Vanish from Cornsar System","field_galnet_date":"20 SEP 3307","imageList":["NewsImageThargoidIncursion"],"field_galnet_body":"*Pilots Federation ALERT*<br>The Thargoid vessels attacking the Cornsar system have unexpectedly departed from the region.<br>For the last four days, independent pilots and local security forces have been in combat against the alien ships. Although some were destroyed in battle, the remainder have abruptly withdrawn back into hyperspace.<br>The starports Chadwick Port and Ito Market sustained heavy damage during the assault, leaving thousands dead and wounded. Evacuation efforts are still underway to rescue the survivors from both stations.<br>Marshal Noah Sharrow, the ruler of Cornsar, made this statement:<br>“We cannot say why the Thargoids have gone, only that we are grateful they have. I thank all the brave pilots who fought valiantly to defend our people.”<br>Sightings of crashed Thargoid vessels on planetary bodies in the Cornsar system have been confirmed by Aegis observation teams. As yet there are no official explanations."},{"title":"Delta Pavonis Hosts Political Conference","field_galnet_date":"17 SEP 3307","imageList":["NewsImageDiplomacyPressConference"],"field_galnet_body":"Delegations from the Federation and the dictator Yuri Grom are meeting to determine the Delta Pavonis system’s future.<br>Both are on a diplomatic mission to convince its controlling faction to either swear allegiance to Yuri Grom or become a Federal member state. Delta Pavonis was one of the original signatories of the Federal Accord in 2242, but has recently been governed by an independent autocracy.<br>Yuri Grom himself is present, having arrived on the megaship Indomitable. Grom was once a respected admiral in the Federal Navy, before defecting with huge numbers of ships and followers. They established the independent EG Union, which he presides over as a military dictatorship.<br>The rival delegation is led by Ambassador Delphine Dumont of the Federal Diplomatic Corps. They were transported on the Freedom’s Foundation megaship courtesy of Delta Pavonis Galactic Interstellar, which formerly controlled the system. The ambassador invited newsfeeds to witness her initial introduction to Yuri Grom, who seemed slightly taken aback by her warm greeting.<br>Grand Duke Simion Petrescu, ruler of the Autocracy of Delta Pavonis, told attending journalists:<br>“The conference will take place in Kessler City on Reagan’s Legacy, where our distinguished guests will enjoy our famous hospitality. I look forward to learning more about their respective proposals.”<br>This is the first time that the Federation has diplomatically engaged with Yuri Grom. Political observers noted that this tactful approach may be due to several Federal factions recently declaring independence."},{"title":"Thargoid Strike Follows Salvation’s Prediction","field_galnet_date":"16 SEP 3307","imageList":["NewsImageThargoidIncursion"],"field_galnet_body":"*Pilots Federation ALERT*<br>The Cornsar system has been attacked by Thargoid forces, causing severe damage to two starports.<br>Direct assaults against Chadwick Port and Ito Market stations have resulted in over ten thousand casualties. Local reports state that Thargoid vessels have also appeared elsewhere throughout the system, placing millions more lives at risk.<br>The anonymous figure known as Salvation recently warned that Cornsar was in imminent danger of being invaded, having been alerted by his new xeno-detection network. Aegis could not verify Salvation’s claim and saw no evidence of any Thargoid presence.<br>The system’s ruler, Marshal Noah Sharrow of the Allied Cornsar Constitution Party, transmitted this message:<br>“This is a call to any pilots in the vicinity of Cornsar. We urgently need ships to defend our people from the Thargoids, and to rescue civilians trapped within Chadwick Port and Ito Market. This is a grave emergency!”<br>Aegis has released a brief statement:<br>“We can confirm there is a Thargoid presence in the Cornsar system. Unfortunately most of our operations and personnel remain suspended due to the public inquiry, so we cannot contribute to any anti-xeno efforts.”<br>There has been no further communication from Salvation, despite his accurate prediction of the attack."},{"title":"Pharma Giant Victorious in the Haithis System","field_galnet_date":"16 SEP 3307","imageList":["NewsImageTrade"],"field_galnet_body":"*Pilots Federation ALERT*<br>The Haithis Purple Dynamic Group has fought off the Kumo Council assault, securing the completion of Neomedical Industries’ onionhead project. <br>The pharmaceutical corporation had received deliveries to Haithis to begin producing onionhead gamma strain for medicinal purposes. In response, the Kumo Crew syndicate attacked Neomedical’s corporate partner but failed to achieve its objectives.<br>Neomedical Industries confirmed that investment in its project to mass-produce onionhead gamma strain has increased following the conflict’s resolution. The news was eagerly received in many Alliance and independent systems, which have expressed interest in the new healthcare treatment.<br>Olwyn Kendrick, CEO of Neomedical Industries, told the media:<br>“We owe a huge debt to the galactic community for defending our operation. Large-scale manufacture of onionhead gamma strain can now commence. We will soon be able to improve the quality of life for millions of people.”<br>The Haithis Purple Dynamic Group is offering rewards to its supporters from Crippen Port in the Haithis system.<br>"},{"title":"Salvation Warns of Thargoid Strike","field_galnet_date":"14 SEP 3307","imageList":["NewsImageStation"],"field_galnet_body":"The anonymous figure known as Salvation claims that Thargoid forces will shortly launch an assault in the Cornsar system.<br>The following message was received by all major newsfeeds:<br>“This is Salvation. Authorities in the Cornsar system must evacuate the local population immediately. I believe a Thargoid invasion of the system is imminent.”<br>“I became aware of this danger while developing a new interstellar xeno-detection network, which will be far superior to Eagle Eye. Although the network is not fully complete, we cannot dismiss this report as a false reading. Cornsar must act now.”<br>Carter Armstrong, a chief administrator with Aegis, delivered an official statement:<br>“Aegis cannot validate this claim. There is no indication of a Thargoid presence in the vicinity, and Cornsar is too far from their known territories to be a viable target. As most of our operations are suspended due to the public inquiry, we cannot dedicate any resources to investigate further.”<br>There was also a response from Marshal Noah Sharrow, who governs the Cornsar system on behalf of the Allied Cornsar Constitution Party:<br>“We have no interest in the games of one-upmanship between Aegis and Salvation. Nor do we believe for a moment that the Thargoids would go out of their way to harass us.”"},{"title":"Rebellion Spreads Through the Federation","field_galnet_date":"13 SEP 3307","imageList":["NewsImageRebellionFederation"],"field_galnet_body":"A further seven Federal factions have severed ties with the superpower in protest against government monitoring of communications.<br>These latest secessions have been undertaken by minor factions that do not control any systems, including Unktock Free, United Posenoi League and Progressive Party of Inggale.<br>Political journalist Sofia Trevino reported for The Federal Times:<br>“Eight factions had previously declared independence from the Federation, and now an even greater number forms the third wave of rebellion. It’s clear that their populations feel empowered to take a stand against losing their constitutional rights of privacy.”<br>“Vice President Archer shrugged off this latest development, maintaining that ‘the Proactive Detection Bureau performs a vital security role in these troubled times’. Since none of these latest factions currently govern a system, he may also believe that resistance to the PDB is on the wane.”<br>“Although these events have only impacted a small part of Federal territory, they remain an embarrassment for President Hudson’s administration. Shadow President Winters continues to implore Congress to repeal the Domestic Counter-Terrorism Act, but she has also taken political criticism since many feel her rhetoric inspired these factions to secede.”"},{"title":"Empire Marks Anniversary of NMLA Attacks","field_galnet_date":"10 SEP 3307","imageList":["NewsImageImperialCityscape"],"field_galnet_body":"A day of mourning has been declared across the Empire to mark the first anniversary of the NMLA’s Imperial starport bombings.<br>On Thursday the 10th of September 3306, Imperial stations in the Cemiess, Gabjaujis, LHS 4031 and Rabh systems were attacked without warning. Over sixty thousand people were killed and twice as many wounded by powerful explosives that delivered a caustic enzyme payload.<br>The Neo-Marlinist Liberation Army is an extremist paramilitary group that is dedicated to reforming Marlin Duval’s original republican government. Prior to these bombings, it had only performed minor strikes with low casualties.<br>The NMLA’s terror campaign grew to encompass all three superpowers with the Nine Martyrs attacks in March 3307. It also led to supporters of Marlinism fleeing from the Empire as refugees, eventually resettling in the Marlinist Colonies.<br>Princess Aisling Duval paid respects to the victims during a memorial ceremony at her palace on Emerald. She also spoke of her father Prince Harold Duval, who was assassinated by the NMLA shortly after the bombings.<br>Messages of condolence have been sent by President Zachary Hudson, Prime Minister Edmund Mahon, Imperator Hadrian Augustus Duval and First Minister Octavia Volkov. All vowed to continue contributing resources to ACT, which recently shut down many terrorist cells. Coupled with the loss of its political wing, the NMLA threat may finally be diminishing.<br>"}]