[{"title":"Aegis: ‘Arrest Salvation for Murder’","field_galnet_date":"03 JUN 3308","imageList":["NewsImageDiplomacyPressConference"],"field_galnet_body":"Claims that Salvation was once a senior member of Azimuth Biochemicals who worked for INRA have led to a public outcry.<br>Political journalist Conrad Sterling reported on these developments for Vox Galactica:<br>“Information recently uncovered in the DG Canum Venaticorum system has been presented by Professor Alba Tesreau. It suggests that Salvation’s real name is Dr Caleb Wycherley, former vice-president of research at Azimuth Biochemicals. According to Wycherley’s personal logs, his team contributed to the development of the controversial mycoid bioweapon deployed by INRA during the First Thargoid War.”<br>“Wycherley’s logs also provide evidence that he gained the nickname of ‘The Witch’. This figure has been implicated in the murderous attack on the Alexandria megaship in June 3307 and in Project Seraph recordings found in the HIP 26176 and HIP 22460 systems.”<br>“Former Aegis leadership has demanded that Salvation be arrested and questioned over his involvement in these events, and that superpower fleet support for Salvation’s work be suspended until such questions have been answered.” <br>Supporters of Salvation have dismissed the latest logs as fake, pointing out that Dr Wycherley would now be over 200 years old and that the mention of ‘salvation’ is coincidental. But outrage remains high over the unethical activities of both Azimuth and INRA, and Salvation’s growing influence over anti-Thargoid operations has been cast in a new light.<br>“The Alliance, Empire and Federation have all responded with noncommittal statements that the accusation will be investigated,” said Sterling. “However, since Salvation’s unique superweapons now form the cornerstone of their anti-xeno strategy, his arrest would be a major political and military inconvenience.”"},{"title":"Relaunching the Golconda","field_galnet_date":"02 JUN 3308","imageList":["NewsImageMap"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Traders and combat pilots are required in the Upaniklis system to assist the Golconda in resuming its voyage.<br>The ancient generation ship, which originated from Earth in the 22nd century, has been retrofitted by the Artificers Clan into a functional modern vessel. The majority of its former population have decided to leave the outpost Forester’s Choice and return to their traditional nomadic lifestyle.<br>Captain Jonathon Forester, leader of the Golconda Union, announced:<br>“In 3305 the galactic community provided us with the chance to end our original journey, so it will be fitting if they can help us start a new chapter among the stars. The Golconda now has a frame shift drive that requires tritium fuel, and shipments of medical diagnostic equipment and power generators are also needed.”<br>Upaniklis Vision Incorporated has agreed to organise the initiative. Pilots are asked to deliver all commodities to Fozard Port, from where they will be transferred aboard the Golconda.<br>Local security forces warned that pirates may attempt to hijack incoming shipments or take control of the Golconda itself. As a defensive measure, Upaniklis Vision Incorporated has offered bounties on all wanted ships in the system.<br>According to the Federal Diplomatic Corp, these events do not violate the legislation that protects isolated societies from cultural contamination. It added: “Partnership status with the Federation has been extended to the Golconda and continues to apply to Forester’s Choice outpost.”"},{"title":"The Plot to Depose Archon Delaine","field_galnet_date":"01 JUN 3308","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"Further information has emerged regarding Vidar Trask’s failed attempt to take control of the Kumo Crew syndicate.<br>The latest findings were reported by The Pegasi Sentinel:<br>“The few survivors from Trask’s shattered army have revealed that over a thousand fighters were supplied by the Blue Viper Club dredger clan. Kay Volantyne, one of its leaders, is now confirmed to have masterminded the coup alongside Trask.”<br>“Their motivations were as different as their backgrounds. Trask rose to power beside Archon Delaine but became frustrated under his rule, believing that he could reorganise the Kumo Crew along more efficient lines. Volantyne aimed to provide her nomadic tribe with permanent homes, to be financed by trafficking onionhead gamma strain and protected by the syndicate’s might.”<br>“We have also learned that the standard of living on the Blue Viper Club dredger has markedly improved in recent months. This was in accordance with the terms of the alliance that Volantyne brokered between the clan and the Kumo Crew.”<br>“According to engineers at Kumo City starport, the dredger’s modernised hyperdrive enables it to make jumps more frequently and over greater distances. This means it could now be almost anywhere within a several hundred light year radius, which may frustrate Delaine’s vow to hunt down Volantyne and exact revenge for her betrayal.”"},{"title":"The Golconda Resurrection","field_galnet_date":"31 MAY 3308","imageList":["NewsImageTrade"],"field_galnet_body":"With the generation ship Golconda being repaired by the Artificers Clan, its former population are considering resuming their journey.  <br>Commander Javi Alvarado, a local trader who befriended the Golcondans, offered this insight for Vox Galactica:<br>“Following a prompt from the Artificers Clan, I transported Captain Forester and other community leaders from Forester’s Choice to the Golconda. They were visibly awed at the changes made to their ancient home, with modern interface panels and machinery expertly entwined with thousand-year-old technology.”<br>“The newly installed frame shift drive was powered up, which brought Forester close to tears. We also visited the habitation rings, now sustained by updated environmental systems but otherwise unchanged.”<br>“There were Artificers Clan members bustling back and forth. Each wore grime-stained overalls, criss-crossed with belts and bandoliers dangling with tools, and diagnostic scanners of some kind covering their eyes. They chattered to each other in a rapid dialect that was hard to follow, as they performed engineering work on whatever they could lay their hands on.”<br>“The chieftain explained to Captain Forester that the clan retrofitted the Golconda mainly because ‘tech-love’ was their ‘life-duty’. But the clan also asked for supplies of fresh food for their dredger, which Forester agreed to provide.”<br>“As we flew back to the outpost, I could tell that most of the Golcondans were deeply affected. I can’t blame them – the only world many of them knew for decades has been transformed. The leaders spoke of an unexpected opportunity to resume their old way of life, and questioned whether a stationary existence honours their ancestors’ dream. I get the feeling that change is in the wind.”"},{"title":"New Discovery Links Azimuth to INRA","field_galnet_date":"30 MAY 3308","imageList":["NewsImageOutpost"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>An abandoned outpost in the DG Canum Venaticorum system could reveal the true identity of the anonymous figure Salvation.<br>Professor Alba Tesreau, former head of research at Aegis, made a public announcement:<br>“An untraceable source pointed me to the DG Canum Venaticorum system with the question: Who is Salvation? A unique detail caught my attention, so I requested verification from pilots who had supported Aegis. We found a previously undiscovered research outpost once controlled by the Intergalactic Naval Reserve Arm.”<br>“The site contains logs which directly connect Azimuth Biochemicals to INRA’s development of the mycoid virus. As is now known, this bioweapon was used covertly against the Thargoids and drove them away from human space for decades.”<br>“Most significantly, I believe these logs may finally reveal Salvation’s real name and background. I urge the superpowers to halt their collaboration with Salvation while this new data is verified.”<br>INRA was a clandestine anti-xeno organisation formed in 3125 by the Empire and Federation. Although its mycoid bioweapon contributed hugely to the end of the first Thargoid war in 3151, INRA’s activities have since been denounced by the superpowers as illegal and unethical.<br>Azimuth Biochemicals was a pharmaceutical corporation secretly involved in xenological research and weapons development. Aegis has warned that Azimuth may still be active in some form, as suggested by the Project Seraph logs in HIP 22460.<br>Neither Salvation nor his partners at Taurus Mining Ventures have yet responded to Professor Tesreau’s claims."},{"title":"Rackham Announces Presidential Candidacy","field_galnet_date":"27 MAY 3308","imageList":["NewsImagePoliticalRally"],"field_galnet_body":"The trillionaire entrepreneur Zachary Rackham has officially confirmed that he will stand as a candidate in the 3309 Federal election.<br>Mr Rackham finally stated his intentions following several weeks of speculation. At a press conference, he said:<br>“I know what you’re all thinking. That guy as president? Isn’t he just a common businessman, who used to survive on scraps by trading trinkets in a rusty old Sidewinder?”<br>“But despite my humble origins, many good people have convinced me that my experience with running corporations would prove useful to the Federation. I feel like everyone’s tired of the same empty words from the two big political parties. It’s time to hear from the little guy!”<br>Mr Rackham added that it will take several weeks to prepare his manifesto and campaign team. It is unknown whether he intends to form a new political party or stand as an independent candidate.<br>There has been no comment from President Hudson or Shadow President Winters. However, several congressmen remarked that the media attention accompanying Mr Rackham’s efforts might attract more public interest in next year’s presidential race. Only 65% of eligible voters took part in the last election in 3300.<br>The Tau Ceti Journal noted that the value of shares in Rackham Capital Investments has soared to an all-time high, making many investors extremely wealthy overnight."},{"title":"Kumo Crew Crushes Rebellion","field_galnet_date":"26 MAY 3308","imageList":["NewsImageWar"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Forces involved in an attempted coup on Archon Delaine’s syndicate have been soundly defeated in the HIP 10792 system.<br>Vidar Trask, formerly an arch-corsair in the Kumo Crew syndicate, was declared dead when his private vessel was destroyed during the conflict. The few surviving ships in the Trask Death Corsairs have now abandoned his cause.<br>Reports from The Pegasi Sentinel and Vox Galactica newsfeeds have shed more light on the insurrection. Over the past few years, Trask secretly gathered followers while acting as Archon Delaine’s trusted advisor. Funded by successful gambling at Jokers’ Deck events, he bought the loyalty of many independent criminal groups to bolster his forces.<br>It has also been revealed that Trask’s previously unidentified mercenaries were members of the Blue Viper Club dredger clan. This suggests that his partner in the coup attempt was indeed Arch-Corsair Kay Volantyne, who originally hailed from the nomadic tribe. She was last seen returning to the dredger before it jumped to an unknown destination.<br>Archon Delaine, who is still recovering from last week’s assassination attempt, proclaimed:<br>“I will hunt down and slaughter every single one of Volantyne’s treacherous clan for their betrayal of my trust. That rusting hulk will find no refuge in this galaxy!”<br>Pilots who supported the Kumo Council faction can now collect rewards from Crimson Exchange in HIP 10792."},{"title":"Derelict Generation Ship Undergoes Repairs","field_galnet_date":"26 MAY 3308","imageList":["NewsImageOutpost"],"field_galnet_body":"The Artificers Clan has begun to retrofit the generation ship Golconda into a fully operational modern vessel.<br>Jonathon Forester, former captain of the vacated 22nd-century craft, provided a statement to Vox Galactica:<br>“When the dredger clan first arrived in the Upaniklis system, we feared they had come to salvage the Golconda. Instead, to our surprise, they’ve initiated engineering work on it: reinforcing the ship’s structural integrity, repairing damaged components, and installing modern engines and navigational systems. Yet the decks where our community previously lived remains untouched.”<br>“The Artificers didn’t request permission to do this, which upset many of us. But today we received a message expressing a strange, child-like excitement at finding what they called a ‘dead-hulk’, and their determination to ‘revive’ it for us. With their incredible skills, it’s possible that the Golconda could become spaceworthy again within weeks.”<br>“This has prompted a huge debate among my people. Should we return to our old home? Some have grown accustomed to the benefits of living at this outpost. Others believe we should resume journeying between the stars, as our ancestors did for centuries.”<br>“Many are looking to me for leadership, and I must admit to finding such a decision hard. I thought the Golconda was our history, but perhaps it still holds our future.”"},{"title":"Piratical Dredger Clan Departs","field_galnet_date":"24 MAY 3308","imageList":["NewsImageCoriolisGasGiantSunrise"],"field_galnet_body":"The Blue Viper Club dredger clan has unexpectedly severed ties with the Kumo Crew, which is currently battling an attempted rebellion.<br>No explanations or itinerary were provided when the nomadic tribe’s dredger jumped from the Pegasi Sector PN-T c3-14 system to an unknown destination.<br>The Blue Viper Club formed a partnership with the Kumo Crew syndicate in July 3307, when it provided a new narcotic crop that later became known as onionhead gamma strain.<br>The Pegasi Sentinel published the following exclusive:<br>“We have obtained proof that Arch-Corsair Kay Volantyne is still alive, despite rumours that she had been murdered by Vidar Trask. Our undercover reporter recorded Volantyne and her personal retinue boarding a shuttle at Kumo City starport, which docked with the Blue Viper Club’s dredger a few hours before its departure.”<br>“Volantyne was born on that vessel, and acted as the primary liaison between the spacefaring clan and the Kumo Crew. It seems that she has now abandoned her position to rejoin her people, instead of taking part in the fight against Trask’s followers.”<br>“This raises a disturbing question: were Trask and Volantyne working together to depose Archon Delaine? Last October they both attended a secret event held by the Jokers’ Deck gambling circle, famed for permitting stakes reaching billions of credits. Did their winnings provide the financial backing for a joint coup?”"},{"title":"Salvation: ‘War’s End Within Reach’","field_galnet_date":"23 MAY 3308","imageList":["NewsImageThargoidShips"],"field_galnet_body":"The anonymous scientist Salvation has made a statement following his latest success against the Thargoids.<br>The message was broadcast across all public channels:<br>“This is Salvation. The deployment of my anti-xeno superweapons in the Didio, Novas and Sosong systems was highly effective, just as I anticipated. Billions of lives were undoubtedly saved as a result.”<br>“Due to support from the Alliance, Empire and Federation, we have made a major breakthrough in utilising Guardian-based technology. Construction of the next generation of superweapons has already begun. These will allow us to deliver a truly overwhelming strike against the Thargoid species.”<br>“The end of the war is finally within reach. Those who hold faith in my work will be vindicated, and humanity can at last close the chapter on this existential threat.”<br>Commodore Morag Halloran confirmed that Taurus Mining Ventures, Salvation’s partner organisation, had received a boost in resources from all three superpowers. This included seconded naval personnel, megaship supplies and advanced engineering equipment.<br>The Alliance Defence Force, Federal Navy and Imperial Navy have stated they are now fully committed to working with Salvation on anti-xeno operations. Representatives from the Assembly, Congress and Senate expressed confidence that there would soon be decisive developments in the conflict with the Thargoids."},{"title":"Mystery in Upaniklis","field_galnet_date":"20 MAY 3308","imageList":["NewsImageStarportAnaconda"],"field_galnet_body":"A dredger clan is continuing to examine the abandoned generation ship Golconda in the Upaniklis system.<br>The Golconda was placed in orbit around Upaniklis B 3 in 3305 when its inhabitants migrated to the nearby outpost Forester’s Choice. Over the past week there have been reports of smaller craft travelling between the Artificers Clan dredger and the Golconda, but the nomadic tribe has not responded to attempts to communicate.<br>Commander Javi Alvarado, a regular visitor to the system, submitted his observations to Vox Galactica:<br>“I was convinced that these scavengers were breaking down the Golconda into scrap to feed to their dredger. Or maybe taking over the whole ship to use as a new home. But I haven’t seen any signs of structural damage yet, and it doesn’t look like the Artificers have accessed its habitation areas either. So what are they up to?”<br>“Things are a little weird in Forester’s Choice right now. It doesn’t seem anywhere near as busy, and many concourse vendors have closed down. There’s almost a kind of religious hush. For centuries their entire existence relied upon the Golconda, and its presence nearby was reassuring. I think seeing outsiders interfere with it has affected them deeply.”<br>The Federal Diplomatic Corp published an official reminder that Forester’s Choice has partner status with the Federation, adding: “As a micro-society that evolved in isolation, the Golcondan people are legally protected against cultural contamination. We will continue to monitor the Artificer Clan’s activity in the Upaniklis system.”"},{"title":"Archon Delaine Seeks to Destroy Pirate Rebels","field_galnet_date":"19 MAY 3308","imageList":["NewsImageOnionHead"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Kumo Crew syndicate has engaged in open warfare on the pirate insurrectionists gathered in the HIP 10792 system.<br>A recent coup attempt led by Arch-Corsair Vidar Trask, formerly one of the senior members of the Kumo Council, has failed. His forces were unable to eliminate Delaine and take control of the criminal organisation.<br>The rebels’ vessels have concentrated in HIP 10792. Trask is commanding a coalition of loyalists, independent pirate gangs and as-yet unidentified mercenaries, collectively calling themselves the Trask Death Corsairs.<br>Despite suffering from some visible wounds as a result of the assassination attempt, Archon Delaine broadcast this message:<br>“Trask has betrayed all of us, and for that I want him crushed! I will pay well to wipe out every single traitor who fights in his name.”<br>The Kumo Council faction will reward all independent pilots supporting its operation against the Trask Death Corsairs in the HIP 10792 system, which is being orchestrated from Crimson Exchange."},{"title":"Rackham’s Lavish Celebration Concludes","field_galnet_date":"19 MAY 3308","imageList":["NewsImageTouristStation"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>A party held by newly confirmed trillionaire Zachary Rackham has concluded, with attendees claiming it was an ‘incredible’ event.<br>The week-long event took place in the upper storeys of the Rackham’s Spire building on the planet Homeland. This required regular supplies of the luxury items Apa Vietii, Gerasian Gueuze Beer, Pantaa Prayer Sticks, Uszaian Tree Grubs and Anduliga Fire Works.<br>A spokesperson for Rackham Capital Investments thanked pilots for these deliveries, and confirmed that payment could be collected at Edmondson High in the Beta Hydri system. The spokesperson remarked that Mr Rackham himself was unable to make a personal appearance due to ‘fatigue’.<br>The Federal Times published this piece by financial journalist Bryanna Blanco:<br>“First-hand accounts from some of the partygoers suggest this was more like a no-expense-spared holiday. Each attendee was assigned an Achilles Corporation PA-961 serving robot as a personal butler, constantly attending to their every whim. An impressive range of beverages, cuisine and various legal stimulants were available. Those who wished to stay overnight were provided with luxurious suites near the peak of Rackham’s Spire, offering fantastic views of the picturesque landscape.”<br>“There were exclusive live shows from top performers, including steeldub band Gr@wl!x and popular singer Caspar Karma. Exotic entertainers from the Lucinda Ninespice Agency provided both public and private entertainment. And everyone departed with a goodie bag containing limited edition Duradrives, colonies of Altairian Skin, and gambling credit chips for the new Rackham’s Casino down below in Los Pioneros.”<br>“The guestlist included PR specialist Anya Blackriver, Sol Today’s owner Neive McFarlane, Beta Hydri Corporation’s entire board of directors, senior management from half a dozen Federal banks, and no less than eight independent, Liberal and Republican congressmen.”<br>“How many of these tried to convince Rackham that running for president was a mistake, and how many offered their support in hopes of future rewards? I’m sure the old pirate will pursue whichever route offers the greatest opportunity for new treasure.”"},{"title":"Pirate Rebels Coup Attempt Fails","field_galnet_date":"16 MAY 3308","imageList":["NewsImageAnarchyPiracySmallScaleCombat"],"field_galnet_body":"An insurrection led by Arch-Corsair Vidar Trask has failed to gain control of the Kumo Crew syndicate.<br>Vox Galactica featured a report by freelance correspondent Karleen Troy:<br>“As might be expected, it’s hard to obtain official data when conflict breaks out within a criminal organisation. But all the information I’ve gathered points to the same conclusion: Vidar Trask’s coup attempt has failed.”<br>“What is surprising, however, is how close he initially came to dethroning Archon Delaine. The Kumo Crew were almost overwhelmed by the sheer number of fighters following Trask’s banner. I’m told that nearly half of the rebelling forces have yet to be identified, and are suspected to be mercenaries.”<br>“A second mystery is that Arch-Corsair Kay Volantyne, another senior member of the Kumo Council, has been declared missing. The Pegasi Sentinel newsfeed believes that she was killed by Trask personally. The newest inner circle member, Callan Salamanca, is leading Delaine’s counter-attack against the insurrectionists.”<br>“Most of the surviving rebels have now retreated to HIP 10792 and are attempting to drive out the Kumo Council faction in that system. Eyewitness reports regarding the ongoing firefights suggest that Delaine is in no mood to forgive his would-be usurpers.”"},{"title":"Dredger Clan Visits the Golconda","field_galnet_date":"13 MAY 3308","imageList":["NewsImageStationConstruction"],"field_galnet_body":"The Artificers Clan dredger has entered the Upaniklis system, where the generation ship Golconda currently resides.<br>The Golconda, when it was discovered in 3305, was still inhabited with the descendants of its original crew who left Sol in the 22nd century. They accepted the Federation’s help to abandon the ancient generation ship and resettle on the Forester’s Choice outpost, where their unique culture would remain undisturbed.<br>The Artificers Clan is a nomadic community living aboard a Dredger-class bulk cruiser, an old design that refuels by scooping raw materials and salvage. Little is known about this particular tribe, which rarely enters inhabited systems.<br>The dredger’s arrival was initially reported by independent pilots. Commander Javi Alvarado  gave a statement to Vox Galactica:<br>“I regularly make trade runs to Forester’s Choice. I’ve made a few friends there, but the Golcondans are still very cautious with outsiders. This rush to bulk-buy their Apa Vietii for Rackham’s party has caught them by surprise!”<br>“Anyway, when the Artificers first appeared, the Golcondans asked me to find out what they wanted. I flew out to the dredger, but most of my hails got no reply. Only once did I get a burst of some rapid, densely verbose language. From what I could make out, they seem to be interested in the Golconda itself, but they didn’t explain further.”"},{"title":"Salvation Triggers Superweapon Victory","field_galnet_date":"12 MAY 3308","imageList":["NewsImageThargoidIncursion"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The invading Thargoid forces in the Didio, Novas and Sosong systems have been completely repelled by Salvation.<br>Vox Galactica journalist Jade Sanderlyn published this account:<br>“We’ve received confirmation from Commodore Morag Halloran that three anti-xeno superweapons were activated in Didio, Novas and Sosong. This caused the Thargoid fleets in all three systems to immediately withdraw into hyperspace.” <br>“It seems that the Thargoids have no defence against the Guardian-derived superweapon, which generates an electromagnetic pulse to disrupt their biomechanical technology.”<br>“Allied, Federal and Imperial taskforces have been keeping the Thargoids at bay for the last two weeks. Admirals Ziegler, Price and Atherton sent messages of congratulation to Salvation, who seems set to receive additional resources to improve superweapon production. For better or worse, it appears Salvation now plays a crucial role in humanity’s war against the Thargoids.”<br>The superpowers also offered rewards to independent pilots for contributing to the systems’ defences. Commanders can redeem Thargoid combat bonds at Plymouth Howl in the Ch'anjie system, Nusslein-Volhard Settlement in the Zlota system, and Sturckow Orbital in the Lesheima system."},{"title":"Thargoid Research Project Phase One Completed","field_galnet_date":"12 MAY 3308","imageList":["NewsImagePlanetOutpostAtmosphere"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Professor Ishmael Palin has received multiple shipments of Thargoid meta-alloys for xenological study.<br>From Abel Laboratory, his workshop in the Arque system, Professor Palin made the following announcement:<br>“I am deeply grateful to all those who collected meta-alloys from barnacle sites. Analysing these samples will help us learn more about the biomechanical technology currently employed by the Thargoid fleets.”<br>“I am planning the second phase of this project, which has the combined assistance of the Alliance, Empire and Federation. Despite the horror of the recent attacks, we must seize every chance to increase our scientific knowledge.”<br>Professor Palin has authorised payment for all pilots who took part in the initiative. This includes awarding class 4A, 5A and 6A corrosion resistant cargo racks to those who made the greatest contributions. <br>The rewards can be collected at the starport James Sneddon in the Morten-Marte system. In addition, the Federal Reclamation Co will continue to offer high prices for Thargoid tissue samples sold via the station’s market."},{"title":"Supply Rare Goods for Rackham Celebration","field_galnet_date":"12 MAY 3308","imageList":["NewsImageCelebration"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The entrepreneur Zachary Rackham has asked for deliveries of rare items to Edmondson High in the Beta Hydri system.<br>At a press conference on the planet Homeland, Mr Rackham announced:<br>“It’s not every day that a humble businessman like me celebrates becoming a trillionaire! So I’m holding a week-long party in the upper floors of Rackham’s Spire. To make sure my guests are entertained, I’ll need to keep my stocks of Apa Vietii from Upaniklis, Gerasian Gueuze Beer from Geras, Pantaa Prayer Sticks from George Pantazis, Uszaian Tree Grubs from Uszaa and Anduliga Fire Works from Anduliga high throughout the entire week.”<br>“I’ve also arranged for pilots to receive temporary permits to the Beta Hydri system, which will last until the 2nd of June. Anything to make life easier for my trader friends!”<br>Mr Rackham faced criticism for hosting a celebration at a time when so many have died in recent Thargoid attacks. In response, he claimed he had “a duty to boost public morale by filling the news with happier stories”.<br>Financial reporter Bryanna Blanco commented in The Federal Times:<br>“The guest list for this party includes politicians, media magnates, publicity gurus, and many others who would prove useful if you were running a presidential campaign. Should Rackham get enough of them on his side – presumably by sparing no expense on their comfort and entertainment – I think he’ll officially set his sights on the Federation’s top job.”"},{"title":"Archon Delaine Faces Pirate Rebellion","field_galnet_date":"11 MAY 3308","imageList":["NewsImageGoldRushMining"],"field_galnet_body":"A power struggle is raging within the Kumo Crew following a coordinated effort to overthrow the syndicate’s leader, Archon Delaine.<br>The Pegasi Sentinel newsfeed delivered this exclusive report:<br>“What at first seemed to be merely another attempt to assassinate Delaine turned out to be a far greater threat. Simultaneous attacks across the organisation revealed that this was actually the first strike in a full-blown coup.”<br>“The rebellion is being led by Arch-Corsair Vidar Trask, a senior member of the Kumo Council. He has declared that the syndicate is stagnating under Delaine’s ‘tired brand of barbarism’, and that new leadership will bring greater glories and riches.”<br>“Fierce combat has ignited in the Kumo Crew’s key areas as both sides battle for resources. Trask’s loyalists are being aided by a motley collection of pirate gangs as well as thousands of unidentified fighters, suggesting that he has hired mercenaries to bolster his forces.”<br>“Archon Delaine, whose guards barely managed to shield him from the assassins, has ordered that the insurrection must be stamped out at any cost. He also vowed an explicitly violent revenge upon Vidar Trask, who has been one of his closest aides for many years.”"},{"title":"Rackham Achieves Trillionaire Status","field_galnet_date":"09 MAY 3308","imageList":["NewsImageFuturisticCityscape"],"field_galnet_body":"The personal fortune of entrepreneur Zachary Rackham has now surpassed one trillion credits, due to a new corporate acquisition.<br>A report in The Tau Ceti Journal highlighted the achievement:<br>“Rackham Capital Investments now officially owns the company Kavanagh Spaceframes Ltd, which constructs Orbis starports. The business deal had been in the pipeline for years with little sign of progress, but was unexpectedly agreed by both parties in the last few days.”<br>“Susannah Haynes, CEO of the now-renamed Rackham Spaceframes, welcomed the arrangement. She remarked that ‘improved financial stability can only benefit our efficiency at manufacturing orbital habitats’.”<br>“Analysts estimate that the total value of Mr Rackham’s estate is now approximately 1,012,000,000,000 credits. This makes him one of a handful of private citizens in the Federation who can claim to be trillionaires.”<br>The Federal Times featured a response from the journalist Bryanna Blanco:<br>“I cannot question the legality of the Kavanagh Spaceframes purchase. But the timing is suspicious, following Rackham’s recent self-hype about running for president. Whatever he did to push this deal through, the publicity will be worth it. Political supporters and corporate investors will surely flock to his side now that he has become the Federal equivalent of royalty.”<br>"},{"title":"Marlinist Colonies Gain Starports","field_galnet_date":"06 MAY 3308","imageList":["NewsImageStationConstruction"],"field_galnet_body":"Two new starports have been added to Marlinist systems, following a successful delivery initiative last month.<br>The use of pre-built infrastructures and mass-produced components has allowed the orbital stations to be assembled rapidly. The starport names and locations are Fairfax Legacy in the Hyades Sector SU-C a14-1 system, and Ackwada Monument in the Hyades Sector LX-T c3-30 system.<br>The Marlinist Parliament welcomed the new starports, stating that they “will lay strong foundations for increased commerce with the interstellar community”.<br>As a result of a recent diplomatic arrangement, two million Marlinist refugees have been offered transport from the Alliance to the colony systems. They are being processed and granted citizenship at the new starports.<br>A campaign to rename the two existing starports, Stillman Hub and Tilman Point, was discouraged by Sirius Corporation. These stations were constructed when the megacorp first established the colonies in 3306, as a way to defuse tensions between the Empire and the Federation. <br>However, Sirius Corporation did not object to new designations for the original eight Marlinist systems. These are expected to become official in the coming weeks."},{"title":"Allied System Receives Vital Resources","field_galnet_date":"05 MAY 3308","imageList":["NewsImageStationDamaged"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Sirius Corporation has helped provide commodities to sustain the Didio system during the ongoing Thargoid assault.<br>Pilots transported multiple shipments of basic medicines, evacuation shelters and food cartridges to the megaship Chariot of Rhea in the Leesti system. These were then redirected to Didio and distributed wherever they were most urgently needed.<br>The campaign was orchestrated by Admiral Nikolas Glass, who announced:<br>“By replenishing key supplies during this time of great crisis, Sirius Corporation has again shown its dedication to the Alliance’s military efforts. This will undoubtedly pave the way for the strategic defence pact to be accepted by the Assembly once the trial period has completed.” <br>Sirius Corporation has confirmed that all pilots who contributed to the initiative can now collect payment from Chariot of Rhea in Leesti.<br>In related news, the superpowers are continuing to reward independent ships for destroying Thargoid vessels in the Didio, Novas and Sosong systems. Salvation’s anti-xeno superweapons are expected to be operational one week from today."},{"title":"Thargoid Research Project Requires Meta-Alloys","field_galnet_date":"05 MAY 3308","imageList":["NewsImageThargoidSite2"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Commanders have been asked to collect meta-alloys from Thargoid barnacles as part of a wider xenological study.<br>The research project is being orchestrated by Professor Ishmael Palin, one of the most prominent experts in Thargoid technology:<br>“With escalating Thargoid activity in the core systems, it is increasingly important that we learn as much as possible about this species. Only through scientific study can we better comprehend their biomechanical nature and, where possible, enhance our defences against it.”<br>“The initial phase requires fresh samples of meta-alloys, the unique material used in the construction of Thargoid vessels. These can be harvested from barnacles that the Thargoids have seeded on selected planets.”<br>Pilots can deliver meta-alloys to the starport James Sneddon in the Morten-Marte system. As part of the Federal Reclamation Co’s support for this initiative, the station’s market also offers an increased price for any Thargoid tissue samples.<br>In addition to credit payments for all those delivering meta-alloys, class 4A, 5A and 6A corrosion resistant cargo racks will be available to selected contributors. The 5A and 6A versions have been exclusively manufactured for this project, and are not commercially available at present.<br>Professor Palin stated that possessing these cargo racks will be of great benefit in the project’s planned second phase, scheduled to occur in the next few weeks."},{"title":"An Interview with Zachary Rackham","field_galnet_date":"04 MAY 3308","imageList":["NewsImageFederalCityscape"],"field_galnet_body":"Sol Today hosted an interview with the multi-billionaire Zachary Rackham, who is rumoured to be moving into politics.<br>From his villa at Lake Rackham, overlooking Homeland’s famous Singing Geysers, the entrepreneur spoke at length on various topics.<br>On the rise of his business empire:<br>“The hard-working folk at Rackham Capital Investments have done me proud in recent years. We’re currently holding financial talks to acquire a major starport company, so watch this space!”<br>On his role with the Beta Hydri Corporation:<br>“It’s a privilege to support my people in Beta Hydri, by helping to run their government. Things are already running smoother after I streamlined a few departments.”<br>On suggestions that he will take part in the Federal presidential election:<br>“I’m deeply flattered by calls to stand as an independent candidate. But really, an ordinary guy like me as president? I suppose it indicates that people are looking for something different to what Hudson and Winters offer.”<br>On Bryanna Blanco’s claims that he was once a pirate:<br>“Ah, you have to admire Ms Blanco’s tenacity! But ‘Calico Zack’ sounds like a character from an Olav Redcourt novel, doesn’t he? I should thank her for making me look a lot more impressive than I ever was.”"},{"title":"Thargoid Warpath May Threaten Marlinists","field_galnet_date":"02 MAY 3308","imageList":["NewsImageThargoidSite"],"field_galnet_body":"Voices in the Senate have argued that the Marlinist Colonies should have become an Imperial protectorate to shield them against the Thargoids.<br>Senator Arturo Durant was quoted by The Imperial Herald:<br>“The region containing the Marlinist Colonies sits relatively close to what is commonly regarded as Thargoid territory. A strike by the aliens would rapidly overwhelm the paltry security forces of a handful of under-developed systems.”<br>“Naturally we respect Her Majesty’s decision to acknowledge their autonomy, but many feel that the Marlinists may regret the decision to sit outside our protective sphere. After all, these were once Imperial citizens. It’s our duty to defend them, whether or not they grant us permission.”<br>First Minister Octavia Volkov published a response via The Marlin Standard:<br>“The proximity of the Thargoids is an ever-present concern, and it’s true that we do lack a dedicated navy. But many authorised militias such as the Dark Wolf Marlinists have fought courageously to defend our people, and will do so again should the Thargoids turn their attention our way.”<br>“I remind the senator that we have not only retained control of the original colonies, but also expanded into over two dozen neighbouring systems. Marlin Duval’s dream of forming an interstellar republic is finally flourishing, after centuries of being repressed within the Empire.”"},{"title":"The Sanderlyn Interviews (Part Three)","field_galnet_date":"01 MAY 3308","imageList":["NewsImagePressConferenceAlliance"],"field_galnet_body":"The journalist Jade Sanderlyn of Vox Galactica was recently invited to conduct rare public interviews with admirals of the three superpowers. <br>This excerpt is from a conversation with Admiral Rachel Ziegler of the Alliance.<br>Jade Sanderlyn: This is Jade Sanderlyn reporting for Vox Galactica. I am here with Admiral Rachel Ziegler of the Alliance. I’m pleased to have this opportunity to speak with you, Admiral.<br> Rachel Ziegler: You’re welcome.<br>JS: We’re on board the Salote Charm, which is currently stationed in the Didio system. Two days ago, a large Thargoid force arrived here and began attacking human ships and ports. There are reports that Salvation has asked your fleet, and those of the other superpowers, to hold the Thargoid force at bay until the anti-xeno superweapon…<br>RZ: Let me clarify your question before you finish it. My priority is the safety of the billions who call Didio home. We are not here to keep the Thargoid forces occupied. We are here to defeat them.<br>JS: Understood, Admiral. Salvation has asked for time to prepare his superweapon, though?<br>RZ: Yes, he has. But the Alliance does not operate with the assumption that Salvation will deliver on his promise.<br>JS: Do you support Salvation’s methods? Critics have suggested he endangers lives by using a powerful weapon that has not been independently assessed by experts.<br>RZ: Whether I support or do not support Salvation is immaterial. The fact is that, on two previous occasions, the superweapon has eliminated Thargoid fleets from entire systems. Rejecting such a powerful device would be unwise. Still, I think the question of risk is wholly appropriate. Military and political figures alike must not become complacent or over-reliant on Salvation’s technology. Particularly when we know so little about it.<br>JS: Is that ambiguity a concern for the Alliance?<br>RZ: It should be a concern for everybody. So far, Salvation has acted in our best interests. But a weapon that powerful would be considerably dangerous if recalibrated to damage human technology. Imagine what the NMLA could have done with such a device.<br> JS: Terrible things, no doubt. But your fleet in Didio could be seen as a tacit endorsement of Salvation by Allied leadership, regardless of your personal views.<br>RZ: As I said, Salvation’s results are highly impressive.<br>JS: Let’s hope they remain so. We’ll take a short break. Join us after these messages.<br>The rest of this interview is available to pilots arriving at the megaship Salote Charm in the Didio system.<br>"},{"title":"The Sanderlyn Interviews (Part Two)","field_galnet_date":"30 APR 3308","imageList":["NewsImagePressConferenceFederal"],"field_galnet_body":"The journalist Jade Sanderlyn of Vox Galactica was recently invited to conduct rare public interviews with admirals of the three superpowers.<br>This excerpt is from a conversation with Admiral Henry Paul Atherton of the Empire.<br>Jade Sanderlyn: This is Jade Sanderlyn reporting for Vox Galactica. I am sitting with Admiral Henry Paul Atherton of the Imperial Navy. Thank you for agreeing to this interview, Admiral.<br>Henry Paul Atherton: Oh, please. Call me Henry.<br>JS: I’d be delighted to. This is a very impressive ship, Henry.<br>HPA: Some might say Majestic. [laughs] Yes, the Succession is a wonderful vessel. <br>JS: How long have you commanded her?<br>HPA: Several years now. It has been an honour to have my name listed on the Succession’s exemplary service record. <br>JS: You were promoted to admiral only three years ago. Does that change the personal dynamic with your crew at all?<br>HPA: Well, they salute a little faster, I suppose. Happily I enjoy a strong relationship with my officers, so they took the change fully in stride. <br>JS: Let’s talk about Novas. I understand that the Imperial Navy has deployed a fleet here at Salvation’s request.<br>HPA: That’s correct.<br>JS: Emperor Arissa recently resumed her duties following… an extended absence from the throne. Having now surely been briefed on Salvation’s work, does the Emperor endorse Salvation?<br>HPA: If the Emperor had objections, her navy would not be in Novas.<br>JS: What are your objectives in the system?<br>HPA: Well, in case it has gone unnoticed, there is a major Thargoid invasion occurring here. It is our duty to protect civilian populations and prevent the loss of strategic assets.<br>JS: I’m pleased that you mentioned civilian lives first. Does Salvation share this approach?<br>HPA: Almost certainly. Why else would he invest so much effort into his marvellous superweapon if not to protect people?<br>JS: Some have claimed that Salvation prioritises victory over safety.<br>HPA: Jade, dear: they are the same thing. The cost of war is human lives, and the Thargoids extract a heavy toll. Every invaded system. Every burning starport. Every ambushed convoy. Every ship lost to hyperspace. We have repeatedly driven the Thargoids back from our space, but the wretched things keep returning. That cost grows each day. Salvation’s superweapon has proven effective at wiping Thargoids from entire systems at a stroke. If Salvation calls that victory while you and I call it saving lives, then I’m comfortable with the difference in perspective.<br>JS: Thank you for elaborating. Let’s take a break. We’ll be back after these messages.<br>The rest of this interview is available to pilots arriving at the INV Succession in the Novas system."},{"title":"The Sanderlyn Interviews (Part One)","field_galnet_date":"29 APR 3308","imageList":["NewsImagePressConferenceImperial"],"field_galnet_body":"The journalist Jade Sanderlyn of Vox Galactica was recently invited to conduct rare public interviews with admirals of the three superpowers.<br>This excerpt is from a conversation with Admiral Henry Paul Atherton of the Empire.<br>Jade Sanderlyn: This is Jade Sanderlyn reporting for Vox Galactica. I am sitting with Admiral Henry Paul Atherton of the Imperial Navy. Thank you for agreeing to this interview, Admiral.<br> Henry Paul Atherton: Oh, please. Call me Henry.<br>JS: I’d be delighted to. This is a very impressive ship, Henry.<br>HPA: Some might say Majestic. [laughs] Yes, the Succession is a wonderful vessel. <br>JS: How long have you commanded her?<br>HPA: Several years now. It has been an honour to have my name listed on the Succession’s exemplary service record. <br>JS: You were promoted to admiral only three years ago. Does that change the personal dynamic with your crew at all?<br>HPA: Well, they salute a little faster, I suppose. Happily I enjoy a strong relationship with my officers, so they took the change fully in stride. <br>JS: Let’s talk about Novas. I understand that the Imperial Navy has deployed a fleet here at Salvation’s request.<br>HPA: That’s correct.<br>JS: Emperor Arissa recently resumed her duties following… an extended absence from the throne. Having now surely been briefed on Salvation’s work, does the Emperor endorse Salvation?<br>HPA: If the Emperor had objections, her navy would not be in Novas.<br>JS: What are your objectives in the system?<br>HPA: Well, in case it has gone unnoticed, there is a major Thargoid invasion occurring here. It is our duty to protect civilian populations and prevent the loss of strategic assets.<br>JS: I’m pleased that you mentioned civilian lives first. Does Salvation share this approach?<br>HPA: Almost certainly. Why else would he invest so much effort into his marvellous superweapon if not to protect people?<br>JS: Some have claimed that Salvation prioritises victory over safety.<br>HPA: Jade, dear: they are the same thing. The cost of war is human lives, and the Thargoids extract a heavy toll. Every invaded system. Every burning starport. Every ambushed convoy. Every ship lost to hyperspace. We have repeatedly driven the Thargoids back from our space, but the wretched things keep returning. That cost grows each day. Salvation’s superweapon has proven effective at wiping Thargoids from entire systems at a stroke. If Salvation calls that victory while you and I call it saving lives, then I’m comfortable with the difference in perspective.<br>JS: Thank you for elaborating. Let’s take a break. We’ll be back after these messages.<br>The rest of this interview is available to pilots arriving at the INV Succession in the Novas system.<br>"},{"title":"Sirius Initiative Plans Aid for Alliance","field_galnet_date":"28 APR 3308","imageList":["NewsImageStation"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Sirius Corporation has organised humanitarian support for the Didio system, which is under attack by Thargoid vessels.<br>The Alliance Defence Fleet is currently combating the Thargoid threat in Didio, under the command of Admiral Rachel Ziegler. <br>Admiral Nikolas Glass, who acts as a liaison between the megacorp and the Alliance Defence Force, provided details of the campaign:<br>“With the strategic defence pact yet to be ratified, the Council of Admirals has not approved the deployment of Sirius Navy ships as part of an Allied fleet. However, Sirius Corporation is keen to show its commitment to helping the Alliance, and will do so by supplying vital resources to the Didio system’s besieged population.”<br>“Large quantities of basic medicines, evacuation shelters and food cartridges are urgently required. These can be delivered to the megaship Chariot of Rhea in the Leesti system, from where they will be delivered to Didio in military convoys.”<br>Sirius Corporation has been criticised for not providing similar support to the Novas and Sosong systems, which have also been invaded. A spokesperson for the megacorp stated that the strategic defence pact’s trial applies exclusively to the Alliance. Any similar relationship with the Empire and Federation would require separate negotiations, though the spokesperson stressed that Li Yong-Rui has no interest in such talks at this time.<br>A joint operation between the superpowers is currently underway in Didio, Novas and Sosong to counter recent Thargoid invasions. This is to buy time for Salvation’s anti-xeno superweapons to be constructed."},{"title":"Superpowers Employ Pilots to Hunt Thargoids","field_galnet_date":"28 APR 3308","imageList":["NewsImageStation"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Alliance, Empire and Federation are offering bounties on Thargoid vessels in the Didio, Novas and Sosong systems.<br>Commodore Morag Halloran, who coordinates Salvation’s military forces, broadcast this message on public channels:<br>“Salvation has started construction of three anti-xeno superweapons to expunge the latest Thargoid infestation. He estimates two more weeks before these devices become operational. Until that time, it is vital that we keep the Thargoids at bay to minimise civilian casualties.”<br>The anti-xeno taskforces of the Alliance Defence Force, Federal Navy and Imperial Navy are cooperating on a joint operation to buy time for the superweapons to be completed. This includes rewarding independent pilots for defending the Didio, Novas and Sosong systems.<br>Commanders can hand in combat bonds for Thargoid kills until the 12th of May 3308 at these three locations: the megaship Plymouth Howl in the Ch'anjie system, Sturckow Orbital in the Lesheima system, and Nusslein-Volhard Settlement in the Zlota system.<br>Each superpower has also deployed a capital ship to the invaded systems: the Allied megaship Salote Charm in Didio, the Majestic-class interdictor INV Succession in Novas, and the Farragut-class battle cruiser FNS Amphion in Sosong.<br>Jade Sanderlyn, a reporter for Vox Galactica, has been granted permission to interview the admirals in command of the taskforces. Her conversations with Henry Paul Atherton, Maxton Price and Rachel Ziegler are being broadcast by the capital ships and will be syndicated via newsfeeds."},{"title":"Marlinist Refugees Migrate from Alliance","field_galnet_date":"27 APR 3308","imageList":["NewsImageArrivingShip"],"field_galnet_body":"Over two million ex-Imperial citizens who sought sanctuary with the Alliance are now being repatriated to the Marlinist Colonies.<br>Ambassador Elijah Beck, head of the Alliance Office of Diplomatic Relations, announced:<br>“Political refugees from Imperial systems have been arriving since late 3306, following the Empire’s crackdown on Marlinism. At the time they had no legal status or resources, and relied entirely upon the charity of local factions for their survival.”<br>“Our successful negotiations with the Marlinist Consulate have now led to a solution. The Assembly will fund safe passage to the Marlinist Colonies for all refugees in Allied space. Pending security checks, they will be granted full citizenship.”<br>The decision was welcomed by First Minister Octavia Volkov:<br>“Thanks to the Alliance’s generosity, any Marlinists currently within their territory can now take advantage of free transportation to a colony system of their choice. There we will provide state support and work opportunities, to help them establish new permanent homes.”<br>“More than a million people who fled the Empire are still unaccounted for, having dispersed throughout the core systems. I call for them to contact us via the consulate, and join our growing republican society.”"},{"title":"Kumo Crew Appoints New Council Leader","field_galnet_date":"26 APR 3308","imageList":["NewsImageAnarchyPiracySmallScaleCombat"],"field_galnet_body":"Archon Delaine has announced that pirate leader Callan Salamanca is the newest member of the Kumo Council’s upper echelon.<br>Political journalist Conrad Sterling provided an overview for Vox Galactica:<br>“The Kumo Council was formed by Archon Delaine to delegate his control over the criminal syndicate. Each member has the title of corsair, and oversees a region or system within his territory. But Delaine’s most trusted advisers, known as arch-corsairs, work with him on strategic goals.”<br>“The latest addition is the son of Gideon ‘Soulless’ Salamanca, one of the most infamous warlords in the Pegasi sector. Following Salamanca’s unexpected death from a cardiac event, Delaine has elevated Callan to take his father’s place on the council, despite the young man’s reputation for impulsive behaviour.”<br>“Two others remain in the council’s inner circle. Vidar Trask has been close to Delaine for many years and is known to be an expert administrator. Kay Volantyne was originally part of the Blue Viper Club dredger clan, before she negotiated its alliance with the Kumo Crew.”<br>“Delaine continues to style himself as the ‘sovereign ruler of the Kumo nation’, striving for an air of legitimacy. The Kumo Council reinforces this approach, but is often called upon to justify or deny their regent’s brutal excesses. With rumours that Callan Salamanca is already misusing his newfound authority, this delicate balance might prove to be unsustainable.”"},{"title":"Sirius Vows to Defend Alliance","field_galnet_date":"25 APR 3308","imageList":["NewsImageThargoidShips"],"field_galnet_body":"Sirius Corporation has claimed that the recent Thargoid incursions prove the necessity of its strategic defence pact with the Alliance.<br>The Didio, Novas and Sosong systems are currently withstanding a coordinated attack from large numbers of Thargoid vessels. Independent pilots have rushed to their aid while the three superpowers prepare their respective fleet responses.<br>A press conference was held by Admiral Nikolas Glass, the liaison between the Alliance Defence Force and the Sirius Navy:<br>“This unexpected onslaught only underlines the Alliance’s need for military support. The Thargoids can strike anywhere at any time, and Allied systems such as Didio are vulnerable. Only with Sirius Corporation’s help can we ensure their safety.”<br>Journalists pointed out that the Council of Admirals had selected Admiral Rachel Ziegler to lead their anti-xeno taskforce instead of Admiral Glass, despite that being his specific area of expertise. He replied:<br>“Well, as you know, the pact is still within its trial period and hasn’t yet been ratified by the Assembly. So there are limits to how involved Sirius Corporation can be at this stage. I’m sure my colleague will do a fine job while I focus on providing broader support to the Didio system, such as additional secondments to Salvation’s fleet.”"},{"title":"Sirius Vows to Defend Alliance","field_galnet_date":"25 APR 3308","imageList":["NewsImageThargoidShips"],"field_galnet_body":"<p>Sirius Corporation has claimed that the recent Thargoid incursions prove the necessity of its strategic defence pact with the Alliance. The Didio, Novas and Sosong systems are currently withstanding a coordinated attack from large numbers of Thargoid vessels. Independent pilots have rushed to their aid while the three superpowers prepare their respective fleet responses. A press conference was held by Admiral Nikolas Glass, the liaison between the Alliance Defence Force and the Sirius Navy: “This unexpected onslaught only underlines the Alliance’s need for military support. The Thargoids can strike anywhere at any time, and Allied systems such as Didio are vulnerable. Only with Sirius Corporation’s help can we ensure their safety.” Journalists pointed out that the Council of Admirals had selected Admiral Rachel Ziegler to lead their anti-xeno taskforce instead of Admiral Glass, despite that being his specific area of expertise. He replied: “Well, as you know, the pact is still within its trial period and hasn’t yet been ratified by the Assembly. So there are limits to how involved Sirius Corporation can be at this stage. I’m sure my colleague will do a fine job while I focus on providing broader support to the Didio system, such as additional secondments to Salvation’s fleet.”</p><br>"},{"title":"Rackham Consolidates in Beta Hydri","field_galnet_date":"22 APR 3308","imageList":[],"field_galnet_body":"The Beta Hydri system has become the commercial and political headquarters of wealthy entrepreneur Zachary Rackham.<br>The Tau Ceti Journal reported that Rackham Capital Investments owns a majority of shares in the Beta Hydri Corporation, the system’s controlling faction. As a member of its board of directors, Rackham has had a role in governing the system for many months.<br>At a press conference, a spokesperson for Rackham Capital Investments said:<br>“Mr Rackham was born on the planet Homeland, so he is enthusiastic about giving back to his former community. For example, building Rackham’s Spire helped revive the construction industry in Los Pioneros. We have also invested in several local companies, such as the Luxe Somptueux hotel chain – now rebranded as Rackham’s Rooms – and MacArthur Mining Ltd.”<br>Several newsfeeds asked if Rackham’s political position in Beta Hydri paved the way for running as an independent candidate in next year’s presidential election. However, the spokesperson declined to comment.<br>The Federal Times’s coverage of the story included an observation by financial journalist Bryanna Blanco:<br>“As far as my research can tell, Zachary Rackham’s citizenship documents have never been made public or independently verified. My guess is that Calico Zack wasn’t born in the Federation at all, but hails from some anarchic backwater where piracy is a way of life.”"},{"title":"Marlinist Colonies Receive Starport Resources","field_galnet_date":"21 APR 3308","imageList":["NewsImageNewEquipmentSale"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The construction of new Marlinist starports has begun after materials were delivered to the HIP 22550 system.<br>Enough shipments of aluminium, computer components, power generators and titanium were received at Stillman Hub to facilitate the building of 2 orbital stations. These are expected to become operational by the 5th of May 3308.<br>The campaign’s conclusion was marked by a statement from First Minister Octavia Volkov:<br>“Not for the first time in our turbulent history, we are indebted to all pilots who have shown support for the Marlinist Colonies. With these additional starports, we can increase local commerce and contribute to the wider economy.”<br>“It is my sincere hope that our handful of systems will one day form the nucleus of a Marlinist Republic, which can peacefully co-exist alongside our Imperial cousins.”<br>The Free Marlinists of Carinae faction is now rewarding all pilots who took part in this initiative at Stillman Hub in the HIP 22550 system.<br>In related news, Prime Consul Kayode Tau has been invited to establish an office of the Marlinist Consulate on Capitol. This is being widely viewed as a sign of increased diplomatic tolerance from the Emperor."},{"title":"Superpower Systems Overrun by Thargoids","field_galnet_date":"21 APR 3308","imageList":["NewsImageThargoidIncursion"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Thargoid fleets have invaded the Didio, Novas and Sosong systems, placing over ten billion lives at risk.<br>Local security services in all three systems have reported overwhelming numbers of hostile Thargoid vessels. Several starports have been directly attacked with caustic enzyme weapons, and the combined death toll is already in the hundreds of thousands.<br>Didio, Novas and Sosong are members of the Alliance, Empire and Federation respectively. Three admirals have been selected to mount a defence: Henry Paul Atherton of the Imperial Navy, Maxton Price of the Federal Navy and Rachel Ziegler of the Alliance Defence Force. <br>However, it will be days before each can marshal sufficient forces. Therefore the factions Emperor’s Grace, LTT 4772 Alliance Mandate and Union of Sosong Democrats have sent out emergency calls for assistance to all independent pilots.<br>With Aegis now officially disbanded, its fleet is being temporarily operated by Frontline Solutions. The combat logistics corporation has made the ships available with a volunteer pilot force, which will support the superpowers in systems invaded by Thargoid fleets. Sources indicate a more permanent solution is being sought, as Frontline Solutions CEO Imogen le Ray is believed to be resistant to a long-term commitment of her company’s resources to the anti-xeno effort.<br>The Alliance, Empire and Federation are currently liaising with Salvation, whose unique weaponry has proved effective against Thargoid incursions of similar magnitude. As yet, Salvation has made no public statement."},{"title":"Yong-Rui: ‘History Will Judge Sirius’","field_galnet_date":"19 APR 3308","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"The CEO of Sirius Corporation has addressed public concerns regarding its anti-xeno defence pact with the Alliance.<br>Li Yong-Rui’s comments were made during an in-depth interview with The Alliance Tribune:<br>“The best way to predict the future is to study the past. This is as true of interstellar organisations as it is of individuals – our former actions indicate the probability of behaviour. So I invite you to study the role that Sirius Corporation has previously played on the political stage.”<br>“Ever since the Battle of Achenar and the widespread conflicts of the 2300s, our neutrality has allowed us to mediate between the Empire and the Federation on many occasions. More recently, we defused inter-power tensions by establishing the Marlinist Colonies, which provided permanent homes for millions of refugees.”<br>“It should also not be overlooked that the Galactic Summit was hosted in the Sirius system, where we encouraged humanity’s leaders to peacefully debate their differences. Furthermore, our development of the frame shift drive has revolutionised exploration and allowed many independent societies to flourish.”<br>“Some continue to cast aspersions on our strategic partnership with the Alliance, and I fully understand their caution. The fear that corporations can only act self-servingly is born from a millennium of notable examples. But it is history that will judge Sirius Corporation’s efforts to defend and preserve civilisation. I truly hope the Alliance will play a significant role in those efforts.”"},{"title":"Salvation Strengthens Bonds with Superpowers","field_galnet_date":"18 APR 3308","imageList":["NewsImageFederationFleet"],"field_galnet_body":"The anonymous anti-xeno scientist Salvation has received further military support from the Alliance, Empire and Federation.<br>Multiple official sources have highlighted the increasing number of crew members being seconded from the Alliance Defence Force, Federal Navy and Imperial Navy. Previously, enlisted members had been forced to resign their commissions, but regulatory changes now permit temporarily serving on vessels owned by Salvation’s commercial partner Taurus Mining Ventures.<br>One of the recent volunteers, Lieutenant Andrew Jones, was quoted by Vox Galactica:<br>“Most of us are here because it feels like Salvation is the only one taking the fight to the Thargoids. Now that Aegis is as good as gone, he’s our best hope for stopping these aliens before they wipe us all out.”<br>Other non-naval recruits from the superpowers are providing support in intelligence, logistics and security. A number of specialists are alleged to be working directly with Salvation on his anti-xeno superweapons, which are derived from Guardian technology.<br>In related news, scientific research journal The Empirical reported that no evidence of atypical radiation has been detected in the Synuefe CE-R C21-6 system. This has raised questions as to the purpose of Taurus Mining Ventures’s recent mining operation."},{"title":"Rackham for President?","field_galnet_date":"15 APR 3308","imageList":["NewsImageFuturisticCityscape"],"field_galnet_body":"Multi-billionaire Zachary Rackham has discussed standing as an independent candidate for the Federal presidency in 3309.<br>The issue was raised during the opening of a new superstructure named Rackham’s Spire on Homeland in the Beta Hydri system. At a press conference in the tropospheric suite, Mr Rackham was asked for his views on the proposed Hudson Contravention.<br>He replied by light-heartedly hinting that he might run for office himself: “With two Zacharys on the ballot, I’m guaranteed to get some votes by mistake!”<br>Financial journalist Bryanna Blanco wrote an opinion piece for The Federal Times:<br>“Rackham’s Spire literally stabs the sky above Los Pioneros, rising so high that during the day its shadow moves across the city like a colossal sundial. Extravagant, expensive and impossible to ignore, it’s practically an altar to the man who built it.”<br>“I’ve spent half of my career investigating Rackham, and I’m convinced that he always has an ulterior motive. In this case it seems obvious: by laughing off suggestions about standing for election, he makes people expect it to become true. It’s blatantly the first step to a forthcoming campaign.”<br>“It still mystifies me how Rackham makes people forget his past. Most newsfeeds refuse to acknowledge his former identity as Calico Zack, one of the last century’s most notorious pirates. All they portray is the wealthy and successful businessman – and now, perhaps, a future president of the Federation.”"},{"title":"Support Required for New Marlinist Starports","field_galnet_date":"14 APR 3308","imageList":["NewsImageExpansionExploration"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>A delivery campaign in the HIP 22550 system will help build additional starports for the Marlinist Colonies.<br>First Minister Octavia Volkov delivered this public address:<br>“The Marlinist Colonies were born out of desperation, but we have evolved into a fully fledged society. Emperor Arissa has formally accepted our status as an autonomous democracy, albeit one that retains cultural and historical ties with the Empire.”<br>“To celebrate and consolidate our independence, we have launched an initiative to construct up to six new orbital stations. For all those who wish to take part, we require shipments of aluminium, computer components, power generators and titanium to be transported to Stillman Hub starport.”<br>“I am also delighted to announce that Universal Cartographics has approved our petition to rename the original eight systems of the Marlinist Colonies. These are expected to officially change in the near future.”<br>The Free Marlinists of Carinae faction has confirmed that it will offer rewards to pilots who deliver the necessary materials to Stillman Hub in the HIP 22550 system."},{"title":"Sirius Defends Alliance Territory","field_galnet_date":"13 APR 3308","imageList":["NewsImageExpansionExploration"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Sirius Corporation megaships will soon arrive in the Coalsack and Witch Head Nebulas to provide anti-xeno support.<br>The three vessels are intended as a demonstration of Sirius Corporation’s military capabilities, prior to the strategic defence pact being ratified by the Alliance Assembly.<br>A public statement was provided by Admiral Nikolas Glass, the Sirius Navy representative on the Alliance Council of Admirals:<br>“The Coalsack Nebula and Witch Head Nebula regions are where Alliance interests are most at risk from Thargoid attack. From tomorrow, our megaships will serve as bases from which anti-xeno operations can be conducted.”<br>“All ships in the area are invited to make use of the Song of Mecchi in the Coalsack Sector Vu-O B6-6 system, the Kandula's Truth in the Siniang system, and the Li Chyou Winds in the Onoros system.”<br>“As a further gesture of our dedication to protecting the Alliance, these megaships will offer a unique pre-engineered heat sink module. We trust that this will prove especially useful to those brave pilots who face the Thargoids in combat.”"},{"title":"Arissa Accepts Marlinists’ Independence","field_galnet_date":"12 APR 3308","imageList":["NewsImageImperialPalace"],"field_galnet_body":"Following a referendum by the Marlinist Colonies, Emperor Arissa Lavigny-Duval has formally recognised their autonomous status.<br>Prime Consul Kayode Tau of the Marlinist Consulate reported on his latest meeting with the Emperor:<br>“Her Majesty was clearly uncomfortable with the democratic way in which the ex-Imperial citizens in the colonies now govern themselves. But she gracefully acknowledged that the Marlinist population had declined her invitation to become an Imperial protectorate, and would thus remain independent.”<br>“However, there was a proviso to Emperor Arissa’s acceptance of the decision. She insisted that the Marlinist Colonies must work with the Empire’s intelligence agencies to prevent any resurgence of the NMLA or similar terrorist groups.”<br>It has since been agreed that Imperial Intelligence and the Marlinist Constabulary would collaborate on identifying Neo-Marlinist extremists. Colonel Saskia Landau and Major Milo Castile, both former co-leaders of ACT, have agreed to work together once again.<br>In recognition of the minority who voted to rejoin the Empire, dedicated customs and immigration channels for registered Marlinist citizens will soon be established."},{"title":"Marlinists Reject Emperor’s Offer","field_galnet_date":"08 APR 3308","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"A public referendum in the Marlinist Colonies has resulted in the majority voting to remain fully independent from the Empire.<br>Emperor Arissa Lavigny-Duval had proposed to make the colony systems an Imperial protectorate in return for Marlinist allegiance to the Imperial throne. This would have permitted an autonomous government while creating many civil and military links.<br>First Minister Octavia Volkov announced the referendum’s results in the Marlinist Parliament:<br>“Our people have given us a clear mandate: the colonies stand alone. In accordance with the key principles of Marlinism, we reject monarchy rule in favour of republican governance and direct representation.”<br>“Most of us are still haunted by the trauma of becoming refugees in 3306, when millions of innocent Marlinists were accused of supporting terrorist acts. We fled from an Empire that had become intolerant and abusive. This cannot be so easily forgotten.”<br>“Nevertheless, we recognise that approximately a quarter of our population voted to accept the Emperor’s proposal. The ties to our homelands remain strong, and we still share much culture and history with the Empire. But the will of the masses is evident.”<br>“I offer my thanks to Her Majesty for extending this offer, and call upon her to recognise and respect the decision of the Marlinist Colonies.”"},{"title":"Taurus Mining Ventures Operation Concludes","field_galnet_date":"07 APR 3308","imageList":["NewsImageAdderMining"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>A corporate initiative to mine and deliver ores to the Synuefe CE-R c21-6 system has ended successfully.<br>Taurus Mining Ventures had performed scientific research within the system, claiming that the properties of some natural substances had been altered by an unknown type of local radiation.<br>The company’s head of research Dr Ruben Carpenter announced: <br>“We now have sufficiently large quantities of coltan, lithium hydroxide and methanol monohydrate crystals mined from locations in Synuefe CE-R c21-6. These irradiated ores will be analysed to determine their potential commercial value. Samples that were provided from other systems will also be very useful in our comparative studies.”<br>“To all the pilots who assisted in this endeavour: thank you! Your hard work is greatly appreciated. The Heart of Taurus megaship will remain in Synuefe CE-R c21-6 for several weeks, and you may collect your rewards from there.”<br>Taurus Mining Ventures confirmed that studies to identify the source, effects and application of the local radiation are continuing. The scientific journal The Empirical has reiterated that these ‘atypical radioactive signatures’ have not been independently verified."},{"title":"Marlinists Hold Public Referendum","field_galnet_date":"05 APR 3308","imageList":["NewsImageRetailPlaza"],"field_galnet_body":"The population of the Marlinist Colonies will vote to accept or decline the offer to become an Imperial protectorate.<br>Emperor Arissa Lavigny-Duval’s proposal aims to build links between the independent colony systems and the Empire, from where the Marlinists originally fled as political refugees in 3306.<br>The Marlin Standard ran an editorial summarising the situation:<br>“Should the Marlinist Colonies remain an isolated republican society, or should we move beneath the Empire’s protective wing? It’s a question that most of us never expected to be asked.”<br>“Many expressed fierce anger that Emperor Arissa has dared to ask for our allegiance. In her desperation to hunt down the NMLA she persecuted all believers in Marlinism, arresting thousands and displacing millions of her own citizens. Can we now trust her to welcome us back?”<br>“Others are concerned that the Marlinist Colonies remain vulnerable, claiming that becoming a satellite nation of the Empire would provide military defences as well as economic boosts. And for those still holding on to their past lives, the attraction of reconnecting with friends and family in the Empire is strong.”<br>“Whatever the outcome, First Minister Octavia Volkov’s swift decision to put this issue to a referendum is a splendid example of Marlinism in action. Votes are already being cast, and the result will be revealed at the end of this week.”"},{"title":"Hudson Contravention Vote is Suspended","field_galnet_date":"01 APR 3308","imageList":["NewsImagePressConferenceFederal"],"field_galnet_body":"Federal Congress has temporarily postponed making a decision on whether to extend presidential term limits.<br>President Zachary Hudson had proposed to repeal the 77th amendment of the Federal Accord, which specifies that a president can serve for a maximum of eight years. If approved, Hudson would become eligible for re-election in June 3309.<br>A statement was delivered by President Hudson:<br>“I have agreed that more time is needed to analyse the potential repercussions of this change to the Federation’s constitution. A congressional subcommittee will perform a detailed inquiry to investigate the civil and legal aspects.”<br>“In addition, I am very conscious of the public disturbances caused by the Hudson Contravention. This delay should help to defuse political tension and provide our security services with an opportunity to keep the peace.”<br>Shadow President Winters welcomed the president’s decision, and spoke of her eagerness to read the subcommittee’s report."},{"title":"Reorte System Remains Allied","field_galnet_date":"31 MAR 3308","imageList":["NewsImageStation"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>The Reorte Pro-Alliance League’s success over the Reorte Mining Coalition means the system will stay in the Alliance.<br>A greater quantity of advanced medicines, skimmer components and building fabricators were delivered to the Trobairitz megaship than to the opposing faction. As a result, Reorte will remain an Allied system.<br>Pilots who contributed to the Reorte Pro-Alliance League’s initiative can now collect their rewards at the Trobairitz, along with the additional pre-engineered heat sink modules provided by Sirius Corporation.<br>Chief Administrator Louisa Leblanc proclaimed:<br>“I am deeply grateful to all those who helped convince our people that Reorte’s future is more secure with the Alliance. We look forward to working alongside Sirius Corporation on increasing defences against the Thargoids.”<br>The Reorte Mining Coalition’s CEO Fergus Cassidy expressed his regret that their campaign to renounce membership of the Alliance failed to gather the necessary support. He thanked those who supported them, and confirmed that credit rewards for contributing pilots are now available at Davies High starport."},{"title":"Taurus Mining Ventures Calls for Support","field_galnet_date":"31 MAR 3308","imageList":["NewsImageGoldRushMining"],"field_galnet_body":"*Pilots’ Federation ALERT*<br>Taurus Mining Ventures has requested help with a mining and delivery operation in the Synuefe CE-R c21-6 system.<br>In recent weeks, the mining corporation has performed research on what it claims are atypical radiation signatures detected within Synuefe CE-R c21-6. It now seeks shipments of the system’s native ores to explore commercially valuable applications of any molecular changes caused by this radiation.<br>Dr Ruben Carpenter, head of the company’s research division, outlined the initiative:<br>“I’m very excited to offer pilots this opportunity to support our scientific studies, which will hopefully prove lucrative for all involved. We require coltan, lithium hydroxide and methanol monohydrate crystal to be mined from locations within Synuefe CE-R c21-6 and delivered to the Heart of Taurus megaship.”<br>“We will also pay for shipments of the same ores that have been mined from other systems. These will allow us to compare samples, in order to refine our commercial processes.”<br>Taurus Mining Ventures is known for its close association with the anonymous anti-xeno specialist known as Salvation. However, there is no indication that this mining operation is connected to Salvation’s efforts to combat the Thargoids."},{"title":"Empire Reaches Out to Marlinists","field_galnet_date":"29 MAR 3308","imageList":["NewsImageShipyardImperial"],"field_galnet_body":"Emperor Arissa Lavigny-Duval has outlined a plan for the Marlinist Colonies to be officially reconnected with the Empire.<br>The Marlin Standard published an exclusive report from Prime Consul Kayode Tau, after he attended a diplomatic meeting on Capitol:<br>“The essence of Emperor Arissa’s proposal is a pledge to grant the status of Imperial protectorate to the Marlinist Colonies, in return for swearing allegiance to the throne.”<br>“In practice, local government would remain autonomous but the Imperial Navy and security agencies would have a permanent presence. There would be investment in trade, with Empire-based companies as preferred partners. New channels of transportation and communication would be opened between Marlinist and Imperial systems.”<br>“Emperor Arissa and I discussed the issues at length. Following her experience with the Lords of Restoration, Her Majesty now accepts that most believers in Marlinism are not terrorists or revolutionaries. She has, however, insisted that the Empire must be watchful for any Neo-Marlinist resurgence.”<br>“When I broached the topic that some senators had suggested absorbing the Marlinist Colonies by force, the Emperor assured me there would be no military action. She spoke of her ‘need to cleanse the wounds left by the NMLA’, and I believe this is a genuine sentiment.” <br>The Marlinist Parliament has received full details of the proposal and is preparing a response."}]